{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":79,"items":[{"title":"Rebooting A Retro PDP-11 Workstation - and Its Classic 'Venix' UNIX","url":"https://tech.slashdot.org/story/25/03/22/1927247/rebooting-a-retro-pdp-11-workstation---and-its-classic-venix-unix?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742672040,"author":"EditorDavid","guid":220,"unread":true,"content":"This week the \"Old Vintage Computing Research\" blog published a 21,000-word exploration of the DEC PDP-11, the 16-bit minicomputer sold by Digital Equipment Corporation. Slashdot reader AndrewZX calls the blog post \"an excellent deep dive\" into the machine's history and capabilities \"and the classic Venix UNIX that it ran.\" The blogger still owns a working 1984 DEC Professional 380, \"a tank of a machine, a reasonably powerful workstation, and the most practical PDP-adjacent thing you can actually slap on a (large) desk.\" \n\nBut more importantly, \"It runs PRO/VENIX, the only official DEC Unix option for the Pros.\"\n In that specific market it was almost certainly the earliest such licensed Unix (in 1983) and primarily competed against XENIX, Microsoft's dominant \"small Unix,\" which first emerged for XT-class systems as SCO XENIX in 1984. You'd wonder how rogue processes could be prevented from stomping on each other in such systems when neither the Intel 8086/8088 nor the IBM PC nor the PC/XT had a memory management unit, and the answer was not to try and just hope for the best. It was for this reason that IBM's own Unix variant PC/IX, developed by Interactive Systems Corporation under contract as their intended AT&amp;T killer, was multitasking but single-user since in such an architecture there could be no meaningful security guarantees... \nOne of Venix's interesting little idiosyncrasies, seen in all three Pro versions, was the SUPER&gt; prompt when you've logged on as root (there is also a MAINT&gt; prompt when you're single-user... \n\nAlthough Bill Gates had been their biggest nemesis early on, most of the little Unices that flourished in the 1980s and early 90s met their collective demise at the hands of another man: Linus Torvalds. The proliferation of free Unix alternatives like Linux on commodity PC hardware caused the bottom to fall out of the commercial Unix market. \n\nThe blogger even found a 1989 log for the computer's one and only guest login session — which seems to consist entirely of someone named tom trying to exit vi. \n\n\nBut the most touching part of the article comes when the author discovers a file named /thankyou that they're certain didn't come with the original Venix. It's an ASCII drawing of a smiling face, under the words \"THANK YOU FOR RESCUING ME\". \n\n\"It's among the last files created on the system before it came into my possession...\" \n\nIt's all a fun look back to a time when advances in semiconductor density meant microcomputers could do nearly as much as the more expensive minicomputers (while taking up less space) — leaving corporations pondering the new world that was coming:\nAs far back as 1974, an internal skunkworks unit had presented management with two small systems prototypes described as a PDP-8 in a VT50 terminal and a portable PDP-11 chassis. \nEngineers were intrigued but sales staff felt these smaller versions would cut into their traditional product lines, and [DEC president Ken] Olsen duly cancelled the project, famously observing no one would want a computer in their home.\n","contentLength":3063,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Was Undersea Cable Sabotage Part of a Larger Pattern?","url":"https://yro.slashdot.org/story/25/03/22/1821200/was-undersea-cable-sabotage-part-of-a-larger-pattern?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742668440,"author":"EditorDavid","guid":219,"unread":true,"content":"Was the cutting of undersea cables part of a larger pattern? Russia and its proxies are accused by western officials of \"staging dozens of attacks and other incidents across Europe since the invasion of Ukraine three years ago,\" reports the Associated Press. \n\nThat includes cyberattacks and committing acts of sabotage/vandalism/arson, as well as spreading propaganda and even plotting killings, according to the article. (\"Western intelligence agencies uncovered what they said was a Russian plot to kill the head of a major German arms manufacturer that is a supplier of weapons to Ukraine...\") The news agency documented 59 incidents \"in which European governments, prosecutors, intelligence services or other Western officials blamed Russia, groups linked to Russia or its ally Belarus.\"\n\n[Western officials] allege the disruption campaign is an extension of Russian President Vladimir Putin's war, intended to sow division in European societies and undermine support for Ukraine... The incidents range from stuffing car tailpipes with expanding foam in Germany to a plot to plant explosives on cargo planes. They include setting fire to stores and a museum, hacking that targeted politicians and critical infrastructure, and spying by a ring convicted in the U.K. Richard Moore, the head of Britain's foreign intelligence service, called it a \"staggeringly reckless campaign\" in November... \n\nThe cases are varied, and the largest concentrations are in countries that are major supporters of Ukraine... In about a quarter of the cases, prosecutors have brought charges or courts have convicted people of carrying out the sabotage. But in many more, no specific culprit has been publicly identified or brought to justice. \nDespite that, \"more and more governments are publicly attributing attacks to Russia,\" the article points out. \nThis week a nonprofit, bipartisan think tank on global policy released a report which \"found that Russian attacks in Europe quadrupled from 2022 to 2023 and then tripled again from 2023 to 2024,\" reports the New York Times.\nPrime Minister Donald Tusk of Poland noted in a social media post on Monday that Lithuanian officials had confirmed his assessment that Russia was responsible for a series of fires in shopping centers in Warsaw and Vilnius, the Lithuanian capital...\n","contentLength":2313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Surprisingly, Some Dyson Spheres and Ringworlds Can Be Stable","url":"https://science.slashdot.org/story/25/03/22/0414254/surprisingly-some-dyson-spheres-and-ringworlds-can-be-stable?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742664840,"author":"EditorDavid","guid":218,"unread":true,"content":"Slashdot reader Required Snark shared this article from Phys.org:\n\n\nIn the realm of science fiction, [sun-energy capturing] Dyson spheres and ringworlds have been staples for decades. But it is well known that the simplest designs are unstable against gravitational forces and would thus be torn apart. Now a scientist from Scotland, UK has shown that certain configurations of these objects near a two-mass system can be stable against such fractures... \n\n\n[A] rigid ring around a star or planet, as in Larry Niven's \"Ringworld\" series of novels, is also unstable, as it would drift under any slight gravitational differences and collide with the star. So [engineering science professor Colin] McInnes considered a restricted three-body problem where two equal masses orbit each other circularly with a uniform ring of infinitesimal mass rotating in their orbital plane. The ring could enclose both masses, just one or none... McInnes also investigated a shell-restricted three-body problem with the shell also of infinitesimal mass, again with the shell enclosing two masses, one or none. \n\nFor the restricted ring, McInnes found that there are seven equilibrium points in the orbital plane of the dual masses, on which, if the ring's center were placed, it would stay and not experience stresses, akin to the three stable Lagrange points where a small mass can reside permanently for the two-body problem... McInnes restricted this research to a planar ring (in the plane of the circularly orbiting masses) but says it can be shown that a vertical ring, normal to the plane, can also generate equilibria... \n\nThese results can aid the search for extraterrestrial intelligence, McInnes said, \"If we can understand when such structures can be stable, then this could potentially help direct future SETI surveys.\" An important technosignature would be one bright star orbiting in tandem with an object showing a strong infrared excess. Shells around a sun-exoplanet pair or an exoplanet-exoplanet pair could also be possible. A nested set of Dyson spheres is also a feasible geometry.\n \n\nIn 2003 Ringworld author Larry Niven answered questions from Slashdot readers...","contentLength":2168,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Week in Review: Google buys Wiz","url":"https://techcrunch.com/2025/03/22/week-in-review-google-buys-wiz/","date":1742663100,"author":"Karyne Levy","guid":285,"unread":true,"content":"<article>Welcome back to Week in Review! We’ve got tons of stories to share from this week, like the greatest hits from Nvidia GTC; the NASA astronauts finally came home; Rippling’s lawsuit; and Google bought Wiz. Let’s get to it! Google finally does it: Google made its biggest acquisition in its history this week when it […]</article>","contentLength":326,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"US Release of Unredacted JFK Files 'Doxxed' Officials, Including Social Security Numbers","url":"https://news.slashdot.org/story/25/03/22/0237216/us-release-of-unredacted-jfk-files-doxxed-officials-including-social-security-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742661240,"author":"EditorDavid","guid":217,"unread":true,"content":"\"I intend to sue the National Archives,\" said Joseph diGenova, an 80-year-old former Trump campaign lawyer (and a U.S. Attorney from 1983 to 1988). While releasing 63,000 unredacted pages about the 1963 assassination of President Kennedy, the U.S. government erroneously \"made public the Social Security numbers and other sensitive personal information of potentially hundreds of former congressional staffers and other people,\" reports USA Today. (\"It is virtually impossible to tell the scope of the breach because the National Archives put them online without a way to search them by keyword, some JFK files experts and victims of the information release told USA TODAY...\") \n\nMark Zaid, a national security lawyer who represented current and former spies and other officials in cases against the government, told USA Today that he \"saw a few names I know and I informed them of the breach... Hundreds were doxxed but of that number I don't know how many are still living.\"\n\nZaid, who has fought for decades for the JFK records to be made public, said many of the thousands of investigative documents had been made public long ago with everything declassified and unredacted except for the personal information. Releasing that information now, he told USA TODAY, poses significant threats to those whose information is now public, including dates and places of birth, but especially their Social Security numbers. \"The purpose of the release was to inform the public about the JFK assassination, not to help permit identity theft of those who actually investigated the events of that day,\" Zaid said.\n\nThe Associated Press reported Thursday afternoon that government officials \"said they are still screening the records to identify all the Social Security numbers that were released.\"\nOne of the newly unredacted documents... discloses the Social Security numbers of more than two dozen people seeking security clearances in the 1990s to review JFK-related documents for the Assassination Records Review Board.\n","contentLength":2014,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Majority of AI Researchers Say Tech Industry Is Pouring Billions Into a Dead End","url":"https://slashdot.org/story/25/03/22/0341222/majority-of-ai-researchers-say-tech-industry-is-pouring-billions-into-a-dead-end?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742657640,"author":"EditorDavid","guid":216,"unread":true,"content":"Founded in 1979, the Association for the Advancement of AI is an international scientific society. Recently 25 of its AI researchers surveyed 475 respondents in the AAAI community about \"the trajectory of AI research\" — and their results were surprising. \n\n Futurism calls the results \"a resounding rebuff to the tech industry's long-preferred method of achieving AI gains\" — namely, adding more hardware:\n\n\nYou can only throw so much money at a problem. This, more or less, is the line being taken by AI researchers in a recent survey. Asked whether \"scaling up\" current AI approaches could lead to achieving artificial general intelligence (AGI), or a general purpose AI that matches or surpasses human cognition, an overwhelming 76 percent of respondents said it was \"unlikely\" or \"very unlikely\" to succeed... \n\n\"The vast investments in scaling, unaccompanied by any comparable efforts to understand what was going on, always seemed to me to be misplaced,\" Stuart Russel, a computer scientist at UC Berkeley who helped organize the report, told New Scientist. \"I think that, about a year ago, it started to become obvious to everyone that the benefits of scaling in the conventional sense had plateaued....\" In November last year, reports indicated that OpenAI researchers discovered that the upcoming version of its GPT large language model displayed significantly less improvement, and in some cases, no improvements at all than previous versions did over their predecessors. In December, Google CEO Sundar Pichai went on the record as saying that easy AI gains were \"over\" — but confidently asserted that there was no reason the industry couldn't \"just keep scaling up.\"\n\n Cheaper, more efficient approaches are being explored. OpenAI has used a method known as test-time compute with its latest models, in which the AI spends more time to \"think\" before selecting the most promising solution. That achieved a performance boost that would've otherwise taken mountains of scaling to replicate, researchers claimed. But this approach is \"unlikely to be a silver bullet,\" Arvind Narayanan, a computer scientist at Princeton University, told New Scientist.","contentLength":2165,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.15 Plans To Drop Support For A Useless CRC-32 Checksum In The Kernel Image","url":"https://www.phoronix.com/news/Linux-6.15-Drop-Useless-CRC-32","date":1742656626,"author":"Michael Larabel","guid":686,"unread":true,"content":"<article>Ingo Molnar began sending out the pull requests today for the upcoming Linux 6.15 merge window of code areas he oversees for the Linux kernel. Among those early pulls are of the x86/build updates, which includes removing some seemingly useless CRC-32 checksum code from the kernel...</article>","contentLength":283,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"'Unaware and Uncertain': Report Finds Widespread Unfamiliarity With 2027's EU Cyber Resilience Requirements","url":"https://news.slashdot.org/story/25/03/21/0212206/unaware-and-uncertain-report-finds-widespread-unfamiliarity-with-2027s-eu-cyber-resilience-requirements?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742654040,"author":"EditorDavid","guid":215,"unread":true,"content":"Two \"groundbreaking research reports\" on open source security were announced this week by the Linux Foundation in partnership with the Open Source Security Foundation (OpenSSF) and Linux Foundation Europe. The reports specifically address the EU's Cyber Resilience Act (or CRA) and \"highlight knowledge gaps and best practices for CRA compliance.\" \n\n\"Unaware and Uncertain: The Stark Realities of CRA-Readiness in Open Source\" includes a survey which found that when it comes to CRA requirements, 62% of respondents were either \"not familiar at all\" (36%) or \"slightly familiar\" (26%) — while 51% weren't sure about its deadlines. (\"Only 28% correctly identified 2027 as the target year for full compliance,\" according to one infographic, which adds that CRA \"is expected to drive a 6% average price increase, though 53% of manufacturers are still assessing pricing impacts.\")\n\nManufacturers, who bear primary responsibility, lack readiness — many [46%] passively rely on upstream security fixes, and only a small portion produce Software Bills of Materials (SBOMs). The report recommends that manufacturers take a more active role in open source security, that more funding and legal support is needed to support security practices, and that clear regulatory guidance is essential to prevent unintended negative impacts on open source development.\n \n\nThe research also provides \"an in-depth analysis of how open collaboration can strengthen software security and innovation across global markets,\" with another report that \"examines how three Linux Foundation projects are meeting the CRA's minimum compliance requirements\" and \"provides insight on the elements needed to ensure leadership in cybersecurity best practices.\" (It also includes CRA-related resources.) \n\n\"These two reports offer actionable conclusions for open source stakeholders to ready themselves for 2027, when the CRA comes into force,\" according to a Linux Foundation reserach executive cited in the announcement. \"We hope that these reports catalyze higher levels of collaboration across the open source community.\"","contentLength":2092,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Quick Recap of AI Systems","url":"https://hackernoon.com/a-quick-recap-of-ai-systems?source=rss","date":1742653802,"author":"Huseyn Gorbani","guid":334,"unread":true,"content":"<h2><strong>The Big Picture: Shift to Action-Based AI</strong></h2><p>\\\nAI systems do not just chat anymore; they act. Instead of merely suggesting an action, an advanced AI system can execute the action itself. ChatGPT’s latest features exemplify this shift: it&nbsp;&nbsp;using tools like web browsers and databases. In other words, an AI agent can carry out multi-step jobs end-to-end. These agents are now seen as an&nbsp;&nbsp;augmenting human teams. A support bot might not only draft a reply but also send it and update records on its own, and not just through API but through a web interface. 🫣</p><h2><strong>CUA and OpenAI’s Responses API: Building Agentic AI</strong></h2><p>To develop action-oriented AI systems, many organizations are rolling out new frameworks. OpenAI, for instance, just introduced tools for&nbsp;&nbsp;applications, including a Responses API that pairs GPT-style language skills with built-in web search, file handling, and a&nbsp;&nbsp;(CUA) to operate the software. In practice, an AI using these tools could fill out forms or update databases by itself. OpenAI also released an <a href=\"https://github.com/openai/openai-agents-python\">Agents SDK</a> to orchestrate such workflows and made it open-source. Similarly, open-source projects like&nbsp;<a href=\"https://github.com/Aident-AI/open-cuak\">open-cuak</a> and <a href=\"https://github.com/browser-use/browser-use\">browser-use</a>&nbsp;provide -style automation without proprietary fees. These efforts lower the barrier to creating AI agents that can not only think but also act on a user’s behalf.</p><h2><strong>Large Action Models (LAMs): Beyond Language to Execution</strong></h2><p>An LAM is essentially a large AI model (basically a fined-tuned multi-modal LLM) that doesn’t just understand language – it can&nbsp;&nbsp;things in response. Think of it as the&nbsp;&nbsp;of a large language model. Where a traditional assistant might tell you how to solve a problem, a LAM-powered system could actually carry out the solution for you. This represents a major shift, potentially allowing AI to automate entire processes rather than just generate content. LAMs do this by combining language understanding with decision-making and tool use. </p><p>\\\nBy turning AI from a passive responder into an active problem-solver, they unlock new possibilities – but also demand greater reliability, since mistakes by an agent that acts can have real consequences.</p><h2><strong>The Dead Internet Theory and AI Saturation</strong></h2><p>One side effect of these agentic advances is a flood of AI-generated content online. This has revived the&nbsp;<a href=\"https://www.forbes.com/sites/danidiplacido/2024/01/16/the-dead-internet-theory-explained/\">Dead Internet Theory</a>, which claims much of today’s online content is produced by bots rather than people. In 2025, that idea feels eerily plausible. A significant portion of tweets, posts, and even news articles are now machine-generated, blurring the line between genuine human voices and automated output. </p><h2><strong>Conclusion: Balancing Potential With Oversight</strong></h2><p>The evolution of AI into autonomous agents brings great promise – and calls for prudence. On one hand, these agents can handle drudge work and complex tasks at lightning speed, freeing people to focus on creativity and strategy. On the other hand, giving AI the freedom to act means setting clear&nbsp;. </p><p>\\\nAs some experts warn, AI’s impact could&nbsp;&nbsp;depending on how responsibly we guide it. That may sound extreme, but it underscores the importance of oversight. Accordingly, developers and policymakers are crafting safety guidelines to keep agentic AI aligned with human values.</p><p>\\\nKeeping a&nbsp;&nbsp;for critical decisions remains vital. Ultimately, it’s about balance: harnessing AI’s potential to act on our behalf, while ensuring humans retain final control. If we get it right, autonomous agents could become invaluable partners – powerful, yet&nbsp;.</p><p><em>Feature Image is generated with Google's ImageFX</em></p>","contentLength":3534,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Art of 'No': Navigating Stakeholder Expectations in Agile Teams","url":"https://hackernoon.com/the-art-of-no-navigating-stakeholder-expectations-in-agile-teams?source=rss","date":1742652007,"author":"Sanjay Mood","guid":333,"unread":true,"content":"<h2><strong>Agile is a Balancing Act. Stakeholders Want Everything. Your Team Can’t Do It All.</strong></h2><p>Agile is a tightrope walk. One moment, you’re helping the team hit their sprint goal. The next, a stakeholder drops in with a  that could throw everything off balance.</p><p>If you push back, you risk frustrating them. If you say yes, you overload the team and compromise quality.</p><p>If you work in an agile environment—especially as a BA, PM, or Scrum Master—you know the drill. You’re constantly managing expectations, juggling priorities, and, let’s be honest, playing  against scope creep. If you don’t learn to , you’ll either:</p><p>✅ End up in , where every new request delays progress.</p><p>❌ Be labeled as , even though you’re just keeping things under control.</p><p>Neither is great. But here’s the good news: <strong>you can say no—without making enemies or derailing projects.</strong></p><h2><strong>Saying No is Hard, But Saying Yes to Everything is Worse</strong></h2><p>Let’s face it: <strong>no one enjoys being told “no.”</strong> Especially stakeholders who:</p><ul><li>Think everything is .</li><li>Believe adding “just one more thing” is simple (spoiler: it’s usually not).</li><li>Have leadership breathing down their necks for faster delivery.</li></ul><ul><li>Saying  means <strong>missed deadlines, exhausted teams, and a bloated product roadmap.</strong></li><li>Saying  makes people feel ignored—or worse, they escalate their request to leadership.</li></ul><p>Your job isn’t to —it’s to <strong>manage them strategically</strong> so the team stays focused on what truly matters.</p><h2><strong>The Right Way to Push Back (Without Sounding Like a Roadblock)</strong></h2><p>🔥 <strong>Tactical Framework: The “A.R.O” Method</strong> (Align, Redirect, Offer) 🔥</p><p>Instead of just , use this  to keep things positive and solution-focused:</p><h3><strong>1️⃣ Align → Show You Understand Their Request</strong></h3><p>Before you push back, acknowledge the request. Make the stakeholders feel heard.</p><p>✅ <em>“That’s a great idea—I see how that could help [business goal].”</em></p><p>✅“I get why this is important, and I know it would improve [specific use case].”</p><p>🎯  Because people hate being dismissed. A little validation  in keeping the conversation productive.</p><p>A stakeholder once requested <strong>a custom email template/update to an existing template</strong>&nbsp;in the middle of a sprint. Instead of shutting it down, I responded:</p><p>✔“Customizing text makes the template more relevant and effective—I see why this matters. (ALIGN).\"</p><p>✔“Right now, we’re focused on completing the current tasks in the sprint, and adding this would delay that release. (REDIRECT).\"</p><p>✔“But we can review this in backlog refinement and see where it fits best. (OFFER).”</p><p>They didn’t love the answer—but they understood the trade-off, and that’s what mattered.</p><h3><strong>2️⃣ Redirect → Shift Focus to Priorities &amp; Constraints</strong></h3><p>Once they feel heard, <strong>gently guide the conversation back to the team’s existing commitments.</strong></p><p>❌ Instead of: <em>“We don’t have time for this.”</em></p><p>✅ Say: <em>“Right now, we’re committed to [priority feature], and adding this would push back that timeline.”</em></p><p>OR, if leadership is involved:</p><p>✅“I’d love to explore this! But based on our roadmap, it would require shifting priorities. Would you like to discuss what we can trade-off?”</p><p>🎯  Because <strong>this turns the conversation into a prioritization discussion</strong> instead of a hard rejection.</p><h3><strong>3️⃣ Offer → Find a Path Forward (That Doesn’t Derail Everything)</strong></h3><p>Stakeholders don’t just want an answer—they want . Even if you can’t say yes, offer .</p><p>✔ <em>“We can look at this for the next sprint.”</em></p><p>✔“If we deprioritize [X], we might be able to fit this in. Is that an option?”</p><p>✔“We can do a lightweight version now and expand on it later. Would that work?”</p><p>🎯  Because this keeps the conversation  rather than combative.</p><h3><strong>Handling Difficult Stakeholders (Because Some Won’t Take No for an Answer)</strong></h3><p>Even if you use this approach, some stakeholders  Here’s how to handle the most common scenarios:</p><h3><strong>📌 Scenario 1: “I need this ASAP.”</strong></h3><p>🚀 <em>“I hear you. Let’s look at trade-offs—what are you okay with delaying so we can fit this in?”</em></p><p>👉Forces them to recognize the impact of their request instead of assuming it can just be added in.</p><p>I once had a feature request to add/copy over an existing feature for a different set of users right before the launch of the application. Instead of rejecting it, I asked:</p><p>✔“If we prioritize this, it means delaying the feature your team requested in the last sprint. Do you want to make that trade?”</p><p>Once they realized the impact, </p><h3><strong>📌 Scenario 2: They Go Around You to Leadership.</strong></h3><p>💡 <em>“I understand why this is important. Let’s get leadership involved so we can collectively decide how to prioritize it.”</em></p><p>👉This keeps the conversation structured instead of turning it into a conflict.</p><h3><strong>📌 Scenario 3: They Keep Changing Requirements Mid-Sprint.</strong></h3><p>⏳ <em>“I get that priorities shift, but once a sprint starts, any changes need to be considered for the next sprint so we don’t disrupt progress. Let’s queue this up for the backlog.”</em></p><p>👉This reinforces that agile is structured, not an on-the-fly request system.</p><h2><strong>Your Playbook for Handling Stakeholders Like a Pro</strong></h2><p>Want to make these conversations easier? <strong>Set expectations before they become a problem.</strong></p><p>✅ <strong>Create a Transparent Roadmap</strong>→ If stakeholders know what’s planned, they’re less likely to demand last-minute changes.</p><p>✅ → Instead of  say <em>“This request would take ~4 weeks, which would push back [X].”</em></p><p>✅<strong>Make Prioritization a Shared Responsibility</strong> → If they want to add something, they should help decide what gets cut.</p><h2><strong>Final Thoughts: Saying No is About Protecting Value, Not Rejecting Ideas</strong></h2><p>Agile BAs <strong>aren’t note-takers—they’re decision facilitators</strong>.</p><p>✅ Your job isn’t to say no—it’s to make sure the right things get built at the right time.</p><p>✅ The more strategic you are in these conversations, the more respect you earn from both stakeholders and your team.</p><p>✅ <strong>Saying no isn’t rejection—it’s guiding stakeholders toward better decisions.</strong></p><p>I know every BA has a war story about pushing back on a wild stakeholder request. What’s yours? What’s the toughest ‘no’ you’ve ever had to deliver? Let’s hear it in the comments!</p>","contentLength":6116,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The 20 hottest open source startups of 2024","url":"https://techcrunch.com/2025/03/22/the-20-hottest-open-source-startups-of-2024/","date":1742652000,"author":"Paul Sawers","guid":284,"unread":true,"content":"<article>A new report showcases the 20 top-trending open source startups around the world, more than half of which are closely aligned with AI. The report is the handiwork of European venture capital firm Runa Capital, which has operated the Runa Open Source Startup (ROSS) Index since 2020. The Index serves quarterly updates on the fastest-growing […]</article>","contentLength":346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Most Disappointing Movie Sequels Of All Time","url":"https://hackernoon.com/the-most-disappointing-movie-sequels-of-all-time?source=rss","date":1742651103,"author":"Fayam Ayekame","guid":332,"unread":true,"content":"<p>Sequels offer fans a chance to return to their favorite movies, even allowing writers to expand their universes. While they are typically a great idea, sometimes things don’t work out the way anyone expects. Some sequels are a letdown, with some even ruining the franchise. Here are some movie sequels that were a letdown:</p><h2>Ghost Rider: Spirit Of Vengeance</h2><p>Nicholas Cage was one of the biggest stars of the 2000s, with Ghost Rider being one of his most popular works. Ghost Rider may not be a part of the MCU, but it certainly paved the way for some of the later successes. Ghost Rider seemingly ends perfectly with the defeat of Blackheart and the defiance of the Devil.</p><p>\\\nGhost Rider: Spirit Of Vengeance was an unnecessary sequel, and it failed the original movie in more ways than one. From the poor CGI to plot holes, there was little to desire about the sequel. The sequel was so bad that many fans didn’t even realize one was made, further making the case that it should never have happened.</p><h2>The Scorpion King (Multiple Sequels)</h2><p>The Scorpion King was a huge success, thanks in no small part to Dwayne Johnson’s presence. Any sequels without the main attraction were always going to come short, and that’s exactly what happened. With four sequels to follow the original, almost every possible plotline has been explored, to no avail.</p><p>\\\nEvery new entry into the franchise seems to hit new lows, with people less interested in Mathayus’s story. The producers should have just stopped at the first movie and left the fans to their imaginations.</p><p>Mean Girls is one of the most iconic movies of the 2000s, with a star-studded cast featuring Lindsay Lohan and Rachel McAdams. With a seemingly perfect ending where lessons are learned and all seems right with the world, there was no real need for a sequel. This fact is reflected in the low ratings and viewership of the sequel, with most people seeing it as more of the same.</p><p>\\\nThere has even been a remake of the original meeting a similar fate as the sequel. The original Movie remains an all-time classic and should remain unblemished by any sequels.</p><h2>R.I.P.D 2: Rise of the Damned</h2><p>R.I.P.D 2: Rise of the Damned was damned from the get-go, with the absence of both leads from the original movie. To be fair, it is a passable stand-alone movie, but it pales in comparison to its predecessor. I doubt any movie could survive losing both Jeff Bridges and Ryan Reynolds.</p><p>With the comedic interaction of the dynamic duo missing, most viewers weren’t even aware there was a sequel. The comedy seemed forced, and despite a passable plot, the movie just seemed off and a poor imitation of the first.</p><h2>The Mummy: Tomb Of The Dragon Emperor</h2><p>The Mummy was always going to have sequels, and sure enough, there have been two to follow the original. While the second movie managed to be impressive and retain some of the magic of the first movie, the third left a lot to be desired.</p><p>\\\nDespite boasting a star-studded cast including Jet Li and Michelle Yeoh, The Mummy Tomb of the Dragon Emperor was a letdown. Everything just seemed off from the start, and the film never got better as viewers went along. It’s one of those sequels we wish never happened, and we were left with the first two movies in the franchise.</p><h2>Van Wilder: The Rise of Taj</h2><p>Van Wilder was the ultimate college movie of the 2000s, featuring the titular character as an enigmatic party boy. Creating a sequel around a minor character may have seemed like a good idea, but this concept proved to be wrong.</p><p>\\\nThe Rise of Taj focused on Van’s assistant as he attempted to establish himself at his new school with lessons he learned from his mentor. Not only did this sequel fail to capture the magic of the first movie, but it was worse than the next entry to the franchise.</p><h2>Megamind Vs. The Doom Syndicate</h2><p>The idea of creating a sequel for the incredibly handsome criminal mastermind and master of all villainy was lovely. There were always going to be consequences for Megamind turning good and abandoning his evil ways, which we get to see in this sequel. His former villain team poses a problem to the now reformed Megamind in his new role as protector of Metro City.</p><p>\\\nUnfortunately, this sequel failed to live up to the standards established by the first movie. With almost an entirely new cast, it is not difficult to see why viewers don’t appreciate the sequel as much as the original. It presents more as a kids’ story as opposed to one the entire family can enjoy and have a good laugh.</p>","contentLength":4498,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AMD RDNA 3.5 Cleaner Shader Support Prepped For Linux 6.15","url":"https://www.phoronix.com/news/AMD-RDNA3.5-Cleaner-Shader","date":1742648973,"author":"Michael Larabel","guid":685,"unread":true,"content":"<article>Ahead of the imminent Linux 6.15 merge window expected to begin next week, a batch of AMDGPU/AMDKFD Radeon kernel driver updates were sent out on Friday for this next kernel cycle. It's mostly about bug fixes but does contain cleaner shader support for AMD RDNA 3.5 graphics...</article>","contentLength":277,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE KWin Lands FIFO v1 Wayland Support, GNOME 48 Squeezed In XDG Toplevel Drag v1","url":"https://www.phoronix.com/news/KDE-KWin-Does-FIFO-v1","date":1742647435,"author":"Michael Larabel","guid":684,"unread":true,"content":"<article>There is some new Wayland protocol support activity this week worth mentioning for both the KDE Plasma and GNOME desktops...</article>","contentLength":124,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Want to Buy Ed-Tech That Isn't Evil? Here's How","url":"https://hackernoon.com/want-to-buy-ed-tech-that-isnt-evil-heres-how?source=rss","date":1742644834,"author":"The Markup","guid":331,"unread":true,"content":"<p>The edtech industry’s pandemic-era boom has meant K-12 schools and universities are receiving sales pitches for an abundance of new products—from generative AI <a href=\"https://www.grammarly.com/edu\">writing tools</a> and <a href=\"https://www.khanacademy.org/khan-labs\">math tutors</a> to <a href=\"https://www.santafenewmexican.com/news/education/santa-fe-rolls-out-robot-to-help-keep-schools-safe/article_6001e2f6-f977-11ed-8c74-4b7957a79afa.html\">robot security guards</a> and <a href=\"https://www.lightboard.info/\">lightboards</a>. But with those choices, and billions of dollars being spent annually on ed tech, educators and school administrators say they also have a problem: There is no mandatory licensing process that certifies that ed tech products work as advertised or that they can be trusted with sensitive student information.</p><p>\\\nExperts have called for countries to <a href=\"https://www.lse.ac.uk/social-policy/Assets/Documents/PDF/working-paper-series/02-22-Hillman.pdf\">establish licensing bodies</a> for educational technology, but for the time being, ed tech companies have largely been left to regulate themselves through voluntary, industry-funded certification programs.</p><p>\\\nThe result is that schools are using many products that may harm children. This week, the United Nations Educational, Scientific and Cultural Organization (UNESCO) released a <a href=\"https://unesdoc.unesco.org/ark:/48223/pf0000385723\">report</a> on global use of educational technology that warned, “Children’s privacy, safety and well-being are at risk due to lack of oversight of the education technology industry.” And last year a Human Rights Watch <a href=\"https://www.hrw.org/report/2022/05/25/how-dare-they-peep-my-private-life/childrens-rights-violations-governments\">investigation</a> found that many ed tech products endorsed by government agencies were potentially snooping on kids.</p><p>\\\nFor example, Edmodo, one of the companies identified in the report, once had 10,000,000 estimated users. It went out of business last year and has since been fined by the Department of Justice and Federal Trade Commission for illegally collecting and storing data about users under the age of 13. (Somewhat confusingly, UNESCO at one point <a href=\"https://www.globenewswire.com/news-release/2020/03/19/2003088/0/en/Edmodo-Subsidiary-of-NetDragon-Recommended-by-UNESCO-for-Distance-Learning.html\">recommended</a> Edmodo for distance learning.)</p><p>\\\n“We put more thought as institutions into buying tea bags than we do technology,” said Anne-Marie Scott, an open education advocate who previously led ed tech purchasing for universities in the U.K. and Canada. “We buy fair trade tea bags … and we buy utterly garbage proctoring systems.”</p><p>\\\nWhile we can’t recommend what products are right for an individual school, we spoke to educators, procurement officers, and parents to gather their best advice and recommendations for evaluating the myriad products on offer. Here are the four critical questions they said students, parents, and educators should be asking.</p><h2>1. Will This Technology&nbsp;Help?</h2><p>Experts, practitioners, and parents we spoke to agreed that a school’s first step in buying new technology should be to pause and ask whether the tech is needed. Is the newest software or hardware the most effective solution for the school? Sometimes—perhaps because a new tool is suggested directly by an educator or salesperson—this step gets skipped.</p><p>\\\nHolly Doe, director of technology for Maine’s Regional School Unit 40, said that she’s been shocked to learn how many different ed tech tools teachers in her small district started using during the pandemic. And the sales pitches haven’t stopped. “We get a lot of emails from vendors,” she said. “I’m flooded, flooded every day.”</p><p>\\\nShe and Sarah Radcliffe, director of future-ready learning for the School District of Altoona, in Wisconsin, said that keeping detailed inventories of what products teachers use, how they use them, how often they use them, and when the contracts expire has helped the district assess what its schools actually need. Teachers could do this through a survey, or, unsurprisingly, schools can buy ed tech systems to help them evaluate how much they use other ed tech.</p><p>\\\nBoth administrators also recommended that schools regularly survey their educators to ask how they’re using the products they have and what products they envision needing in the future.</p><h2>2. Can I Get a&nbsp;Demonstration?</h2><p>Scott, the former university technology officer, recommended that before a school begins a formal purchasing or request for proposal (RFP) process, it should examine the open source options available and then invite relevant vendors to demonstrate their tools for a group of educators, students, and IT staff. The demonstrations allow procurement officers to take note of what different products on the market can do and how they fit the specific use cases of the school’s community. With that information, the school can craft a more informed RFP and not wind up in a long-term contract for a product that ticked the boxes on paper but doesn’t meet real-world needs.</p><p>\\\n“I like to have students in the procurement team,” Scott said. “There’s nothing like a student sitting in the room to change the way a supplier talks about their product. They can’t rely on lazy stereotypes of what students are.”</p><p>\\\nDoe, from RSU 40, said she always tries to get demo samples of hardware or software licenses so that her teachers can pilot products before the district makes a larger purchase.</p><p>\\\n“If you don’t actually experience it, I suppose you don’t really know,” she said.</p><p>\\\nOnce a school has conducted its research, it should share that information with parents so that they too can understand and trust the technologies their children are using, said Cassie Creswell, a Chicago parent and co-chair of the <a href=\"https://studentprivacymatters.org/about-us/\">Parent Coalition for Student Privacy</a>,</p><p>“[Schools] need to share basic information with parents,” she said. “If they don’t, you can’t really have any confidence that they’re doing that due diligence to pick the contractor in the first place.”</p><p>\\\nThe Parent Coalition for Student Privacy has <a href=\"https://studentprivacymatters.org/toolkit/\">created a toolkit</a> to help parents get informed and involved in their schools’ technology decisions.</p><h2>3. What Do the Reviews Say?</h2><p>Once a school has decided it needs a new technology, it has to decide which specific product to purchase, often choosing from dozens of similar options.</p><p>\\\nVelislava Hillman, a visiting fellow at the London School of Economics and Political Science who researches ed tech procurement, said the lack of national licensing programs for ed tech makes it difficult for schools to know which products are tested and proven and which are snake oil.</p><p>\\\nEducators and administrators rely on peer networks to fill that information gap. But Hillman said there are two affiliated databases that share rigorous evaluations, benchmarking, and peer reviews of ed tech products:</p><p>\\\n<a href=\"https://edtechimpact.com/\">EdTech Impact</a> This database is a partnership between industry, academics, and other experts that provides basic information about products (such as their compatible systems, pricing, and competitors) as well as standardized evaluations from school leaders on such questions as: Does the product improve educational attainment? Does it reduce teacher workload?</p><p>\\\n<a href=\"https://educationalliancefinland.com/certified-products\">Education Alliance Finland certifications</a> This Finnish organization uses teacher reviewers to evaluate ed tech products on pedagogical criteria such as: What learning goals is the product intended to meet? Does it help students meet those goals? Does the product engage students in passive or active learning?</p><p>It can be hard to get the largest ed tech vendors to adjust their standard contracts on important issues like data privacy. But educators say it’s worth trying.</p><p>\\\nDoe said ed tech vendors are often “telling me what I need” rather than the other way around. “It can be really tough to get those big vendors to sign those [data privacy] agreements,” she added.</p><p>\\\nThe answer, for RSU 40 and many other schools, has been to organize. In many regions, districts or universities have joined together to purchase ed tech products as a group, pooling their influence over potential vendors. RSU&nbsp;40 and many other K-12 districts have also joined the <a href=\"https://privacy.a4l.org/\">Student Data Privacy Consortium</a> and its associated state chapters.</p><p>\\\nThe consortium provides example data privacy agreements and hosts a database of vendors used by participating districts. Radcliffe,&nbsp; the future-ready learning director in Altoona, said some vendors will balk at signing a privacy agreement with a new district, so she uses the database to show them that they’ve already agreed to the same terms with other clients.</p><p>\\\nCreswell, the Chicago parent and advocate, said organized parents and students can also be effective when district officials aren’t.</p><p>\\\nShe and other Chicago parents helped lead a successful campaign in 2021 that persuaded the district to amend its contract with College Board and other companies so that the vendors could no longer prompt students to agree to data sharing agreements (by clicking “Accept” on a website, for example) beyond what was allowed in the vendors’ contracts with the district.</p><p>\\\n“You shouldn’t be forced to hand over sensitive data in order for your kid to get a free, compulsory education,” Creswell said. “In most cases, you’re not really given an option to decline.”</p><h2>The Growing Influence of Ed&nbsp;Tech</h2><p>The need to scrutinize ed tech has exploded in recent years. In the school year before COVID-19 drove students out of classrooms and onto their devices, U.S. schools spent as much as $41 billion on educational technology, according to <a href=\"https://edtechevidence.org/wp-content/uploads/2021/07/FINAL-K12-EdTech-Funding-Analysis_v.1.pdf\">conservative estimates.</a></p><p>\\\nDuring the years that followed, the federal government appropriated an unprecedented <a href=\"https://covid-relief-data.ed.gov/\">$263&nbsp;billion</a> in emergency-aid funding for schools, who used much of it to purchase the technology necessary for remote learning. In response to the demand, global venture capital <a href=\"https://www.holoniq.com/notes/2022-edtech-vc-funding-totals-10-6b-down-from-20-8b-in-2021\">investment in ed tech companies</a> tripled from $7&nbsp;billion in 2019 to $21&nbsp;billion in 2021 (before dropping to a more modest $11 billion last year).</p><p>\\\nEducators are clearly still cobbling together the resources they need to help ensure this is money well spent. They don’t have all the answers. But they at least have some good questions.</p><h3>Correction, July 28, 2023</h3><p>An earlier version of this story referred to the EdTech impact database as a partnership between industry and Norwegian academics. In fact, it is a partnership between industry, academics, and other experts.</p><h3>Clarification, July 28, 2023</h3><p>An earlier version of this story referred to two ed tech resources as organizations. It has been updated to refer to them as databases.</p>","contentLength":9987,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New iOS Update Re-Enables Apple Intelligence For Users Who Had Turned It Off","url":"https://slashdot.org/story/25/03/22/1125225/new-ios-update-re-enables-apple-intelligence-for-users-who-had-turned-it-off?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742643000,"author":"msmash","guid":213,"unread":true,"content":"Apple's latest iOS 18.3.2 update is automatically re-enabling its Apple Intelligence feature even for users who previously disabled it, adding to mounting concerns about the company's AI strategy. \n\nThe update presents a splash screen with no option except to tap \"Continue,\" which activates the feature. Users must then manually disable it through settings, with the AI consuming up to 7GB of storage space. This forced activation comes amid broader troubles with Apple's AI initiatives.","contentLength":488,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Code Submitted Ahead Of Linux 6.15 For Enabling Block Sizes Greater Than Page Size","url":"https://www.phoronix.com/news/Linux-6.15-BS-Greater-Than-PS","date":1742640729,"author":"Michael Larabel","guid":683,"unread":true,"content":"<article>Ahead of the Linux v6.14 kernel expected for release tomorrow and in turn the Linux 6.15 merge window, Linux engineer Christian Brauner at Microsoft began sending out his pull requests today of new code he's hoping to see merged for this next cycle. One of those interesting pulls is the work for block devices to allow for block sizes to be greater than the page size...</article>","contentLength":371,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA's Open-Source Kernel Driver Ported To Haiku OS, Mesa NVK Adapted To Run On Top","url":"https://www.phoronix.com/news/NVIDIA-Haiku-OS-NVRM","date":1742639778,"author":"Michael Larabel","guid":682,"unread":true,"content":"<article>Haiku OS developer X512 has managed a rather impressive feat: porting NVIDIA's open-source kernel modules to Haiku. Not only did he get NVIDIA's official Linux kernel modules running on Haiku but he also ported the Mesa NVK Vulkan driver to be able to run atop the NVIDIA kernel driver interface...</article>","contentLength":298,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE Continues Prepping More Features For Plasma 6.4","url":"https://www.phoronix.com/news/KDE-Plasma-6.4-KMenuEdit","date":1742638846,"author":"Michael Larabel","guid":681,"unread":true,"content":"<article>KDE developers continue pushing ahead with new feature development on the Plasma 6.4 desktop to further refine Plasma 6...</article>","contentLength":122,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Everyone’s ‘Ditching’ the Cloud—But Here’s Why That’s a Lie","url":"https://hackernoon.com/everyones-ditching-the-cloudbut-heres-why-thats-a-lie?source=rss","date":1742637605,"author":"Zen Chan","guid":330,"unread":true,"content":"<h2>Why the Market’s Still Soaring Despite the On-Prem Plot Twist (and Why You’re Still in&nbsp;Demand)</h2><p>:::info\n Sure, some companies are hauling workloads back to on-prem servers, but the cloud security market’s not sweating it — it’s set to hit $156.25 billion by 2032 (<a href=\"https://www.fortunebusinessinsights.com/cloud-security-market-102056\">Fortune Business Insights</a>). Hybrid and multi-cloud setups are the new norm, not a cloud exodus, and emerging threats like quantum computing keep the demand for pros like you sky-high. The future’s a wild mashup of cloud, on-prem, and quantum-ready defenses — so buckle up, you’re still golden.</p><p>\\\nYou’ve seen the headlines screaming: “Businesses are ditching the cloud faster than you can say ‘AWS outage’!” It’s the kind of news that could make a cloud security pro spill their coffee, mutter “Is my job toast?” and eye the server room exit — only to realize it’s still humming with cloud action.</p><p>\\\nBefore you trade your CNAPP expertise for a dusty on-prem manual, let’s cut through the noise. <strong>The cloud security market isn’t shrinking — it’s growing like your inbox after a week off, and the data backs it up.</strong> So, grab your caffeine fix, and let’s unpack this “cloud repatriation” drama — because spoiler alert: it’s not the endgame you think.</p><h2>Cloud Repatriation: Less Apocalypse, More&nbsp;Remix</h2><p>\\\nHold your horses. Most of these companies aren’t torching their cloud subscriptions and swearing off Azure like it’s a bad Tinder date. They’re juggling a  — <strong>part cloud, part on-prem — or hopping between providers in a multi-cloud acrobatics show</strong>. Think of it like pulling a few vinyls off Spotify to spin on your turntable. You’re not canceling streaming — you’re just vibing with both.</p><p>\\\nHere’s the kicker: <strong>hybrid setups still need cloud security for the bits that stay sky-high.</strong> More clouds mean more chaos, and that’s where you swoop in with your cape of expertise. The cloud’s not dead — it’s just getting a funky remix.</p><h3>Why Are They Repatriating? (Hint: It’s Not Always Your&nbsp;Fault)</h3><p>So, why are companies dragging workloads back on-prem? Let’s break it down — and no, it’s not all about security nightmares:</p><ul><li> Cloud bills can hit you like a ninja in the dark — data egress fees, scaling costs, and surprise charges add up. Sometimes on-prem feels like a budget-friendly hug.</li><li> Certain apps demand the spotlight of local servers to shine — think latency-sensitive workloads that scoff at cloud lag.</li><li> Regulated industries (hello, finance and healthcare) love on-site servers for that warm, fuzzy feeling of keeping data under their thumb.</li></ul><p>\\\n even when workloads come home, most companies keep one foot in the cloud. <strong>Hybrid means double doors to lock</strong>, and multi-cloud’s a whack-a-mole marathon across platforms. Bad news for lazy weekends, great news for your job security. You’re the ringmaster keeping this tech circus safe.</p><h2>Cloud Security Market: Growing Like a Bad Wi-Fi&nbsp;Signal</h2><p>If repatriation were the cloud security grim reaper, the market would be flatlining. Instead, it’s throwing a rager:</p><p>\\\nWhat’s fueling this? ’s insatiable appetite, hybrid sprawl, and multi-cloud madness are pumping demand for tools like <strong>CNAPP (Cloud-Native Application Protection Platforms)</strong> and <strong>ASPM (Application Security Posture Management)</strong>. These are your security Swiss Army knives — slashing vulnerabilities, nailing compliance, and keeping the chaos at bay. The market’s not shrinking — it’s flexing harder than a bodybuilder on TikTok.</p><h3>From CSPM to CNAPP: The Glow-Up You Didn’t Know You&nbsp;Needed</h3><p>Cloud security’s evolved faster than a Pokémon on a candy binge. Remember  (Cloud Security Posture Management)? It was the OG, sniffing out misconfigs and compliance hiccups — solid, but siloed.</p><p>\\\nThen came , the all-in-one superhero:</p><ul><li>Infrastructure lockdown and compliance checks.</li><li>Workload protection (CWPP vibes).</li><li>Identity and access management.</li><li>Container and Kubernetes kung-fu.</li><li>App security testing on steroids.</li></ul><p>\\\nCNAPP’s Secret Sauce: </p><p>Ever drowned in a sea of alerts? CNAPP’s got your back with AI and ML wizardry:</p><ul><li>Prioritizes threats by “is this actually bad?” impact.</li><li>Correlates signals for big-picture clarity.</li><li>Suggests fixes so you’re not playing guess-the-patch.</li><li>Cuts false positives like a ninja with a katana.</li></ul><p>\\\nThis isn’t just a tool — it’s your new best friend in the hybrid jungle. CSPM was the appetizer; CNAPP’s the full buffet.</p><h2>The Future: Hybrid Chaos, Quantum Twists, and&nbsp;You</h2><p>The IT future isn’t cloud-or-bust or on-prem-or-nothing — it’s a <strong>hybrid-multi-cloud mashup</strong>. Securing it? Think herding cats across AWS, Azure, and that dusty server rack in the basement. Each platform’s a diva with its own quirks, and you’re the maestro keeping the symphony tight.</p><p>\\\nYour toolkit’s leveling up: <strong>CNAPP guards cloud apps, ASPM watches app lifecycles, and DSPM</strong> (Data Security Posture Management) babysits sensitive data. Oh, and “Shift-Left”? Not a dance move — it’s catching bugs early in dev, saving you from late-night firefights.</p><p>Now, the wild card: <strong>Post-Quantum Cryptography.</strong> It’s a plot twist so trippy, Christopher Nolan’s scribbling notes in a quantum maze. Quantum computers could crack today’s encryption like a walnut, and bad guys are already hoarding data for the big reveal. <strong>NIST’s new standards (<a href=\"https://www.nist.gov/news-events/news/2024/08/nist-releases-first-3-finalized-post-quantum-encryption-standards\">NIST</a>)</strong> are your shield, but the clock’s ticking. No PhD needed — just a heads-up to quantum-proof your game.</p><p>\\\nThis future’s a cocktail of cloud sprawl, on-prem quirks, and quantum spice. <strong>AI’s your co-pilot, but you’re the captain</strong> — your human smarts keep it all from crashing. The cloud security gig? Still hotter than a server on overdrive.</p><h2>Key Takeaways: Your Survival Guide to Cloud Security&nbsp;Glory</h2><ul><li>Repatriation’s not kryptonite — it’s a hybrid remix, not a cloud killer.</li><li>Market’s flexing, hitting $156.25 billion by 2032 — plenty of room for you.</li><li>Hybrid and multi-cloud reign, fueling CNAPP, ASPM, and DSPM love.</li><li>It’s not just security — cost, performance, and compliance nudge the on-prem shift.</li><li>Quantum’s your next boss fight — grab your post-quantum decoder ring and prep.</li></ul><p>:::info\nWhy You’re Still the&nbsp;MVP</p><p>Cloud security’s not fading — it’s evolving like a boss. Hybrid chaos and multi-cloud sprawl keep the market buzzing, with projections soaring past $150 billion. Quantum threats add a futuristic edge, and your expertise — tech chops plus strategic brainpower — is the secret sauce. So, keep locking down those digital skies. Your career’s brighter than a rack of LEDs — and twice as essential.</p>","contentLength":6654,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"France Rejects Backdoor Mandate","url":"https://it.slashdot.org/story/25/03/22/0855215/france-rejects-backdoor-mandate?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742635800,"author":"msmash","guid":212,"unread":true,"content":"The French National Assembly has rejected a controversial provision that would have forced messaging platforms like Signal and WhatsApp to allow government access to encrypted private conversations, lawmakers voted Thursday night. The measure, embedded within anti-drug trafficking legislation, would have implemented a \"ghost participant model\" allowing law enforcement to silently join encrypted chats without users' knowledge.","contentLength":429,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How an Electrical Fire Shut Down Heathrow and Upended Global Air Travel","url":"https://tech.slashdot.org/story/25/03/22/010205/how-an-electrical-fire-shut-down-heathrow-and-upended-global-air-travel?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742626800,"author":"msmash","guid":211,"unread":true,"content":"London's Heathrow Airport resumed operations late Friday after an electrical fire at a nearby substation forced a full-day closure, causing global travel chaos with hundreds of canceled flights and thousands of stranded passengers. The explosion at a Hayes substation 1.5 miles from the airport knocked out power early Thursday, requiring 70 firefighters to battle a blaze in a transformer containing 25,000 liters of cooling oil. \n\nDespite backup generators, Europe's busiest airport couldn't maintain normal operations, forcing flights to divert to airports across Europe and as far as Bangor, Maine. \"Contingencies of certain sizes we cannot guard ourselves against 100%,\" Heathrow CEO Thomas Woldbye told the BBC. \"This is as big as it gets for our airport.\" British Airways, which planned to carry 100,000 passengers Friday, prioritized long-haul flights to Australia, Brazil and South Africa when operations resumed after 4 p.m.","contentLength":934,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: Can ChatGPT Predict the Future? (3/22/2025)","url":"https://hackernoon.com/3-22-2025-techbeat?source=rss","date":1742623857,"author":"Techbeat","guid":329,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 3 Min read ] \n Join the Web3 Development Writing Contest by GetBlock &amp; HackerNoon! Write about blockchain APIs, dApp development &amp; more for a chance to win from $5,000. <a href=\"https://hackernoon.com/win-your-share-of-$5000-in-the-web3-development-writing-contest-by-getblock-and-hackernoon\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/vitaliikuzmenko\">@vitaliikuzmenko</a> [ 3 Min read ] \n Meet Leadige LLC, Startups of the Year 2024 Nominee—Where Strategy, Creativity &amp; Data Drive Revenue. <a href=\"https://hackernoon.com/meet-leadige-llc-startups-of-the-year-2024-nomineewhere-strategy-creativity-and-data-drive-revenu\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/michealchukwube\">@michealchukwube</a> [ 6 Min read ] \n AIO is the strategic use of AI technologies to enhance search engine visibility and user engagement, complementing traditional SEO strategies. <a href=\"https://hackernoon.com/artificial-intelligence-optimization-aio-the-next-frontier-in-seo\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kristinazima\">@kristinazima</a> [ 8 Min read ] \n Lessons from a failed website builder startup fro UI/UX designers and developers <a href=\"https://hackernoon.com/lessons-ive-learned-as-a-uxui-designer-in-a-failed-startup\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kristinazima\">@kristinazima</a> [ 15 Min read ] \n Top UX manipulations (principles) to seduce your users. Easy steps to improve any interface. <a href=\"https://hackernoon.com/sneaky-ux-tricks-thatll-make-your-users-fall-in-love\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/InfiniteScroll\">@InfiniteScroll</a> [ 5 Min read ] \n AI won’t replace me yet. But it might prove I was never that original. A witty, unsettling look at formulaic writing in the age of large language models. <a href=\"https://hackernoon.com/ai-wont-replace-me-yet-but-it-might-prove-i-was-never-that-original\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ct2034\">@ct2034</a> [ 15 Min read ] \n A recent survey by the Linux Foundation found that organizations contribute 7.7B USD annually to open source projects. <a href=\"https://hackernoon.com/open-source-is-supposed-to-be-a-meritocracyso-why-are-companies-trying-to-buy-their-way-in\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ishanpandey\">@ishanpandey</a> [ 2 Min read ] \n Funtico and FunNFT launch Mystery Tournaments on March 14, 2025. The tournaments feature three games, offering a prize pool of 1,500 USDT and 75,000 $TICO. <a href=\"https://hackernoon.com/why-funtico-and-funnft-are-teaming-up-for-web3-gamings-future-your-chance-at-75000-$tico-starts\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/makowskid\">@makowskid</a> [ 4 Min read ] \n Over time, Kaizen has helped improve processes, boost morale, and even tackle technical debt bit by bit. It's a simple but effective way to ensure continuous i <a href=\"https://hackernoon.com/i-told-my-team-to-complain-every-weekit-transformed-our-productivity\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kitcast\">@kitcast</a> [ 7 Min read ] \n Discover how digital signage works, what to display, and how to start. Learn about key tech, content strategies, and why Apple TV makes it easier than ever. <a href=\"https://hackernoon.com/digital-signage-101-how-it-works-what-to-show-and-how-to-start\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/sshshln\">@sshshln</a> [ 12 Min read ] \n Prediction markets have long been seen as a disruptive force in scientific forecasting and decision-making.  <a href=\"https://hackernoon.com/science-has-a-credibility-problem-can-gambling-fix-it\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/precedent\">@precedent</a> [ 8 Min read ] \n Can ChatGPT-4 predict the future? This study explores how storytelling prompts improve its forecasting accuracy for economic trends and major cultural events. <a href=\"https://hackernoon.com/can-chatgpt-predict-the-future\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 4 Min read ] \n In a recent interview with Larry Kudlow, Elon Musk shared a moment of levity amid serious discussion about government inefficiency, cyber attacks, and more. <a href=\"https://hackernoon.com/elon-musk-says-reports-are-uselessand-honestly-hes-not-wrong\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/jay9thakur\">@jay9thakur</a> [ 8 Min read ] \n The Model Context Protocol has emerged as the universal translator for artificial intelligence, and it's redefining what integrated AI systems can achieve. <a href=\"https://hackernoon.com/mcp-the-universal-standard-making-ai-systems-talk-and-why-big-tech-is-betting-everything-on-it\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/zbruceli\">@zbruceli</a> [ 11 Min read ] \n Part II of the series: use MCP and Solana AgentKit to build an AI Agent that can trade USD and EUR stablecoins. <a href=\"https://hackernoon.com/building-an-ai-trading-agent-using-anthropics-mcp-part-ii\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/linked_do\">@linked_do</a> [ 14 Min read ] \n Knowledge graphs provide the missing “truth layer” for AI that transforms probabilistic outputs into real world business acceleration. <a href=\"https://hackernoon.com/knowledge-graphs-may-be-the-missing-link-businesses-need-for-an-ai-that-works\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ishanpandey\">@ishanpandey</a> [ 11 Min read ] \n Fabian Vogelsteller, blockchain pioneer behind ERC20, shares insights on LUKSO, decentralized identity, and Web3's social future.  <a href=\"https://hackernoon.com/the-man-behind-erc20-wants-to-make-web3-human-with-lukso\">Read More.</a></p>","contentLength":3019,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cloudflare Turns AI Against Itself With Endless Maze of Irrelevant Facts","url":"https://tech.slashdot.org/story/25/03/22/014247/cloudflare-turns-ai-against-itself-with-endless-maze-of-irrelevant-facts?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742617800,"author":"msmash","guid":210,"unread":true,"content":"Web infrastructure provider Cloudflare unveiled \"AI Labyrinth\" this week, a feature designed to thwart unauthorized AI data scraping by feeding bots realistic but irrelevant content instead of blocking them outright. The system lures crawlers into a \"maze\" of AI-generated pages containing neutral scientific information, deliberately wasting computing resources of those attempting to collect training data for language models without permission. \n\n\"When we detect unauthorized crawling, rather than blocking the request, we will link to a series of AI-generated pages that are convincing enough to entice a crawler to traverse them,\" Cloudflare explained. The company reports AI crawlers generate over 50 billion requests to their network daily, comprising nearly 1% of all web traffic they process. The feature is available to all Cloudflare customers, including those on free plans. This approach marks a shift from traditional protection methods, as Cloudflare claims blocking bots sometimes alerts operators they've been detected. The false links contain meta directives to prevent search engine indexing while remaining attractive to data-scraping bots.","contentLength":1160,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amazon CEO Criticizes Manager Fiefdoms and Stresses the Need For 'Meritocracy'","url":"https://slashdot.org/story/25/03/22/018254/amazon-ceo-criticizes-manager-fiefdoms-and-stresses-the-need-for-meritocracy?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742607900,"author":"msmash","guid":209,"unread":true,"content":"Amazon CEO Andy Jassy is pushing to cut bureaucracy by reducing management layers, according to a recording of a recent internal all-hands meeting obtained by Business Insider. Amazon plans to increase the ratio of individual contributors to managers by 15% by March-end, a process the company says is now complete and affected a \"relatively small subset of employees.\" \n\n\"The way to get ahead at Amazon is not to go accumulate a giant team and fiefdom,\" Jassy told employees, stressing that successful leaders \"get the most done with the least amount of resources.\" Jassy has established a \"No Bureaucracy\" email alias that has received over a thousand suggestions, leading to more than 375 changes aimed at speeding operations. \"It's a meritocracy,\" Jassy said, urging employees to \"move fast and act like owners.\"","contentLength":816,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Generated Pseudocode Prompts During Our Think-And-Execute Experiment","url":"https://hackernoon.com/generated-pseudocode-prompts-during-our-think-and-execute-experiment?source=rss","date":1742606193,"author":"Transcompiler: Learn How to Translate Code","guid":328,"unread":true,"content":"<h2>F Generated Pseudocode Prompts</h2><h3>F.1 Generated P of Dyck Languages</h3><h3>F.2 Generated P of Geometric Shapes</h3><h3>F.3 Generated P of Navigate</h3><h3>F.4 Generated P for Reasoning about Colored Objects</h3><h3>F.5 Generated P of Temporal Sequences</h3><h3>F.6 Generated P of Tracking Shuffled Objectives</h3><h3>F.7 Generated P of Web of Lies</h3><p>(1) Hyungjoo Chae, Yonsei University;</p><p>(2) Yeonghyeon Kim, Yonsei University;</p><p>(3) Seungone Kim, KAIST AI;</p><p>(4) Kai Tzu-iunn Ong, Yonsei University;</p><p>(5) Beong-woo Kwak, Yonsei University;</p><p>(6) Moohyeon Kim, Yonsei University;</p><p>(7) Seonghwan Kim, Yonsei University;</p><p>(8) Taeyoon Kwon, Yonsei University;</p><p>(9) Jiwan Chung, Yonsei University;</p><p>(10) Youngjae Yu, Yonsei University;</p><p>(11) Jinyoung Yeo, Yonsei University.</p>","contentLength":687,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Generated Analyses: Dyck Languages, Geometric Shapes, and More","url":"https://hackernoon.com/generated-analyses-dyck-languages-geometric-shapes-and-more?source=rss","date":1742605707,"author":"Transcompiler: Learn How to Translate Code","guid":327,"unread":true,"content":"<h3>E.1 Generated Analysis of Dyck Languages</h3><h3>E.2 Generated Analysis of Geometric Shapes</h3><h3>E.3 Generated Analysis of Navigate</h3><h3>E.4 Generated Analysis for Reasoning about Colored Objects</h3><h3>E.5 Generated Analysis of Temporal Sequences</h3><h3>E.6 Generated Analysis of Tracking Shuffled Objectives</h3><h3>E.7 Generated Analysis of Web of Lies</h3><p>(1) Hyungjoo Chae, Yonsei University;</p><p>(2) Yeonghyeon Kim, Yonsei University;</p><p>(3) Seungone Kim, KAIST AI;</p><p>(4) Kai Tzu-iunn Ong, Yonsei University;</p><p>(5) Beong-woo Kwak, Yonsei University;</p><p>(6) Moohyeon Kim, Yonsei University;</p><p>(7) Seonghwan Kim, Yonsei University;</p><p>(8) Taeyoon Kwon, Yonsei University;</p><p>(9) Jiwan Chung, Yonsei University;</p><p>(10) Youngjae Yu, Yonsei University;</p><p>(11) Jinyoung Yeo, Yonsei University.</p>","contentLength":706,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Examples of Human-Written Pseudocode Prompts","url":"https://hackernoon.com/examples-of-human-written-pseudocode-prompts?source=rss","date":1742605387,"author":"Transcompiler: Learn How to Translate Code","guid":326,"unread":true,"content":"<h2>D Human-written Pseudocode Prompts</h2><h3>D.1 Human-written P of Dyck Languages</h3><h3>D.2 Human-written P of Geometric Shapes</h3><h3>D.3 Human-written P of Navigate</h3><h3>D.4 Human-written P of Reasoning about Colored Objects</h3><h3>D.5 Human-written P of Temporal Sequences</h3><h3>D.6 Human-written P of Tracking Shuffled Objectives</h3><h3>D.7 Human-written P of Web of Lies</h3><p>(1) Hyungjoo Chae, Yonsei University;</p><p>(2) Yeonghyeon Kim, Yonsei University;</p><p>(3) Seungone Kim, KAIST AI;</p><p>(4) Kai Tzu-iunn Ong, Yonsei University;</p><p>(5) Beong-woo Kwak, Yonsei University;</p><p>(6) Moohyeon Kim, Yonsei University;</p><p>(7) Seonghwan Kim, Yonsei University;</p><p>(8) Taeyoon Kwon, Yonsei University;</p><p>(9) Jiwan Chung, Yonsei University;</p><p>(10) Youngjae Yu, Yonsei University;</p><p>(11) Jinyoung Yeo, Yonsei University.</p>","contentLength":718,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Director Charged With Netflix Fraud After Splurging on Crypto Instead of Finishing Sci-fi Series","url":"https://yro.slashdot.org/story/25/03/21/2343252/director-charged-with-netflix-fraud-after-splurging-on-crypto-instead-of-finishing-sci-fi-series?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742605200,"author":"msmash","guid":208,"unread":true,"content":"Hollywood filmmaker Carl Erik Rinsch has been charged with defrauding Netflix of $11 million after allegedly misusing funds intended for an unfinished science fiction series, federal prosecutors said. \n\nRinsch, 47, was arrested in West Hollywood this week on charges of wire fraud, money laundering and unlawful monetary transactions that could result in decades of imprisonment if convicted. The FBI and Acting U.S. Attorney for the Southern District of New York allege Rinsch diverted funds meant for his series \"Conquest\" to speculate on cryptocurrency, stay in luxury hotels and purchase high-end items including five Rolls-Royces and a Ferrari. \n\nNetflix had paid Rinsch $44 million between 2018 and 2019 for the science fiction project about an artificial humanlike species. Prosecutors say he then requested an additional $11 million but never completed the production. An arbitrator ruled in Netflix's favor last year, ordering Rinsch to pay the company $11.8 million. Rinsch appeared in federal court with shackles and posted a $100,000 bond.","contentLength":1051,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Prompts We Used in Our Experiments","url":"https://hackernoon.com/the-prompts-we-used-in-our-experiments?source=rss","date":1742604867,"author":"Transcompiler: Learn How to Translate Code","guid":325,"unread":true,"content":"<h2>C Prompts Used in Our Experiments</h2><h3>C.3 Prompt for NL Planning</h3><h3>C.4 Prompt for EXECUTE phase</h3><h3>C.5 Prompt for evaluating Direct Prompting</h3><h3>C.6 Prompt for evaluating Zero-shot CoT</h3><h3>C.7 Prompt for evaluating Zero-shot PoT</h3><h3>C.8 Prompt for evaluating Plan-and-Solve</h3><p>(1) Hyungjoo Chae, Yonsei University;</p><p>(2) Yeonghyeon Kim, Yonsei University;</p><p>(3) Seungone Kim, KAIST AI;</p><p>(4) Kai Tzu-iunn Ong, Yonsei University;</p><p>(5) Beong-woo Kwak, Yonsei University;</p><p>(6) Moohyeon Kim, Yonsei University;</p><p>(7) Seonghwan Kim, Yonsei University;</p><p>(8) Taeyoon Kwon, Yonsei University;</p><p>(9) Jiwan Chung, Yonsei University;</p><p>(10) Youngjae Yu, Yonsei University;</p><p>(11) Jinyoung Yeo, Yonsei University.</p>","contentLength":644,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Looking for a Better Deal on Broadband? What You Should Be Doing to Find It","url":"https://hackernoon.com/looking-for-a-better-deal-on-broadband-what-you-should-be-doing-to-find-it?source=rss","date":1742602074,"author":"The Markup","guid":324,"unread":true,"content":"<p>One of the first things I did upon moving into a new apartment last November was get a better deal on my broadband internet.</p><p>To discover what other internet service providers (ISPs) offered service to my building, I used a handy resource that the Federal Communications Commission had just released to the public a few days earlier—a new version of <a href=\"https://broadbandmap.fcc.gov/\">the National Broadband Map</a>. It’s an interactive tool that displays which companies offer connections at every location in the country and the maximum speed for those connections.</p><p>\\\nWhen I entered my address into the map, I discovered that <a href=\"https://www.astound.com/\">Astound</a>, a provider I didn’t know about, could offer me the same speeds I was getting from Spectrum, which was already the internet provider for the apartment. A visit to Astound’s <a href=\"https://www.astound.com/new-york/\">website</a> revealed that the company could also give me a cheaper price, which ended up saving me around $27 a month.</p><p>\\\nThe National Broadband Map has gotten major updates twice each year for more than a decade with info about which companies provide internet service to a given area. However, until last year, the map only had details for a general area—not for individual addresses. This lack of granularity presented a problem because, as an <a href=\"https://themarkup.org/still-loading/2023/05/11/see-the-neighborhoods-internet-providers-excluded-from-fast-internet\">investigation</a> into the digital divide by The Markup showed, the maximum speed offered by just one provider can vary dramatically from block to block, or even house to house.</p><p>\\\nThe new version of the map tries to identify every location across the country capable of receiving broadband internet service and what level of internet service, if any, a company can provide at that location.</p><p>\\\nBut the map, as it currently exists, is far from perfect. Locations are missing, and the availability of information, as submitted by providers, often doesn’t match the reality on the ground. However, the process of using the map to help you shop around has the upside of the potential to reveal, and allow you to personally help fix, inaccuracies on the map. Members of the public can identify errors and submit corrections themselves.</p><p>\\\nSince the map is a starting point for <a href=\"https://www.internetforall.gov/blog/how-fcc-national-broadband-map-impacts-bead-program-part-1-3-allocation-funds\">allocating</a> more than $42 billion in federal broadband funding in America, by identifying inaccuracies on the map, you can help play a small part in potentially guiding money to where it is most urgently needed.</p><p>\\\nHere’s how to search for a better deal on broadband.</p><h2>1. Find your home on the&nbsp;map</h2><p>Visit the National Broadband Map at <a href=\"https://broadbandmap.fcc.gov\">https://broadbandmap.fcc.gov</a> and enter your address. Ideally, your correct address should immediately come up as an option with all of the availability data displayed for your perusal. But the map can be, at times, a little temperamental. It may take a bit of resubmitting your address and clicking around to get the data you’re looking for to display.</p><p>\\\nIf you can’t get the map to locate your address, skip to step four.</p><h2>2. Look at the providers claiming to offer you service</h2><p>Are any offering high speeds apart from the one you currently use? (Make sure the “Fixed broadband” button in the upper-right-hand corner is highlighted.)</p><p>\\\nThe type of each connection offered is listed in the “Technology” column and, broadly speaking, “Fiber to the Premises” is considered the best type of connection in terms of speed and reliability, followed by cable. Connections listed under copper are usually slow and outdated. Satellite and fixed wireless connections can be extremely useful if there are no other options available, but they are generally considered inferior to fiber and cable.</p><h2>3. Go to the providers’ websites to see their rates</h2><p>Providers are identified by their corporate name, which is not necessarily the same one they present to the public when offering internet service. Charter Communications’ internet brand is Spectrum. Astound is listed under Radiate Holdings, LP. You may have to do a bit of Google sleuthing to figure out who is&nbsp;who.</p><p>\\\nThere’s no direct link on the map, so you need to search on Google (or your search engine of choice) to get the URL. For example, I searched “Radiate Holdings broadband” and found Astound’s website.</p><p>\\\nOnce you’re on an ISP’s website, enter your address into the tool that lets you search to see if the company serves your location—most ISPs have this in a pretty obvious place. You might find a faster speed, a lower price, or both.</p><h2>4. If what’s listed on the ISP’s website does not match what’s on the FCC’s&nbsp;map</h2><p>Hit the map’s “Availability Challenge” button and select the provider on whose site you noticed a contradiction. Decide if you want to file an official challenge, which forces the provider to check for errors, or submit an FYI to the FCC.</p><p>\\\n<strong>If you file an official challenge</strong>, FCC staff will perform an initial review, and if it passes muster, the internet service provider has 60 days to either concede the challenge and accept your revision or make its own argument to the agency backing up why what it originally submitted to the map was correct. If the provider doesn’t concede the challenge, the company may get in touch with you directly about it and point out where you may have been mistaken. In any case, the ultimate decision about what to do regarding any challenge is left up to the FCC.</p><p>\\\n<strong>If you’re submitting an FYI</strong>, your information will be used to inform the agency’s general efforts to improve the map but won’t kick off a challenge process.</p><p>\\\nFill out your information and, in the “reason for challenge” section, select either the ISP “does not offer the speed(s) reported” or the ISP “does not offer the technology reported” at your location. Describe your experience and, if you can, upload a screenshot to prove what you saw.</p><p>\\\nYou may not have gotten a better deal, but you just did your part to improve the FCC’s map! (Note: You have to either own or live at a location in order to submit an availability challenge there.)</p><p>\\\nFor more info on submitting an availability challenge, check out the FCC’s page on it <a href=\"https://help.bdc.fcc.gov/hc/en-us/articles/10476040597787-How-to-Submit-an-Availability-Challenge\">here</a>, and for info about what happens after submission, check out the FCC’s page explaining that <a href=\"https://help.bdc.fcc.gov/hc/en-us/articles/10476068909467-What-to-Expect-after-Filing-an-Availability-Challenge\">here</a>.</p><h2>5. If your address does not show up on the map at all, or shows up weirdly or&nbsp;incorrectly</h2><p>For example, people who live in apartment buildings with multiple units might see their building listed as a single-family home. If you see something wonky, or can’t find your location, look around on the map to find the building that most likely matches your home. Then, click the “Location Challenge” button, and then describe the issue. For more info, check out the FCC’s pages on <a href=\"https://help.bdc.fcc.gov/hc/en-us/articles/10476068909467-What-to-Expect-after-Filing-an-Availability-Challenge\">submitting a location challenge</a> and <a href=\"https://help.bdc.fcc.gov/hc/en-us/articles/10476425948443-What-to-Expect-after-filing-a-Location-Challenge-\">what happens after</a> you submit.</p><p>\\\nAgain, no better deal for you, but you’re still helping improve the map!</p><h2>6. Tell us what you&nbsp;found</h2><p>If you followed the above steps, we’d love to know what happened. Did you find a better deal on your internet or submit a challenge to the FCC?</p>","contentLength":6871,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta settles UK ‘right to object to ad-tracking’ lawsuit by agreeing not to track plaintiff","url":"https://techcrunch.com/2025/03/21/meta-settles-u-k-right-to-object-to-ad-tracking-lawsuit-by-agreeing-not-to-track-plaintiff/","date":1742601660,"author":"Natasha Lomas","guid":283,"unread":true,"content":"<article>A human rights campaigner, Tanya O’Carroll, has succeeded in forcing social media giant Meta not to use her data for targeted advertising. The agreement is contained in a settlement to an individual challenge she lodged against Meta’s tracking and profiling back in 2022. O’Carroll had argued that a legal right to object to the use […]</article>","contentLength":344,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple Sued For False Advertising Over Apple Intelligence","url":"https://apple.slashdot.org/story/25/03/21/2252226/apple-sued-for-false-advertising-over-apple-intelligence?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742600700,"author":"msmash","guid":207,"unread":true,"content":"Apple has been hit with a federal lawsuit claiming that the company's promotion of now-delayed Apple Intelligence features constituted false advertising and unfair competition. From a report: The suit, filed Wednesday in U.S. District Court in San Jose, seeks class action status and unspecified financial damages on behalf of those who purchased Apple Intelligence-capable iPhones and other devices. \"Apple's advertisements saturated the internet, television, and other airwaves to cultivate a clear and reasonable consumer expectation that these transformative features would be available upon the iPhone's release,\" the suit reads. \n\n\"This drove unprecedented excitement in the market, even for Apple, as the company knew it would, and as part of Apple's ongoing effort to convince consumers to upgrade at a premium price and to distinguish itself from competitors deemed to be winning the AI-arms race. [...] Contrary to Defendant's claims of advanced AI capabilities, the Products offered a significantly limited or entirely absent version of Apple Intelligence, misleading consumers about its actual utility and performance. Worse yet, Defendant promoted its Products based on these overstated AI capabilities, leading consumers to believe they were purchasing a device with features that did not exist or were materially misrepresented.\"","contentLength":1344,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Future of Mobile Marketing in the Entertainment Sector","url":"https://hackernoon.com/the-future-of-mobile-marketing-in-the-entertainment-sector?source=rss","date":1742598811,"author":"Maria Tutovich","guid":323,"unread":true,"content":"<p>You are reading this blog post on your smartphone, aren’t you? Perhaps we are wrong, but our assumption is based on the fact that over 60% of the Internet traffic now goes through mobile devices. That’s perfectly logical given that the number of smartphones has long exceeded the number of people on Earth!</p><p>\\\nThis has a heavy impact on the entertainment industry because providers in all niches now have to embrace the mobile-first approach so as to successfully attract new clients. The question we would like to discuss here is as follows: What does the future of mobile marketing in the entertainment sector entail? Let’s analyze it in the following sections.</p><h2>What’s Going On Right Now? The Current State of the Industry</h2><p>If you wish to know more about future events, you need to understand the present-day situation. So, what’s going on in the entertainment sector right now?</p><p>\\\nFirst of all, we can see the dominance of mobile-oriented websites in all spheres of digital pastime all over the world. We can take the iGaming field as a good example – websites in this niche are either optimized for smartphone experience or possess a dedicated mobile app.</p><p>\\\nSecondly, social media integration stands out as a crucial element of mobile marketing because major platforms such as Instagram are now the main channels for promoting literally all types of entertainment:</p><ul></ul><p>\\\nAt the same time, the success of streaming services (for instance Netflix or Disney+) also proves the unmatched potential of smartphone platforms in delivering on-the-go access to a huge portfolio of content options.</p><h2>Key Drivers of Innovation</h2><p>The current state of affairs is pretty clear, but what are the main innovation drivers? We could discuss dozens of more or less influential elements, but the point is to cut a long story short here. First of all, Augmented Reality (AR) is the name of the game when it comes to smartphone entertainment. This innovation truly revolutionizes gaming as well as live events thanks to its mind-boggling interaction abilities.</p><p>\\\nSimilar things can be said for Artificial Intelligence (AI) as it enables entertainment providers to personalize their services. For instance, they can now easily provide personalized content recommendations instead of offering generic “one size fits all” services.</p><p>\\\nAt the same time, AI-driven chatbots play a big role in modern customer service operations – they give users tailored responses so as to maximize the quality of customer experiences. We also can’t help but mention  with faster streaming and download speeds. In a nutshell, this innovation is critical for the vast majority of modern entertainment options because it enables uninterrupted services.</p><h2>Strategies for Future Mobile Marketing Success</h2><p>Strategies for future mobile marketing success in the entertainment sector will mostly revolve around advanced data analytics (plus a few extra elements). We are talking about the need to analyze gigantic data volumes so as to truly understand audience preferences as well as common behaviors – details like these help craft highly personalized campaigns that resonate with users. More importantly, real-time data will enable adaptive marketing strategies that can respond swiftly to changing trends and audience feedback.</p><p>\\\nBesides that, we expect to see more cross-platform integrations because many users frequently switch between devices. In such circumstances, it becomes important to allow users to easily transition from mobile to desktop to smart TVs without losing engagement. YouTube is a great example here as it lets viewers pick up exactly where they left off even if they change devices.</p><p>\\\nAnother interesting trend that will become even more important in the future is the advent of unified marketing campaigns. These are made in a way that maintains consistency in messaging as well as branding across multiple platforms. In our opinion, this is a superior solution when it comes to strengthening brand loyalty.</p><p>\\\nFinally, we also expect to see much more interactive content. That’s because younger users expect providers to include gamification in their content or at least add some interactive storytelling elements. Such details already proved to be magnificent engagement boosters that stimulate active participation in real time.</p><h2>You Better Be Ready to Adapt</h2><p>The bottom line is that every business or brand in the entertainment sector now has to think mobile-first in order to build a truly strong consumer base. This is mandatory for the long-term sustainability of any business, so you better be ready to adjust your services if you are also operating in this area: Those who fail to do so are likely to lose the market race against their more proactive competitors.</p>","contentLength":4743,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Wine 10.4 Brings More Direct3D To Vulkan Video Handling, Continued Bluetooth Driver Work","url":"https://www.phoronix.com/news/Wine-10.4-Released","date":1742597662,"author":"Michael Larabel","guid":680,"unread":true,"content":"<article>Wine 10.4 is out tonight as the newest bi-weekly development release of this open-source software for running Windows games and applications on Linux, macOS, and other platforms...</article>","contentLength":180,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta Spotted Testing AI-Generated Comments on Instagram","url":"https://tech.slashdot.org/story/25/03/21/2246239/meta-spotted-testing-ai-generated-comments-on-instagram?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742597160,"author":"msmash","guid":206,"unread":true,"content":"Meta is testing an AI feature that generates comment suggestions for Instagram posts. Users with access to the test see a pencil icon beside the comment field that activates \"Write with Meta AI.\" The system analyzes photos before offering three comment suggestions, which users can refresh for alternatives. For a photo showing someone smiling with a thumbs-up in their living room, suggested comments include \"Cute living room setup\" and \"Love the cozy atmosphere.\"","contentLength":466,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anduril might build a weapons factory in the UK","url":"https://techcrunch.com/2025/03/21/anduril-might-build-a-weapons-factory-in-the-uk/","date":1742593905,"author":"Charles Rollet","guid":282,"unread":true,"content":"<article>Anduril might build a factory in the U.K. as it expands beyond U.S. defense contracts.</article>","contentLength":86,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cloudflare turns AI against itself with endless maze of irrelevant facts","url":"https://arstechnica.com/ai/2025/03/cloudflare-turns-ai-against-itself-with-endless-maze-of-irrelevant-facts/","date":1742591675,"author":"Benj Edwards","guid":312,"unread":true,"content":"<p>On Wednesday, web infrastructure provider Cloudflare announced a new feature called \"<a href=\"https://blog.cloudflare.com/ai-labyrinth/\">AI Labyrinth</a>\" that aims to combat unauthorized AI data scraping by serving fake AI-generated content to bots. The tool will attempt to thwart AI companies that crawl websites without permission to collect training data for large language models that power AI assistants like <a href=\"https://arstechnica.com/information-technology/2023/11/chatgpt-was-the-spark-that-lit-the-fire-under-generative-ai-one-year-ago-today/\">ChatGPT</a>.</p><p>Cloudflare, founded in 2009, is probably best known as a company that <a href=\"https://en.wikipedia.org/wiki/Cloudflare\">provides</a> infrastructure and security services for websites, particularly protection against <a href=\"https://en.wikipedia.org/wiki/DDoS_mitigation\">distributed denial-of-service</a> (DDoS) attacks and other malicious traffic.</p><p>Instead of simply blocking bots, Cloudflare's new system lures them into a \"maze\" of realistic-looking but irrelevant pages, wasting the crawler's computing resources. The approach is a notable shift from the standard block-and-defend strategy used by most website protection services. Cloudflare says blocking bots sometimes backfires because it alerts the crawler's operators that they've been detected.</p>","contentLength":1008,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/03/robot_maze_1-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Meta has revenue sharing agreements with Llama AI model hosts, filing reveals","url":"https://techcrunch.com/2025/03/21/meta-has-revenue-sharing-agreements-with-llama-ai-model-hosts-filing-reveals/","date":1742589653,"author":"Kyle Wiggers","guid":281,"unread":true,"content":"<article>In a blog post last July, Meta CEO Mark Zuckerberg said that “selling access” to Meta’s openly available Llama AI models “isn’t [Meta’s] business model.” Yet Meta does make at least some money from Llama through revenue-sharing agreements, according to a newly unredacted court filing. The filing, submitted by attorneys for the plaintiffs in the […]</article>","contentLength":366,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How BYD plans to make EV charging as fast as filling a gas tank","url":"https://techcrunch.com/2025/03/21/how-byd-plans-to-make-ev-charging-as-fast-as-filling-a-gas-tank/","date":1742589030,"author":"Tim De Chant","guid":280,"unread":true,"content":"<article>What we found mostly supports the auto makers claims, with a few caveats.</article>","contentLength":73,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Valve removes video game demo suspected of being malware","url":"https://techcrunch.com/2025/03/21/valve-removes-video-game-demo-suspected-of-being-malware/","date":1742587134,"author":"Lorenzo Franceschi-Bicchierai","guid":279,"unread":true,"content":"<article>Valve removed a video game called Sniper: Phantom's Resolution from Steam after users reported that its free demo contained malware. </article>","contentLength":133,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anthropic’s new AI search feature digs through the web for answers","url":"https://arstechnica.com/ai/2025/03/anthropics-new-ai-search-feature-digs-through-the-web-for-answers/","date":1742584136,"author":"Benj Edwards","guid":311,"unread":true,"content":"<p>On Thursday, Anthropic <a href=\"https://www.anthropic.com/news/web-search\">introduced</a> web search capabilities for its AI assistant Claude, enabling the assistant to access current information online. Previously, the latest AI model that powers Claude could only rely on data absorbed during its neural network training process, having a \"knowledge cutoff\" of October 2024.</p><p>Claude's web search is currently available in feature preview for paid users in the United States, with plans to expand to free users and additional countries in the future. After users enable the feature in their profile settings, Claude will automatically determine when to use web search to answer a query or find more recent information.</p><p>The new feature works with <a href=\"https://arstechnica.com/ai/2025/02/claude-3-7-sonnet-debuts-with-extended-thinking-to-tackle-complex-problems/\">Claude 3.7 Sonnet</a> and requires a paid subscription. The addition brings Claude in line with competitors like Microsoft Copilot and ChatGPT, which already offer similar functionality. ChatGPT <a href=\"https://arstechnica.com/information-technology/2023/03/chatgpt-gets-eyes-and-ears-with-plugins-that-can-interface-ai-with-the-world/\">first added</a> the ability to grab web search results as a plugin in March 2023, so this new feature is a long time coming.</p>","contentLength":999,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/03/anthropoc_search-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"AMD Announces AITER For ROCm To Help Boost AI Performance","url":"https://www.phoronix.com/news/AMD-AITER-AI-Performance-ROCm","date":1742583206,"author":"Michael Larabel","guid":679,"unread":true,"content":"<article>AMD has been on a software / container / documentation spree recently around ROCm and today are announcing another software addition to the ROCm portfolio: AITER...</article>","contentLength":164,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Monica Technologies Simplifies Crypto To Naira Conversions","url":"https://hackernoon.com/monica-technologies-simplifies-crypto-to-naira-conversions?source=rss","date":1742582947,"author":"BTCWire","guid":322,"unread":true,"content":"<p>Lagos, Nigeria — Monica Technologies, a Nigerian fintech startup, is shooting for the stars as a skyrocketing platform that converts cryptocurrencies to naira at high speed.</p><p>\\\nFocusing on reducing friction and improving reliability regarding trading, the high-efficiency platform tackles an issue faced by many content creators and earners in cryptocurrencies: the fast and safe conversion of digital assets into local currency.</p><p>Monica Technologies is a remarkable platform that converts users' USDT into naira in less than one minute on average, despite the transaction speed everyone expects in the digital financial age.</p><p>\\\nAnd it isn't just tooting its own horn; its speed has been tested in real time and can be seen streamed online. With such performance, the user experience improves significantly, and Monica Technologies also rises to prominence in Nigeria’s fintech space.</p><p>\\\nMonica Technologies is entirely self-funded, unlike many startups that require outside funding to start operations. They have been able to focus on building their service simply and investor-free. A primary feature of their service is the users' need for speed and security, ensuring that when anyone is changing their crypto to naira, they do so with confidence.</p><p>\\\nTechnology and Security at the Core</p><p>Monica Technologies incorporates robust technology built into its platform works on the rich, user-friendly, fast conversion process.</p><p>\\\nIt guarantees that every transaction is securely processed, alleviating the most pressing issue of access to security in digital financial transactions. This strong base has  given the startup a growing audience and laid a foundation for future expansion.</p><h3>Driving Cryptocurrency Adoption Through Efficient Conversions</h3><p>Amid increasing worldwide interest in cryptocurrencies, platforms like Monica Technologies have become paramount for efficient conversion solutions.</p><p>\\\nTheir platform powers the everyday financial transactions of individuals and creators and drives the broader adoption of digital currencies in everyday commerce.</p><h3>Future Outlook and Expansion Plans</h3><p>Although Monica Technologies is not actively seeking new investors at the moment, its market traction and potential make it a noteworthy contender in the fintech sector. The startup’s ability to scale operations while maintaining a robust business model is a testament to their strategic planning and market foresight.</p><p>\\n Looking ahead, Monica Technologies plans to refine its technology further and broaden its service offerings. Committed to staying at the forefront of the fintech industry, the company aims to continuously set new standards for speed and security, challenging other industry players to meet these benchmarks.</p><p>:::tip\nThis story was distributed as a release by Btcwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":2868,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TOMI Launches The First AI Voice Assistant Embedded Within a Crypto Wallet","url":"https://hackernoon.com/tomi-launches-the-first-ai-voice-assistant-embedded-within-a-crypto-wallet?source=rss","date":1742582393,"author":"BTCWire","guid":321,"unread":true,"content":"<p>March 21, 2025 — TOMI, the Web3 infrastructure project creating a decentralized alternative internet ecosystem, introduces the first AI-powered voice assistant for a Web3 wallet, which will enable the expedition of a variety of routine crypto-related tasks.</p><p>\\\nThe AI assistant adds a layer of automation and personal guidance to the , providing convenience, efficiency, and enhanced accessibility. With this added feature to the TOMI Wallet, users can now send funds and soon will be able to swap tokens, check prices and token details, monitor balances, and view transaction history via voice commands. The TOMI wallet, with the AI voice assistant, is available to download for  and .</p><p>\\\nAs AI features increasingly find their way into crypto platforms, products, and services, there is rising interest in utilizing advanced AI technologies like natural language processing (NLP) and automatic speech recognition (ASR) within Web3 wallets.</p><p>\\\nProgress is being made to integrate AI voice commands into crypto wallets, but the industry hasn’t yet provided Web3 users with an all-encompassing solution. For example, Tether’s  is expected to provide enhanced security features, but it's only in the developmental stage and only caters to Bitcoin holders.</p><p>\\\nTOMI’s new AI-powered voice assistant provides hands-free convenience to users, allowing them to engage with digital assets as they go about their daily routines. The AI voice assistant enables faster, mistake-free onboarding with its AI-driven step-by-step direction and contextual understanding, reducing the possibility of sending tokens to the wrong address or selecting the wrong network.</p><p>\\\nBy managing crypto through TOMI’s intuitive voice interface, users can save time by eliminating the need to navigate multiple screens. The TOMI Wallet’s AI voice assistant is the product of a technical collaboration with , a platform for creating advanced AI agents, who built and integrated the feature.</p><p>\\\nThe TOMI Wallet’s voice assistant integrates with users’ contacts, offering them the convenience of addressing a contact by name while the AI links them to the right address on the correct network. In the future, TOMI will extend these AI-powered capabilities to manage more aspects of the user experience across TOMI’s broader ecosystem. This could include identity verification, assistance engaging with DeFi protocols, handling NFT transactions, and more.</p><blockquote><p>“By embedding AI at the core of the TOMI Wallet, we aim to provide a more unified, intuitive, and smooth user experience,” says Moshe Hogeg, Founder and senior consultant at TOMI. “Soon, our users will be able to not only send crypto through AI voice assistant, but also check market data, interact with DeFi or NFT features, and more. As the first true AI voice assistant to be integrated into a crypto wallet, we aim to redefine the standard for crypto wallets going forward by emphasizing the UX.”</p></blockquote><p>TOMI is on a mission to increase digital freedom and build a more democratic and decentralized internet - where users have full control over their data, transactions, and communications.</p><p>\\\nThrough TOMI, messaging and crypto payments come together, enabling seamless intuitive financial interactions. By making transactions as easy as chatting, tomi is redefining how people connect and transact in the digital age. For more information, visit: </p><p>:::tip\nThis story was distributed as a release by Btcwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":3513,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek: Everything you need to know about the AI chatbot app","url":"https://techcrunch.com/2025/03/21/deepseek-everything-you-need-to-know-about-the-ai-chatbot-app/","date":1742582280,"author":"Kyle Wiggers","guid":278,"unread":true,"content":"<article>DeepSeek has gone viral. Chinese AI lab DeepSeek broke into the mainstream consciousness this week after&nbsp;its chatbot app rose to the top of the Apple App Store charts (and Google Play, as well). DeepSeek’s AI models, which were trained using compute-efficient techniques,&nbsp;have led Wall Street analysts&nbsp;—&nbsp;and technologists&nbsp;— to question whether the U.S. can maintain its […]</article>","contentLength":386,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Proposes \"Hornet\" Security Module For The Linux Kernel","url":"https://www.phoronix.com/news/Microsoft-Hornet-Linux-LSM","date":1742581292,"author":"Michael Larabel","guid":678,"unread":true,"content":"<article>Microsoft's newest open-source contribution to the Linux kernel being proposed is... Hornet, a Linux security module (LSM) for providing signature verification of eBPF programs...</article>","contentLength":179,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ReactOS 0.4.15 Released For This \"Open-Source Windows\" OS With Tons Of Enhancements","url":"https://www.phoronix.com/news/ReactOS-0.4.15-Released","date":1742577155,"author":"Michael Larabel","guid":677,"unread":true,"content":"<article>It's been over three years since the last ReactOS open-source operating system release for this platform working on API/ABI compatibility with Microsoft Windows. Today ReactOS 0.4.15 was finally published...</article>","contentLength":207,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TechCrunch has, yes, personal news!","url":"https://techcrunch.com/2025/03/21/techcrunch-has-personal-news/","date":1742577116,"author":"Connie Loizos","guid":277,"unread":true,"content":"<article>If you haven’t heard the news, TechCrunch has a shiny new home. After years under the ownership of Yahoo — which, in turn, is backed by Apollo Group — the brand is now in fresh hands. Its new parent company: Regent, a dynamic private equity firm with a diverse portfolio spanning media, retail, and manufacturing. […]</article>","contentLength":325,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anthropic appears to be using Brave to power web search for its Claude chatbot","url":"https://techcrunch.com/2025/03/21/anthropic-appears-to-be-using-brave-to-power-web-searches-for-its-claude-chatbot/","date":1742576823,"author":"Kyle Wiggers","guid":276,"unread":true,"content":"<article>Earlier this week, Anthropic rolled out a web search feature for its AI-powered chatbot platform, Claude, bringing the bot in line with many of its rivals. It wasn’t immediately clear which search index might be powering the feature — one possibility was that Anthropic had developed its own. But evidence suggests it’s Brave Search, the […]</article>","contentLength":349,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TechCrunch Mobility: Inside Waymo’s deal with SFO, Elon’s moment of truth, and BYD’s breakthrough","url":"https://techcrunch.com/2025/03/21/techcrunch-mobility-inside-waymos-deal-with-sfo-elons-moment-of-truth-and-byds-breakthrough/","date":1742576700,"author":"Kirsten Korosec","guid":274,"unread":true,"content":"<article>Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! Before we jump into the news, just a quick bit of housekeeping. I’m putting “This week’s wheels” on hiatus for a few weeks as I get into […]</article>","contentLength":320,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Startups Weekly: Wiz’s bet paid off in an M&A-rich week","url":"https://techcrunch.com/2025/03/21/startups-weekly-wizs-bet-paid-off-in-an-ma-rich-week/","date":1742576700,"author":"Anna Heim","guid":275,"unread":true,"content":"<article>Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday? Sign up here. It’s rare to report on an 11-figure startup acquisition, let alone multiple high-value deals in a single week. And there are more subtle signs that things are […]</article>","contentLength":324,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Think Before You Link: Security Risks of Microchip Implants","url":"https://hackernoon.com/think-before-you-link-security-risks-of-microchip-implants?source=rss","date":1742574997,"author":"Zac Amos","guid":320,"unread":true,"content":"<p><strong>The ability to control electronics without touching them or paying with a swipe of the hand may seem like sci-fi, but it’s a growing reality. Microchip implants have existed in some form for decades, and technology is now advanced enough to make them practical. Still, this field carries significant security concerns.</strong></p><h2><strong>The Growing Field of Implanted Microchips</strong></h2><p>Veterinarians have implanted radiofrequency identification chips in pets since the 1990s. Human microchips  for medical use, though the technology did not catch on at the time.</p><p>\\\nFast-forward to today, and several leading tech companies and startups are researching microchip implants. Most famously, Elon Musk’s Neuralink has begun trials for brain-computer interfaces, which let users control electronic devices with their thoughts. Simpler chips that use RFID or near-field communication to store information or manage electronic payments are already available for commercial use.</p><p>\\\nThese chips can stand in for debit cards, give doctors access to vital medical information or work as keycards to access digital locks. Though they may not necessarily be widespread yet, they’re becoming increasingly prevalent.</p><h2>Cybersecurity Risks of Microchip Implants</h2><p>While chip implants can be highly convenient, they also open the door to unique cybersecurity risks. People should consider these potential dangers before proceeding with the technology.</p><p>Contactless payments are one of the most practical ways to use an implanted microchip. However, this application means users are theoretically always vulnerable to skimming. Cybercriminals could intercept financial information if they get close enough to the implant, and because it’s essentially part of the user’s body, physical protections are minimal.</p><p>\\\nThankfully, while skimming has garnered much attention from RFID-blocking wallets, it’s not a common threat. NFC is even more secure, as it can  of the chip, making it difficult for criminals to get close enough. Still, the possibility may worry some consumers.</p><p>A more concerning threat is the risk of cybercriminals installing malware onto an implanted chip. Researchers have proved that , even when the chip does not connect to an actively running device. Attackers may still need to get close to do so, but the damage might go far beyond skimming card details.</p><p>\\\nMalware could cause a chip to malfunction. Depending on what people use their microchips for, that could leave them locked out of rooms or unable to access some electronics. The malware could also spread to anything that connects to the implant, including smart home devices or users’ phones.</p><p>Finally, storing sensitive data in a wirelessly accessible chip in people’s bodies raises privacy questions, especially when it comes to BCIs. A BCI could theoretically , even including users’ thoughts if technology advances enough.</p><p>\\\nA breach at a business storing its customers’ brainwaves could give criminals access to a massive amount of highly sensitive information. Even outside such an event, targeted advertising based on brain data may feel like a privacy violation. The possibility of government bodies accessing this information further complicates the ethical implications.</p><p>Given these risks, implanted chips should implement a few extra security measures to protect their users. More best practices will emerge as the technology develops, but there are still a few must-have options to include.</p><p>The companies offering microchip implants must adhere to zero-trust policies. Government agencies , and private businesses would be wise to adopt the same standards.</p><p>\\\nZero-trust architecture treats every transaction as a possible breach, verifying all data transmissions before allowing them. It also restricts access permissions as much as possible. That level of attention and responsiveness is crucial for anything involving as much sensitive information and potential complications as a chip in users’ bodies.</p><p>Implementing stronger defenses for accessing the microchip and its connected services is also critical. Even a PIN is better than nothing. Hackers can , but they would still have to get within centimeters of an implanted NFC chip to do so.</p><p>\\\nSetting and changing a PIN and managing the information and permissions of an implanted chip should require more robust protections. Strong passwords and multi-factor authentication are essential. Services should also restrict access attempts to stop unauthorized users from changing what it takes to get into an implant-based system.</p><p>Finally, microchip implants will be more secure when they do less. While some organizations may not want to sacrifice functionality, limiting what a chip can do minimizes the ways an attacker can take advantage of it. Restricting long-range communications is vital for protection.</p><p>\\\nThe most robust defense implanted chips have today is that they only work within a few centimeters. A microchip with remote accessibility or Wi-Fi functionality suddenly becomes vulnerable to a much wider range of attacks and potential entry points. Maintaining a relative air gap by relying on NFC or RFID and restricting the kinds of data a chip can access and transmit make them far safer.</p><h2>Microchip Implants Are Exciting But Potentially Risky</h2><p>Despite being around since the ‘90s, implanted microchip technology is still in its infancy. As this field grows and develops, its possibilities will expand, but so might its potential dangers.</p><p>\\\nCybersecurity considerations must come before expanded functionality and adoption. When these systems follow a security-by-design approach, people can use them confidently and safely. Failing to consider such risks in design and implementation could lead to catastrophic consequences.</p>","contentLength":5734,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kwaku Otchere's Vision for the Future of Live Event Ticketing with Vipass","url":"https://hackernoon.com/kwaku-otcheres-vision-for-the-future-of-live-event-ticketing-with-vipass?source=rss","date":1742574616,"author":"Jon Stojan Journalist","guid":319,"unread":true,"content":"<p>\\\nWaiting patiently for physical tickets to arrive in the mail or making a trip to the box office is long gone. Event tech has grown to offer more convenient and secure options. While digital tickets have become the norm, challenges around security and ticket authentication still remain.  aims to push event tech into its next phase by solving this issue and offering enhanced convenience through a streamlined approach and even greater security for event-goers and organizers alike.&nbsp;</p><p>Led by entrepreneur Kwaku Otchere, founder and CEO, Vipass is an events platform that combines secure digital solutions with a user-centric design to improve how event attendees experience live music and entertainment. Guided by Otchere's vision to redefine ticketing and live event engagement, this platform aims to create meaningful connections between event attendees and organizers to ensure a seamless and unforgettable experience.</p><blockquote><p>\"Our mission is to redefine what ticketing means by creating a more connected, immersive experience that goes beyond the transaction,\" </p></blockquote><p>\\\nThe forward-thinking platform brings together ticketing, fan engagement, and digital innovation that enhance the entire event journey—not just the transaction. The Vipass system uses real-time engagement and communication, sending attendees personalized updates and event information before and during the event to create an interactive and integrated live event experience.</p><p>\\\nThis progressive ticketing system also addresses the primary concerns of ticketing: securing and authenticating a user's ticket. With physical tickets possibly leading to difficulties for both organizers and attendees, digital tickets have become a simpler method for authenticating a user's ticket. Vipass has a security guarantee, providing relief for attendees excited for an entertaining experience, with the platform's system eliminating fraud by ensuring every ticket is tied to a verified user and preventing unauthorized resale.</p><h2><strong>Kwaku Otchere: Shaping the Future of Live Events</strong></h2><p>Kwaku, whose career spans leadership roles at Apple and The Walt Disney Company, is now using his skills to elevate live events through Vipass. His journey, from his roots in Ghana to leading teams of professionals from around the world, shows his resilience, creativity, and drive to make a lasting impact.</p><p>\\\nKwaku founded Vipass with the mission to address a key issue in live events: a recurring disconnect where transactional ticketing overshadowed the potential for deeper engagement. Inspired by a personal desire to create meaning from loss, he had the vision to create a platform that would bridge this gap and create a more immersive, personalized journey for both event-goers and organizers.</p><h2><strong>Past Successes and Future Goals</strong></h2><p>Vipass's digital innovation in ticketing and event experiences is enhancing personalization, security, and fan engagement at music festivals and entertainment events across the globe.</p><p>\\\nAt last year's NYE event in Prague, Vipass teamed up with WeLit, which is one of the Czech Republic's leading entertainment brands and is known for delivering high-energy events that bring people together in celebration. With WeLit's New Year's Eve events famously high-profile and lavish, Vipass's collaborative efforts demonstrated how much easier the ticketing process can be with their innovative, secure, and seamless ticketing platform.</p><p>\\\nWith a major upcoming collaboration on the way, this platform aims to expand and influence the event industry in 2025. Stay tuned for the announcement of this major collaboration, which will showcase the next step in Vipass's growth and impact on the event technology space.</p>","contentLength":3655,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Go Interfaces, Explained for TypeScript Developers","url":"https://hackernoon.com/go-interfaces-explained-for-typescript-developers?source=rss","date":1742574444,"author":"Gokul Chandrasekaran","guid":318,"unread":true,"content":"<p>\\\nAs someone who has worked primarily with Typescript over the last few years, learning Golang was challenging as much as it was stimulating.</p><h3>Recap: What are interfaces?</h3><p>Interfaces ensure consistent behavior without focusing on implementation details.</p><h3>Interfaces in TypeScript are structural</h3><blockquote><p><strong>TypeScript is a  type system, one way it achieves this is using interfaces.</strong></p></blockquote><p>\\\nThey allow you to define the structure of objects you expect to handle within your code. Let’s take a common example of a  object.</p><pre><code>interface Person {\n    name: string\n    talk(text: string): void\n    walk(to: string): string\n}\n\nconst john: Person = {\n    name: 'John Doe',\n    talk: function (text: string): void {\n        console.log('Speaking: ', text)\n    },\n    walk: function (to: string): string {\n        return `${this.name} is at ${to}`\n    },\n}\n</code></pre><h3>Go’s interfaces are behavioral</h3><p>Go uses , meaning a struct matches an interface as long as it has matching method signatures.</p><p>In Go, there is , all structs implicitly implement interfaces. The compiler deduces this during build time.</p><pre><code>// interface to be implemented by the Person struct\ntype PersonLike interface {\n Walk(string) string\n Talk(string)\n}\n\n// a `Person` struct\ntype Person struct {\n Name string\n}\n\n// Talk implements PersonBehavior.\nfunc (p Person) Talk(text string) {\n println(p.Name + \"is saying: '\" + text)\n}\n\n// Walk implements PersonBehavior.\nfunc (p Person) Walk(text string) string {\n return p.Name + \"is at \" + text\n}\n\nfunc main() {\n // declare `john` of PersonLike type\n var john PersonLike\n // assign an instance of the Person\n john = Person{}\n\n // invoke `.Walk` on the object\n println(john.Walk(\"home\"))\n}\n</code></pre><p>In the above example, a struct is first created and then the methods are implemented on it.</p><blockquote><p>The compiler automatically detects the implementation of the interface by the  struct. Any struct having the method signature will satisfy the interface type</p></blockquote><p>\\\nThe example below demonstrates how the same object instance can satisfy multiple interfaces, each containing a subset of its method signatures.</p><pre><code>package main\n\n// interface to be implemented by the Person struct\ntype PersonLike interface {\n Walk(string) string\n Talk(string)\n}\n\n// interface that only has `Walk`\ntype Walker interface {\n Walk(string) string\n}\n\n// interface that only has `Talk`\ntype Talker interface {\n Talk(string)\n}\n\n// a `Person` struct\ntype Person struct {\n Name string\n}\n\nfunc (p Person) Talk(text string) {\n println(p.Name + \"is saying: '\" + text)\n}\n\nfunc (p Person) Walk(text string) string {\n return p.Name + \"is at \" + text\n}\n\nfunc main() {\n // declare `john` of PersonLike type\n var john PersonLike\n // assign an instance of the Person\n john = Person{}\n\n var johnWalker Walker\n // assign to object to `Walker` type\n johnWalker = john\n // invoke `.Walk`\n johnWalker.Walk(\"home\")\n // Error below: johnWalker.Talk is undefined (Walker does not have Talk method)\n johnWalker.Talk(\"I am home\")\n\n var johnTalker Talker\n johnTalker = john\n johnTalker.Talk(\"How do I get home?\")\n\n // invoke `.Walk` on the object\n println(john.Walk(\"home\")) // \"John is at home\"\n println(john.(Person).Name) // John\n}\n</code></pre><p> allows you to create interfaces that have no methods declared i.e., it can hold a value of any type without any restrictions.</p><p>The  equivalent would be the  type</p><pre><code>const empty: unknown = {}\n</code></pre><p>Empty interfaces come in handy when the programmer knows the type but it is unknown to the type system. A common example would be de-serializing unknown types.</p><pre><code>func parse(val interface{}) (string, error) {\n // Gets the type of `value`\n switch value := val.(type) {\n case string:\n  return string(value), nil\n default:\n  return \"\", fmt.Errorf(\"unsupported data %#v\", value)\n }\n}\n</code></pre><p>Methods in Go can have either Pointer receivers or value receivers. Depending on what is used the compiler treats them differently while matching interfaces.</p><p>The following code won’t be compiled because of the error in line 39.</p><pre><code>package main\n\n// interface that only has `Talk`\ntype Talker interface {\n Talk(string)\n}\n\n// a `PersonPtr` struct that has a pointer receiver for `Talk`\ntype PersonPtr struct {\n Name string\n}\n\n// Add implements PersonBehavior.\nfunc (p *PersonPtr) Talk(text string) {\n println(p.Name + \"is saying: '\" + text)\n}\n\n// a `Person` struct that has a value receiver for `Talk`\ntype Person struct {\n Name string\n}\n\n// Add implements PersonBehavior.\nfunc (p Person) Talk(text string) {\n println(p.Name + \"is saying: '\" + text)\n}\n\nfunc main() {\n // assign an instance of the Person\n var john Talker\n\n johnny := PersonPtr{}\n johnny.Talk(\"I can talk\")\n\n // Error: PersonPtr does not implement Talker (method Talk has pointer receiver)\n john = johnny \n\n john.Talk(\"This wont work\")\n}\n</code></pre><p>This can however be fixed by replacing the assignment that  with:</p><ul><li>Since  is implemented only for , passing a pointer () to , ensuring it satisfies the interface.</li></ul><ul><li><strong>Go interfaces enable implicit implementation</strong>, reducing boilerplate and improving flexibility.</li><li> allows structs to satisfy interfaces automatically if method signatures match.</li><li><strong>Multiple interface satisfaction</strong> lets a struct conform to different behaviors dynamically.</li><li> provide a way to handle unknown types, useful for generics.</li><li><strong>Pointer vs. value receivers impact interface satisfaction</strong> - choosing the right one is key.</li></ul><p><em>Hope you enjoyed reading this as much as I enjoyed writing it.</em> \\n <em>If you think this will be of help to someone? Do not hesitate to share. If you liked it, tap the  below so other people will see this here on Medium. Don’t forget to show some love by </em></p>","contentLength":5497,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Security Hardening Cache Randomization Was Inadvertently Using The Same Seed","url":"https://www.phoronix.com/news/Linux-6.15-slab","date":1742573330,"author":"Michael Larabel","guid":676,"unread":true,"content":"<article>Ahead of the upcoming Linux 6.15 kernel cycle a few early pull requests have already been sent in to Linus Torvalds in advance of the anticipated v6.14 release on Sunday. Among those early changes for Linux 6.15 are the SLAB allocator updates that include a fix for cache randomization with kvmalloc inadvertently being inadequate due to accidentally using the same randomization seed...</article>","contentLength":387,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The HackerNoon Newsletter: Swift init(), Once and for All (3/21/2025)","url":"https://hackernoon.com/3-21-2025-newsletter?source=rss","date":1742573069,"author":"Noonification","guid":317,"unread":true,"content":"<p>🪐 What’s happening in tech today, March 21, 2025?</p><p>By <a href=\"https://hackernoon.com/u/badmonster0\">@badmonster0</a> [ 8 Min read ] Tutorial on indexing codebase for RAG with CocoIndex and Tree-sitter: chunking, embedding, semantic search, and build vector index for efficient retrieval. <a href=\"https://hackernoon.com/want-ai-to-actually-understand-your-code-this-tool-says-it-can-help\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/willrrr\">@willrrr</a> [ 10 Min read ] The evolution of cryptocurrencies from their advent to their current, degenerate, state and some food for thought on where we are. <a href=\"https://hackernoon.com/the-reverse-scam-or-how-the-community-has-failed-crypto\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/aryawrites\">@aryawrites</a> [ 4 Min read ] Vertical SaaS content doesn’t have to be boring. Tap into customer calls to build sharp, problem-first messaging that actually converts. <a href=\"https://hackernoon.com/your-next-content-breakthrough-isnt-on-googleits-buried-in-your-last-10-customer-calls\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kfamyn\">@kfamyn</a> [ 19 Min read ] Learn everything about Swift initializers — convenience override, saving memberwise initializer, required init() use cases, parameterless UIView() and more! <a href=\"https://hackernoon.com/swift-init-once-and-for-all\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/MelvinTalk\">@MelvinTalk</a> [ 3 Min read ] Entrepreneur Asia Solnyshkina explores why women managers overperform, the hidden costs to businesses, and how workplace flexibility boosts talent  innovation <a href=\"https://hackernoon.com/why-women-managers-have-to-overperform-and-how-its-costing-businesses-talent-and-innovation\">Read More.</a></p><p>🧑‍💻 What happened in your world this week?</p><p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>","contentLength":1239,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Video Friday: Meet Mech, a Superhumanoid Robot","url":"https://spectrum.ieee.org/video-friday-superhumanoid-mech","date":1742572803,"author":"Evan Ackerman","guid":87,"unread":true,"content":"<p>Your weekly selection of awesome robot videos</p>","contentLength":45,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81ODM3Mzc4OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc0NDQ4Mjg2MX0.8F1Nv-rQ90yavrc6BODCzk8vQ7Wgo0uRAuMXAz9ztMk/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"ChatGPT: Everything you need to know about the AI-powered chatbot","url":"https://techcrunch.com/2025/03/21/chatgpt-everything-to-know-about-the-ai-chatbot/","date":1742572005,"author":"Kyle Wiggers, Cody Corrall, Alyssa Stringer, Kate Park","guid":273,"unread":true,"content":"<article>ChatGPT, OpenAI’s text-generating AI chatbot, has taken the world by storm since its launch in November 2022. What started as a tool to supercharge productivity through writing essays and code with short text prompts has evolved into a behemoth with 300 million weekly active users. 2024 was a big year for OpenAI, from its partnership […]</article>","contentLength":343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Wayve CEO shares his key ingredients for scaling autonomous driving tech","url":"https://techcrunch.com/2025/03/21/wayve-ceo-shares-his-key-ingredients-for-scaling-autonomous-driving-tech/","date":1742570291,"author":"Rebecca Bellan","guid":272,"unread":true,"content":"<article>Wayve co-founder and CEO Alex Kendall sees promise in bringing his autonomous vehicle startup’s tech to market. That is, if Wayve sticks to its strategy of ensuring its automated driving software is cheap to run, hardware agnostic, and can be applied to advanced driver-assistance systems, robotaxis, and even robotics.&nbsp; The strategy, which Kendall laid out […]</article>","contentLength":366,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft is exploring a way to credit contributors to AI training data","url":"https://techcrunch.com/2025/03/21/microsoft-is-exploring-a-way-to-credit-contributors-to-ai-training-data/","date":1742570121,"author":"Kyle Wiggers","guid":271,"unread":true,"content":"<article>Microsoft is launching a research project to estimate the influence of specific training examples on the text, images, and other types of media that generative AI models create. That’s per a job listing dating back to December that was recently recirculated on LinkedIn. According to the listing, which seeks a research intern, the project will […]</article>","contentLength":352,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta spotted testing AI-generated comments on Instagram","url":"https://techcrunch.com/2025/03/21/meta-spotted-testing-ai-generated-comments-on-instagram/","date":1742569771,"author":"Aisha Malik","guid":270,"unread":true,"content":"<article>In recent years, Meta has introduced many AI features and capabilities to its apps, even going so far as experimenting with AI-generated characters complete with unique profiles and personalities, before scrapping them after they were deemed creepy and unnecessary. In yet another move that may not be received well among users, Meta wants to use […]</article>","contentLength":352,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Social Engagement Drove NFT Market Success in 2022","url":"https://hackernoon.com/how-social-engagement-drove-nft-market-success-in-2022?source=rss","date":1742569205,"author":"Ruslan Gromov","guid":316,"unread":true,"content":"<p>(1) SIMONE CASALE-BRUNET, École Polytechnique Fédérale de Lausanne, Switzerland;</p><p>(2) MIRKO ZICHICHI, Universidad Politécnica de Madrid, Spain;</p><p>(3) LEE HUTCHINSON, WhaleAnalytica.com, Switzerland;</p><p>(4) MARCO MATTAVELLI, École Polytechnique Fédérale de Lausanne, Switzerland;</p><p>(5) STEFANO FERRETTI, University of Urbino “Carlo Bo”, Italy.</p><p>4 Data Analysis and Results</p><p>The NFT phenomenon is a topic that became mainstream during 2021 and has continued to receive increasing attention from early 2022 to the present. This blockchain-based technology has also come to the forefront thanks to projects such as BAYCs whose images have been purchased by celebrities and traded at very high prices as reported by several media. In this paper, we analyzed the phenomenon of NFTs, focusing on the class related to PFPs. We chose 18 projects based on our knowledge in the field and based on their importance in terms of volumes traded, users, and social activity. It was illustrated through analysis of social activity how the concept of social community is essential to ensure liquidity and value of PFP projects, i.e., used as social icons. The centrality and influence of the community related to BAYCs was demonstrated, that despite being second to CryptoPunks in terms of volumes traded, social activity is much higher and central to every other project in the industry. This work aimed to lay the groundwork for more in-depth future studies on understanding whether patterns and causality conditions may exist between elements such as the number of tweets, average price of a collection, Twitter users, and Ethereum wallet.</p><p>[1] Oluwaseun Ajao, Jun Hong, and Weiru Liu. 2015. A survey of location inference techniques on Twitter. Journal of Information Science 41, 6 (2015), 855–864. https://doi.org/10.1177/0165551515602847</p><p>\\\n[2] Dune Analytics. 2022. rchen8: OpenSea Dashboard. Retrieved June 6, 2022 from https://dune.xyz/rchen8/opensea</p><p>\\\n[3] Joseph Bonneau, Jonathan Anderson, Ross Anderson, and Frank Stajano. 2009. Eight friends are enough: social graph approximation via public listings. In Proceedings of the Second ACM EuroSys Workshop on Social Network Systems. 13–18. https://doi.org/10.1145/1578002.1578005</p><p>\\\n[4] Evan Brinckman, Andrey Kuehlkamp, Jarek Nabrzyski, and Ian J. Taylor. 2019. Techniques and Applications for Crawling, Ingesting and Analyzing Blockchain Data. In 2019 International Conference on Information and Communication Technology Convergence (ICTC). IEEE, 717–722. https: //doi.org/10.1109/ICTC46691.2019.8939746</p><p>\\\n[5] Pinar Caglayan and Zehra Ozkan. 2021. NFTs and copyright: challenges and opportunities. Journal of Intellectual Property Law&amp; Practice 16, 10 (06 2021). https://doi.org/10.1093/jiplp/jpab104</p><p>\\\n[6] Umit Can and Bilal Alatas. 2019. A new direction in social network analysis: Online social network analysis problems and applications. Physica A: Statistical Mechanics and its Applications 535 (2019), 122372. https://doi.org/10.1016/j.physa.2019.122372</p><p>\\\n[7] Simone Casale-Brunet, Paolo Ribeca, Patrick Doyle, and Marco Mattavelli. 2021. Networks of Ethereum Non-Fungible Tokens: A Graph-Based Analysis of the ERC-721 Ecosystem. In IEEE Blockchain 2021, 06 - 08 December. https://doi.org/10.1109/Blockchain53845.2021.00033</p><p>\\\n[8] Joseph Coelho, Dawson D’almeida, Scott Coyne, Nathan Gilkerson, Katelyn Mills, and Praveen Madiraju. 2019. Social Media and Forecasting Stock Price Change. In 2019 IEEE 43rd Annual Computer Software and Applications Conference (COMPSAC), Vol. 2. 195–200. https://doi.org/10.1109/ COMPSAC.2019.10206</p><p>\\\n[9] CoinMarketCap. 2022. Ethereum historical data. Retrieved June 6, 2022 from https://coinmarketcap.com/currencies/ethereum/historical-data/</p><p>\\\n[10] Iain J Cruickshank and Kathleen M Carley. 2020. Characterizing communities of hashtag usage on twitter during the 2020 COVID-19 pandemic by multi-view clustering. Applied Network Science 5, 1 (2020), 1–40. https://doi.org/10.1007/s41109-020-00317-8</p><p>\\\n[11] Roberta De Michele, Stefano Ferretti, and Marco Furini. 2019. On helping broadcasters to promote tv-shows through hashtags. Multimedia Tools and Applications 78, 3 (2019), 3279–3296. https://doi.org/10.1007/s11042-018-6510-7</p><p>\\\n[12] Decrypt.co. 2022. Hot Ethereum NFT Platform LooksRare Is Rife With Wash Trading - And OK With It. Retrieved June 6, 2022 from https: //decrypt.co/90317/ethereum-nft-market-looksrare-wash-trading</p><p>\\\n[13] Joshua Fair!eld. 2021. Tokenized: The Law of Non-Fungible Tokens and Unique Digital Property. Indiana Law Journal, Forthcoming (04 2021).</p><p>\\\n[14] Stefano Ferretti, Marco Furini, and Manuela Montangero. 2019. Diabetes: What are italian twitter users talking about?. In 2019 28th International Conference on Computer Communication and Networks (ICCCN). IEEE, 1–6. https://doi.org/10.1109/ICCCN.2019.8847039</p><p>\\\n[15] Anastasia Giachanou and Fabio Crestani. 2016. Like it or not: A survey of twitter sentiment analysis methods. ACM Computing Surveys (CSUR) 49, 2 (2016), 1–41. https://doi.org/10.1145/2938640</p><p>\\\n[16] Google. 2022. BigQuery. Retrieved June 6, 2022 from https://cloud.google.com/bigquery/</p><p>\\\n[17] Shrey Jain, Camille Bruckmann, and Chase McDougall. 2022. NFT Appraisal Prediction: Utilizing Search Trends, Public Market Data, Linear Regression and Recurrent Neural Networks. arXiv preprint arXiv:2204.12932 (2022).</p><p>\\\n[18] Arnav Kapoor, Dipanwita Guhathakurta, Mehul Mathur, Rupanshu Yadav, Manish Gupta, and Ponnurungam Kumaraguru. 2022. Tweetboost: Influence of social media on nft valuation. arXiv preprint arXiv:2201.08373 (2022).</p><p>\\\n[19] OpenSea. 2022. OpenSea, the largest NFT marketplace. Retrieved June 6, 2022 from https://opensea.io/</p><p>\\\n[20] Daniel M Romero, Brendan Meeder, and Jon Kleinberg. 2011. Differences in the mechanics of information diffusion across topics: idioms, political hashtags, and complex contagion on twitter. In Proceedings of the 20th international conference on World wide web. 695–704. https: //doi.org/10.1145/1963405.1963503</p><p>\\\n[21] İlker Türker and Eyüb Ekmel Sulak. 2018. A multilayer network analysis of hashtags in twitter via co-occurrence and semantic links. International Journal of Modern Physics B 32, 04 (2018), 1850029. https://doi.org/10.1142/S0217979218500297</p><p>\\\n[22] Twitter. 2022. Search Tweets API. Retrieved June 6, 2022 from https://developer.twitter.com/en/docs/twitter-api/tweets/search/introduction</p><p>\\\n[23] Kishore Vasan, Milán Janosov, and Albert-László Barabási. 2022. Quantifying NFT-driven networks in crypto art. Scienti!c reports 12, 1 (2022), 1–11. [24] Shermin Voshmgir. 2020. Token Economy: How the Web3 reinvents the Internet. Vol. 2. Token Kitchen.</p><p>\\\n[25] Andi Wiliam, Sasmoko Sasmoko, Wibowo Kosasih, and Yasinta Indrianti. 2020. Sentiment analysis of social media engagement to purchasing intention. In Understanding Digital Industry. Routledge, 362–365. https://doi.org/10.1201/9780367814557-86</p><p>\\\n[26] Nick Yee, Jeremy N. Bailenson, and Nicolas Ducheneaut. 2009. The Proteus Effect: Implications of Transformed Digital Self Representation on Online and O&amp;ine Behavior. Communication Research 36, 2 (2009), 285–312. https://doi.org/10.1177/0093650208330254 arXiv:https://doi.org/10.1177/0093650208330254</p>","contentLength":7193,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Intel/AMD GPU Features, Apple Touch Bar Drivers & Other Likely Changes For Linux 6.15","url":"https://www.phoronix.com/news/Linux-6.15-Likely-Features","date":1742568720,"author":"Michael Larabel","guid":675,"unread":true,"content":"<article>With the Linux 6.14 stable kernel likely debuting on Sunday, the Linux 6.15 merge window will then open for kicking off the next development cycle. There's a lot of exciting changes and new features building up ahead of the Linux 6.15 merge window...</article>","contentLength":250,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"1X will test humanoid robots in ‘a few hundred’ homes in 2025","url":"https://techcrunch.com/2025/03/21/1x-will-test-humanoid-robots-in-a-few-hundred-homes-in-2025/","date":1742566500,"author":"Maxwell Zeff","guid":269,"unread":true,"content":"<article>Norwegian robotics startup 1X plans to start early tests of its humanoid robot, Neo Gamma, in “a few hundred to a few thousand” homes by the end of 2025, according to the company’s CEO, Bernt Børnich. “Neo Gamma is going into homes this year,” Børnich told TechCrunch in an interview at Nvidia GTC 2025. “We […]</article>","contentLength":327,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Raspberry Pi Announces rpi-image-gen To Help Craft Custom Software Images","url":"https://www.phoronix.com/news/Raspberry-Pi-rpi-image-gen","date":1742564741,"author":"Michael Larabel","guid":674,"unread":true,"content":"<article>Following a slew of hardware announcements in the past few months like the RP2350 shipping, Raspberry Pi 5 16GB, Raspberry Pi Monitor, and Raspberry Pi 500, today they have a new software announcement. Today they formally announced \"rpi-image-gen\" as a new tool to help customers in crafting customized software OS images...</article>","contentLength":324,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Commercial services platform BuildOps becomes a unicorn, raises $127M","url":"https://techcrunch.com/2025/03/21/commercial-services-platform-buildops-becomes-a-unicorn-raises-127m/","date":1742564700,"author":"Mary Ann Azevedo","guid":268,"unread":true,"content":"<article>Commercial services tech hasn’t historically been considered “sexy,” but the need for innovation in the space is enormous. That need has translated into a large fundraise for a company focused on streamlining commercial contracting processes. On Friday, BuildOps, which develops software for commercial services contractors, announced that it has raised $127 million in a Series […]</article>","contentLength":390,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Russian zero-day seller is offering up to $4 million for Telegram exploits","url":"https://techcrunch.com/2025/03/21/russian-zero-day-seller-is-offering-up-to-4-million-for-telegram-exploits/","date":1742562300,"author":"Lorenzo Franceschi-Bicchierai","guid":267,"unread":true,"content":"<article>Two sources in the zero-day industry say Operation Zero's prices for exploits against the popular messaging app Telegram will depend on different factors.</article>","contentLength":154,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Twitter Hashtags Drove NFT Trends and Engagement","url":"https://hackernoon.com/how-twitter-hashtags-drove-nft-trends-and-engagement?source=rss","date":1742562009,"author":"Ruslan Gromov","guid":315,"unread":true,"content":"<p>(1) SIMONE CASALE-BRUNET, École Polytechnique Fédérale de Lausanne, Switzerland;</p><p>(2) MIRKO ZICHICHI, Universidad Politécnica de Madrid, Spain;</p><p>(3) LEE HUTCHINSON, WhaleAnalytica.com, Switzerland;</p><p>(4) MARCO MATTAVELLI, École Polytechnique Fédérale de Lausanne, Switzerland;</p><p>(5) STEFANO FERRETTI, University of Urbino “Carlo Bo”, Italy.</p><p>4 Data Analysis and Results</p><p>As a further point of analysis, we focused on hashtags and how they are used in tweets. The hashtags - that are words preceded by the # symbol such as #NFT - are in fact the most common method used by Twitter users to create</p><p>\\\nspecific groups and streams of communication. We identified 60,060 different hashtags and thus constructed a weighted undirected graph where: each node represents a hashtag and each connection between two nodes represents the presence of a tweet in which both corresponding hashtags were used. As the weight of each node was assigned the number of tweets in which the corresponding hashtag was present, and as the weights of each connection the number of tweets having the two corresponding hashtags in common. Figure 6a illustrates in descending order which are the 20 most used hashtags: NFT, cryptopunks, and BAYC are the most significant ones. Beyond the 20th, namely art, the weights are much lower. Overall, the properties of the graph thus formed are shown in Table 3a: the graph consists of 762,950 connections, with an average weight of about 29,634 common tweets. The average clustering coefficient and the relatively significant number of connected components (that is 439) suggest the presence of highly specialized communities within this content graph. However, edge density is extremely low in this case, being hashtags mainly connected with some central hashtags (see below). Most likely for this reason, modularity has a low value. While</p><p>\\\nFigure 6b illustrates in descending order which are the 20 hashtags with highest pagerank. Again, the values beyond the 20-th (famorie, related to the CryptoMories) the weight is much lower. Figure 4b illustrates the graph taking into account only these 20 hashtags, where the size of the nodes is proportional to the pagerank: again, as can be observed, the hashtags NFT, cryptopunks and BAYC are the most in\"uential. We also performed a commonality analysis for the hashtags: this was summarized in Table 3c. As can be observed, the NFT hashtag is the one that is most common to all. The hashtags nftart, nftartist, and nftcollection are neither close to cryptopunks nor BAYC: this indicates how for more generic topics, and not only related to PFP, the discourses are less polarized on cryptopunks and BAYC.</p><p>Figure 7 shows trends in volume, average price, tweets, and users (wallets and Twitter accounts) for a number of very different projects from the date of creation until April 14, 2022. BAYC, CryptoHodlers, Mekaverse, and mfers were considered. As can be seen, the BAYC built up a continuous engagement on Twitter where within a year the number of unique users talking about them grew exponentially, as did the average price, which went from 0.08ETH to more than 100ETH in less than a year. There are projects, such as CryptoHodlers, on the other hand, where although the creators try to build an ecosystem around their project by distributing comics or developing a new reserved NFT, the community has not grown, impacting the average price and liquidity (in terms of daily trades) of this project. Mekaverse and mfers, summarize these concepts: for the former we see how a high number of tweets in the early stages of the project resulted in an initial high exchange value where the figurines traded for a minimum price of 8ETH, then went to 10 times less as the number of tweets dropped. For the latter, on the other hand, we see that engagement in terms of daily tweets coincides with an increase in average price, and this occurs gradually and constantly after their release.</p>","contentLength":3939,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AlexNet Source Code Is Now Open Source","url":"https://spectrum.ieee.org/alexnet-source-code","date":1742562003,"author":"Hansen Hsu","guid":86,"unread":true,"content":"<p>First released in 2012, AlexNet sparked a revolution in AI and computer vision</p>","contentLength":78,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81ODM2NzgzOC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4OTUyOTc1Nn0.OQfBJOPQ7LvjN2mFru5XJOFO88BJTwYUvGspfN81dtA/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Sees Last Minute Fix For A Two Year Old Regression Causing A 30% Performance Drop","url":"https://www.phoronix.com/news/Linux-6.14-Sched-2-Year-Regress","date":1742562000,"author":"Michael Larabel","guid":673,"unread":true,"content":"<article>Submitted today ahead of the Linux 6.14 stable release expected Sunday is a lone scheduler fix for the kernel. This patch is for reverting a change made to the Linux kernel two years ago that ended up regressing some workloads with a significant performance hit...</article>","contentLength":264,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AMD Announces Open-Source \"GAIA\" For GenAI But Currently Windows-Only","url":"https://www.phoronix.com/news/AMD-GAIA-Open-Source","date":1742560200,"author":"Michael Larabel","guid":672,"unread":true,"content":"<article>AMD on Thursday announced GAIA for \"Generative AI Is Awesome\" as a means of easily running local large language models (LLMs) on Ryzen AI PCs with the XDNA NPU. GAIA provides an easy software demonstration for Ryzen AI capabilities but sadly for the moment is limited to Microsoft Windows platforms...</article>","contentLength":301,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google claims news is worthless to its ad business after test involving 1% of search results in eight EU markets","url":"https://techcrunch.com/2025/03/21/google-claims-news-is-worthless-to-its-ad-business-after-test-involving-1-of-search-results-in-eight-eu-markets/","date":1742556973,"author":"Natasha Lomas","guid":266,"unread":true,"content":"<article>Google has reported the results of an experiment it ran which removed news from search results for 1% of users for 2.5 months in eight* markets in Europe — claiming the results show that news is essentially worthless to Google’s ad business. The search giant conducted the test because European copyright law requires it to […]</article>","contentLength":333,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ASUS ROG Flow Z13 Improvements For Linux, RGB Controls For The ROG Ally","url":"https://www.phoronix.com/news/ASUS-Z13-ROG-Ally-RGB","date":1742554013,"author":"Michael Larabel","guid":671,"unread":true,"content":"<article>A set of eleven patches being worked on for the ASUS HID and platform drivers work to enhance the support for the AMD Strix Halo powered ROG Flow Z13 (2025) laptop as well as adding RGB control support for the ROG Ally gaming handheld...</article>","contentLength":237,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dynamic EPP & Raw EPP Features Coming To AMD P-State Driver","url":"https://www.phoronix.com/news/AMD-P-State-Raw-EPP-Dynamic","date":1742552920,"author":"Michael Larabel","guid":670,"unread":true,"content":"<article>The AMD P-State Linux kernel driver for CPU frequency scaling with modern Ryzen processors has been working out quite well and proving very effective over the prior ACPI CPUFreq generic driver use. Beyond recently being extended to becoming the default for EPYC 9005 \"Turin\" processors, AMD P-State has recently been seeing some patches for additional feature work...</article>","contentLength":367,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Vulkan 1.4.311 Released With New Extension For BFloat16","url":"https://www.phoronix.com/news/Vulkan-1.4.311-Released","date":1742550936,"author":"Michael Larabel","guid":669,"unread":true,"content":"<article>The Vulkan 1.4.311 specification update is out today with a handful of issues resolved with various clarifications and other subtle refinements. Plus two new extensions...</article>","contentLength":171,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Updates Advanced Performance Extensions \"APX\" Code For The Linux Kernel","url":"https://www.phoronix.com/news/Intel-APX-Update-Linux-Kernel","date":1742518774,"author":"Michael Larabel","guid":668,"unread":true,"content":"<article>In addition to Intel software engineers this week being busy doing a late restructuring of AVX10 support in moving away from possible 256-bit maximum vector register size (a great move and still so excited to see this materialize!), there are also Intel engineers continuing work on enabling Advanced Performance Extensions (APX) on the Linux kernel side...</article>","contentLength":357,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"InZoi Early Access Review - Pretty Vacant","url":"https://www.gamespot.com/reviews/inzoi-early-access-review-pretty-vacant/1900-6418345/?ftag=CAD-01-10abi2f","date":1742505720,"author":"Jessica Cogswell","guid":638,"unread":true,"content":"<p>Reviewing InZoi without mentioning The Sims, which is easily its most direct influence, comparison, and competitor is, quite simply, a fool's errand. There was a part of me--a very naive part, mind you--that thought it might be a bit fun to see how long I could go without making mention of the game in this review as a sort of challenge for myself. Clearly, I have already failed.</p><p dir=\"ltr\">However, the context in which InZoi exists matters. Whereas the world is filled with cozy games, life sims, and plenty of other titles that reside somewhere between the two, extremely few play quite like The Sims. It goes without saying that Maxis created something extremely special back in 2000--something so creative, charming, innovative, and intricately designed that seemingly no other game studio has even attempted to put an end to its quarter-century long reign over the life-sim genre. There is no denying that the franchise's reputation has taken some hits over the years, primarily due to its perceived stagnation and parent company EA's predatory monetization tactics. As this discontent has grown, so too has the number of people looking for a viable competitor. And now, thanks to InZoi, we have a fresh-faced and utterly gorgeous new challenger.</p><p dir=\"ltr\">Considering its good looks were among the first of many things that made InZoi such a highly anticipated title, I'll start by saying that it is just as mind-blowing to look at as it seems. From its UI to its city streets to its pouty-lipped, pop star-esque characters, everything about InZoi is visually remarkable. Vast amounts of customization options, an immersive and ever-changing open world, and an intense focus on making things feel true-to-life yet just more grand further polish this gem. And I was relieved that, despite all its luster, the game ran perfectly fine on my less-than-great gaming PC (AMD Ryzen 5 3600/NVIDIA GeForce GTX 1660 Super). And yet, I was ultimately forced to reckon with the fact that, in my 20 or so hours with InZoi, I missed out on something incredibly important: having fun. Though InZoi is impressive, immersive, and brimming with potential, in its current state there is a sterility and lifelessness that is hard to move past. This paired with stale gameplay ultimately made InZoi a game I desperately to enjoy, but seldom did.</p><a href=\"https://www.gamespot.com/reviews/inzoi-early-access-review-pretty-vacant/1900-6418345/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>","contentLength":2338,"flags":null,"enclosureUrl":"https://www.gamespot.com/a/uploads/screen_medium/1639/16394322/4462597-ce843498-3592-4518-8720-c3143e1595cd.jpg","enclosureMime":"","commentsUrl":null},{"title":"The Most Interesting Linux 6.14 Features From NTSYNC To AMD Ryzen AI & Rust Abstractions","url":"https://www.phoronix.com/news/Linux-6.14-Features-Reminder","date":1742502490,"author":"Michael Larabel","guid":667,"unread":true,"content":"<article>Barring any last minute issues or hesitation by Linus Torvalds, the Linux 6.14 kernel is aiming for releasing as stable this coming Sunday on 23 March. Here's a reminder about some of the most interesting changes to find with Linux 6.14...</article>","contentLength":239,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}