{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"1 Million People Gathered in Istanbul against Erdogan According to CHP!","url":"https://www.reddit.com/r/europe/comments/1jhfxee/1_million_people_gathered_in_istanbul_against/","date":1742670213,"author":"/u/subasie","guid":621,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Police increases use of force as protests continue in Turkey","url":"https://www.reddit.com/r/europe/comments/1jh7inr/police_increases_use_of_force_as_protests/","date":1742647126,"author":"/u/GMNtg128","guid":620,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cities participating in protests in Türkiye at the moment(third day)","url":"https://www.reddit.com/r/europe/comments/1jh5res/cities_participating_in_protests_in_t%C3%BCrkiye_at/","date":1742640450,"author":"/u/quezwy","guid":625,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In Hamburg","url":"https://www.reddit.com/r/europe/comments/1jh587i/in_hamburg/","date":1742638139,"author":"/u/KipferlAG","guid":629,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Russian agents used risqué pics to blackmail teenager into terror act","url":"https://tvpworld.com/85735175/russian-agents-used-risqu-pics-to-blackmail-a-ukrainian-schoolgirl-into-terror-act","date":1742636444,"author":"/u/SPXQuantAlgo","guid":623,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jh4uf8/russian_agents_used_risqu%C3%A9_pics_to_blackmail/"},{"title":"Exposed: The ‘Stop Zelensky’ protesters sowing Russian disinfo across Europe","url":"https://kyivindependent.com/who-is-behind-pro-russian-stop-zelensky-demonstrations-in-europe/","date":1742635011,"author":"/u/yorkiecd","guid":626,"unread":true,"content":"<p>On a Sunday afternoon in mid-February, a small but politically charged event took place in the heart of Amsterdam.</p><p>A group of eight people gathered for a photo-op protest on the city’s Dam Square holding placards that called for an end to Western arms deliveries to Ukraine and the <a href=\"https://kyivindependent.com/poroshenko-attacks-zelensky-over-sanctions-says-ukraine-must-go-on-defensive/\">removal of President Volodymyr Zelensky</a>.</p><p>The event was part of an international campaign that stages small protests in several countries to advocate for elections in Ukraine, its organizers wrote on Facebook. Martial law imposed in Ukraine at the outset of Russia’s full-scale invasion prohibits the country from <a href=\"https://kyivindependent.com/a-beginners-guide-to-elections-in-ukraine-also-suitable-for-us-presidents/\">holding elections</a>.</p><p>The Dutch community page that called on people to participate in the protest claimed the event was “coordinated by <a href=\"https://kyivindependent.com/tag/ukrainian-refugees/\">Ukrainian refugees</a>.” Strangely enough, it appears there were no Ukrainians at the gathering.</p><p>Of the eight demonstrators who showed up in Amsterdam, five were Dutch and two were Russian. The identity of one remains unverified by the Kyiv Independent.</p><p>Without attracting much attention on the streets, participants quietly unfolded their placards bearing blunt and provocative messages: “Ukraine is evil for Dutch taxpayers” and “Zelensky! Stop killing your people!” Another read “Sponsoring Kiev is sponsoring terrorism against Ukrainians,” using the Russian spelling for <a href=\"https://kyivindependent.com/kyiv-not-kiev-how-ukrainians-reclaimed-their-capital-and-their-future/\">Ukraine’s capital city Kyiv</a>. </p><p>No Ukrainian flags were seen at the protest, despite the organizers’ claim that Ukrainians had coordinated the event. The only country flag present was Russian, with the words “Peace with Russia” written on it.</p><p>Protesters took turns posing with different posters. The messages on the posters warned of war between NATO and Russia, calling for a Ukraine without Zelensky, <a href=\"https://kyivindependent.com/tag/volodymyr-zelensky/\">blaming Zelensky</a> for Russia’s full-scale invasion, and demanding the end of “<a href=\"https://kyivindependent.com/ukraine-is-failing-the-mobilization-test/\">forced mobilization</a>” in Ukraine.</p><p>While a small event, the gathering was part of a larger anti-Ukraine movement posing as a peace initiative that has been ongoing for over two years.</p><h2><code>Network of Dutch Russians</code></h2><p>After the onset of Russia’s full-scale invasion, a group of Dutch activists took to the streets in response to what they perceived as the establishment and media inciting warmongering and hatred toward Russia. Since February 2023, the group, which operates under the name “Vredesdemonstratie” meaning “Peace Demonstration” in Dutch, has been holding monthly protests. </p><p>At these events, demonstrators advocate for ending military aid for Ukraine — who they blame for the war along with NATO — and making peace with Russia. Their banners usually feature phrases such as “No weapons for peace” or “Peace with Russia” in both Dutch and English. </p><p>The foreign military aid, including assistance from <a href=\"https://kyivindependent.com/tag/the-netherlands/\">the Netherlands</a>, which the group so passionately opposes, has been critical to Ukraine’s ability to defend itself from Russia’s invasion. </p><p>Among individual countries, the Netherlands ranks fifth in total military aid, contributing 5.88 billion euros between Jan. 24, 2022, and Dec. 31, 2024, according to the Kiel Institute for the World Economy, which tracks aid to Ukraine. </p><p>Although they present themselves as a movement of “pacifist idealists,” members of Peace Demonstration make their demands solely of Ukraine and its supporters, and never of Russia.</p><p>The reason for this approach becomes clear as soon as one looks at the composition of the participants: many of the most active protesters at these rallies are Dutch Russians — migrants of Russian origin who settled in the Netherlands long ago. Some have lived in the Netherlands for over 20 years. </p><p>The group’s demonstrations often feature Russian flags and sometimes include cultural performances, such as singing traditional songs, dancing, and wearing traditional attire.</p><p>Despite their clear ties to Russian culture, the protesters never identify as being members of the Russian diaspora. It appears that they purposefully keep the origin of the protests blurry, trying to pass the events as Dutch or Ukrainian. </p><p>Among those posing with a Russian flag in a recent photo-op protest was Natalia Vorontsova, also known as Nata Heezen. As a co-organizer, she is a key figure in nearly every Peace Demonstration event.</p><p>Originally from Russia’s southwestern city of Voronezh, Vorontsova has lived in the Netherlands for over 20 years. She works as a nurse in mental health care.</p><p>Alongside fellow activists Nikita Ananjev and Elena Plotnikova, she has been lobbying for Russian interests in the Netherlands since 2014, the year when Russia invaded Ukraine’s Crimea and the eastern part of Ukraine’s Donetsk and Luhansk oblasts.</p><div data-card-state=\"kg-card-expanded\"><div><h4>Campaigning in the Netherlands</h4></div><div><p>In 2016, Vorontsova joined a campaign organized by the Dutch Socialist Party that brought together a group of Russians and Ukrainians with pro-Russian views to advocate against Ukraine’s European integration in a Dutch referendum.</p><p>Despite a low turnout of 32.2%, Dutch voters rejected the EU-Ukraine Association Agreement. The vote was non-binding and did not overturn the agreement, which had already been ratified by the other 27 EU member states.</p><p>Alongside Vorontsova, two other prominent campaigners were Nikita Ananjev — a Russian who formerly chaired the Russian Student Association in the Netherlands — and Elena Plotnikova, who describes herself on X as a “Russian from Donetsk,” a Ukrainian city that has been under occupation since 2014. </p><p>Three years later, in 2019, all three were involved in another organization — the Dutch branch of the Global Rights of Peaceful People (GRPP) international platform, which has advocated for Russian-controlled forces in eastern Ukraine. Ananjev is introduced in one of the platform’s videos as the president of the Dutch Committee of GRPP, while Plotnikova managed the organization’s email correspondence. The GRPP is deregistered from the Dutch Chamber of Commerce. It is not known why its registration was canceled. </p><p>GRPP organized a press conference aimed at discrediting an official investigation conducted by the Joint Investigation Team (JIT) into the downing of Malaysia Airlines Flight MH17 in eastern Ukraine. According to the JIT’s conclusions, Russia's military delivered a Buk missile fired by Russian-controlled militants in July 2014, killing all 298 people on board, including 196 Dutch citizens.</p><p>At the press conference, where Vorontsova served as host, a documentary by a former Russia Today journalist Yana Yerlashova and a Dutch blogger Max van der Werff was presented. The film seeks to discredit the official MH17 investigation and deny Russia’s responsibility for the plane’s downing.</p><p>The film’s creators are best known for their involvement with Bonanza Media, a project widely regarded as part of the Kremlin’s disinformation efforts. </p><p>A joint investigation by Bellingcat and The Insider revealed evidence that Bonanza Media coordinated with Russia’s military intelligence service (known by its Russian acronym GRU) to downplay Russia’s involvement in the MH17 downing. Investigators also discovered that Plotnikova was involved with Bonanza Media.</p></div></div><p>Today, it appears, Vorontsova’s main focus is solely on co-organizing Peace Demonstration events in the Netherlands where she’s one of the key faces and voices heard.</p><p>She maintains close ties with Russian state media, including TASS and RIA Novosti, whose correspondents often attend the demonstrations and interview Vorontsova for their articles. The published materials are later reshared by Vorontsova in the online groups for protest participants. While their demonstrations attract little attention from the Dutch media, they receive extensive coverage in Russia, making them seem like a large-scale movement.</p><p>Meanwhile, Plotnikova remains active primarily on social media and within the Peace Demonstration community. In 2023, she delivered a speech at one of the demonstrations.</p><p>Embracing conspiratorial narratives about “NATO missiles killing civilians,” Vorontsova’s demonstrations attract individuals from both far-left and far-right populist circles, united by their pro-Russian sentiment. The pool of guest speakers ranges from communists in anti-fascist movements to MPs from the Dutch far-right party Forum for Democracy (FvD).</p><p>An investigation by the Dutch newspaper NRC <a href=\"https://www.nrc.nl/nieuws/2023/10/23/demonstreren-voor-vrede-met-steun-uit-rusland-a4178281\">found</a> that Vorontsova may have received funding for her activities from Volunteers of Victory — a Russian government-funded organization that glorifies Russian military patriotism during World War II and supports Russian soldiers fighting in Ukraine. Despite Volunteers of Victory being sanctioned by the EU, its Dutch branch Victory Team 75 Netherlands remains active by operating unofficially and avoiding formal registration.</p><p>In a conversation with the Kyiv Independent, Vorontsova denied any involvement with the Dutch branch of Volunteers of Victory, stating that she had only worn a cap with the organization’s logo that she received as a gift, but had no connection to the group. She also emphasized that she is an independent activist, acts on her own, and is not financially supported by anyone. According to Vorontsova, she finances the demonstrations with donations from supporters.</p><p>Another participant of the February photo shoot in Amsterdam, Iolanta DuCroix, also known as Klimaite Bardash, appears in several photos on the Instagram page of the local branch of Volunteers of Victory. A Russian-born resident of the Netherlands, DuCroix assisted Vorontsova in holding a Russian flag during the photo shoot.</p><p>Another participant, Nikita Ananjev, is also a prominent figure in the Russian Volunteers of Victory movement. Known as a coordinator of the Dutch branch, he seems to be present at nearly every one of the organization’s events. He was also a representative of the Coordination Council of Russian Compatriots in the Netherlands, an organization that works closely with the Russian embassy.</p><p>After Russia’s full-scale invasion, Ananjev openly expressed pro-Putin views. On his page on Vkontakte — a Russian social media platform — he reposted an image stating: \"Kyiv will either be Russian or deserted. And we're fine with it being deserted too.\"</p><p>When asked about her cooperation with Ananjev, given his active involvement with organizations affiliated with Russia, Vorontsova told the Kyiv Independent that she has not seen Ananjev in years nor collaborated with him on any activities since they were both part of the Dutch branch of the International Platform Global Rights of Peaceful People (GRPP).</p><h2><code>A Ukrainian defector and a Soviet-era emigrant</code></h2><p>Although Peace Demonstration’s messaging appears to reflect Russian interests, its members claim that Ukrainians are also among their representatives.</p><p>After analyzing dozens of participants in the group’s demonstrations, the Kyiv Independent found only one Ukrainian who actually spoke in person at their protests. The group’s website and social media present the supposed Ukrainian representative as “Elena from Kiev,” using the Russian spelling for both her name and Ukraine’s capital. </p><p>In reality, “Elena from Kiev” has not lived in Ukraine since the 1990s, having spent several years in Afghanistan before settling in the Netherlands, according to an interview she gave to AlternatiefTV in August 2023. Her experience of Ukraine is limited to the Soviet era. </p><p>Like other participants in the rallies, Elena’s views, as she expressed them in the interview with Alternatief TV, align with a line of Kremlin propaganda that insists Ukrainians and Russians are \"the same people.” This view is widely rejected in Ukraine. A <a href=\"https://ratinggroup.ua/research/ukraine/vosmoy_obschenacionalnyy_opros_ukraina_v_usloviyah_voyny_6_aprelya_2022.html\">2022 poll</a> found that 91% of Ukrainians do not consider Russia and Ukraine to be “one people.”</p><p>Two other Ukrainians appeared at the demonstrations via video message, supposedly from Russia. One of them, Dmitry Vasilets, is a pro-Kremlin propaganda blogger. In 2024, he was <a href=\"https://reyestr.court.gov.ua/Review/123267497\">sentenced</a> in absentia by a Ukrainian court to five years in prison for justifying Russia's aggression against Ukraine, as well as advocating for a violent overthrow of the government.</p><p>Vasilet’s criminal record dates back to 2017 when he was convicted of facilitating the broadcast of a Russian propaganda channel in Russian-occupied parts of eastern Ukraine. He spent two years in a pre-trial detention center in Ukraine.</p><p>According to Ukrainian law enforcement, eleven days before Russia's full-scale invasion, he fled Ukraine for Egypt and later settled in Moscow, where he declared himself the secretary of the so-called “Representative Office of the Ukrainian People” — a body not recognized by Ukraine.</p><p>At Vorontsova’s demonstrations, Vasilets appears on the LED screen, calling himself a leader of the Ukrainian party Derzhava in exile. However, Derzhava was banned in Ukraine in 2022 due to its ties to Russia and was so unpopular that it never gained parliamentary representation. During its only attempt to get into parliament in 2006 as part of the \"State-Labor Union\" bloc, it earned just 0.14% of the vote.</p><p>Moreover, the Peace Demonstration group also claimed to have Ukrainian independent press at one of their press conferences but did not specify which outlet. The Kyiv Independent found only one non-Dutch media platform covering the event — Vasilets’ pro-Russian Telegram channel, Mriya. </p><p>The biography of the second Ukrainian, who participated virtually in events organized by Peace Demonstrations in the Netherlands, is no less vivid and far from Ukraine.</p><p>Judging by the social media posts of Peace Demonstration the international pro-Russian photo shoots appear to be coordinated by another Moscow-based organization, the Union of Political Emigrants and Political Prisoners of Ukraine.</p><p>Its spokesperson, Leonid Ilderkin, is mentioned in posts related to a previous international pro-Russian campaign that features almost identical scripted messages promoting anti-NATO and anti-Zelensky messages.</p><p>Ilderkin appeared in a video message for Peace Demonstrations as a so-called “Ukrainian opposition figure in exile.” In the video, he blames the U.S. and Europe for Russia’s full-scale invasion of Ukraine.</p><p>A native of Dnipro, Ukraine, Ilderkin was previously an activist in the pro-Russian communist organization Borotba, meaning “struggle” in Ukrainian. When Russia invaded Ukraine in 2014, Borotba members supported the occupation of eastern Ukraine, with some even taking up arms on the Russian side. After fleeing Ukraine that same year, the group now operates from Russia and recently participated in an event titled the International Anti-fascist Forum in Russian-occupied Luhansk Oblast. </p><p>According to documents obtained by the independent Russian anti-corruption project Dossier Center, Russia's military intelligence agency (known by its Russian acronym GRU) attempted to use organizations linked to Ilderkin to coordinate with the European radical left and recruit individuals for protests and acts of sabotage. The Kyiv Independent could not independently verify this information.</p><p>The Union of Political Emigrants and Political Prisoners of Ukraine, which has been given a platform by Dutch demonstrations, consists of pro-Russian fugitives.</p><p>Among them is Mykola Azarov, Ukraine’s former prime minister under Kremlin-backed President Viktor Yanukovych, who was ousted following the EuroMaidan Revolution in 2014. Azarov participated in a meeting organized by the Union of Political Emigrants in late 2016.</p><h2><code>Russian demonstration network in Europe</code></h2><p>Although the Union of Political Emigrants and Political Prisoners of Ukraine has little media presence and minimal influence on social media, it supports other pro-Russian demonstrations beyond the Netherlands.</p><p>For instance, a so-called “Ukrainian political prisoner” from the union addressed pro-Russian demonstrators in the U.K. online from Moscow in August 2024. The “political prisoner” in the video address is the Union’s chairwoman, Larisa Shesler. She is wanted by Ukrainian law enforcement for “undermining Ukraine’s territorial integrity.” &nbsp;</p><p>Shesler, a Ukrainian, played a key role in undermining pro-European protests in the Ukrainian city of Mykolaiv in 2013-2014. She coordinated the local anti-protest movement and organized pro-Russian rallies before eventually fleeing to Russia.</p><p>The Kyiv Independent found out and verified that she had obtained Russian citizenship.</p><p>Shesler’s video message to the British pro-Russian demonstrations was picked up and promoted by Theo Russell from the U.K.-based International Ukraine Anti-Fascist Solidarity movement. Russell, a British activist, is also involved in the Dutch organization Peace Demonstration, having spoken at events and frequently posted in community groups.</p><p>Meanwhile, the YouTube channel Chega Serna English, which has been sharing videos of “Ukrainian political prisoners,” posts footage from pro-Russian rallies in cities like Washington, D.C., Sacramento, Paris, and notably Amsterdam. </p><p>The footage reveals a recurring pattern — consistent messaging, tone, and symbols, including Soviet and Russian flags. A unifying theme runs through these rallies: a push to end military aid to Ukraine, a critical lifeline for its defense. This mirrors what was seen in Amsterdam.</p><p>Russian influence in Europe remains strong, backed by a vast network of pro-Kremlin actors, some of whom are hiding behind Ukrainian names.</p><p><em>Hi, I’m Linda Hourani, the author of this story. Thanks for reading! </em></p><p><em>I hope this piece serves as a reminder that, in times when Russian disinformation is strong, it is crucial to stay critical and not be misled. If you’d like to help us produce more investigative reports like this, please consider .</em></p>","contentLength":17656,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jh4j3z/exposed_the_stop_zelensky_protesters_sowing/"},{"title":"Students in Turkey hiding behind a trash container from the police spraying them with freezing water and pepper spray. The police is getting more violent as protests are growing each day, with university students now having decided to boycott classes and ''freeze life'' Monday onwards.","url":"https://www.reddit.com/r/europe/comments/1jh1o5x/students_in_turkey_hiding_behind_a_trash/","date":1742622271,"author":"/u/jinjja11","guid":627,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"UK","url":"https://www.reddit.com/r/europe/comments/1jh0pzq/uk/","date":1742618576,"author":"/u/KipferlAG","guid":622,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A protester in Turkey reading Rousseau's The Social Contract in front of police water cannons","url":"https://www.reddit.com/r/europe/comments/1jgva1w/a_protester_in_turkey_reading_rousseaus_the/","date":1742601262,"author":"/u/Background-Oil-9203","guid":624,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Turkish woman from the protests against Erdogan: 'We are the youth that Ataturk trusted. How will you defeat us?'","url":"https://www.reddit.com/r/europe/comments/1jgs3jx/a_turkish_woman_from_the_protests_against_erdogan/","date":1742592583,"author":"/u/subasie","guid":628,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["news","reddit"]}