{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"US special envoy to Russia praises Putin, says he‘s „not a bad person“","url":"https://www.kyivpost.com/post/49395","date":1742660702,"author":"/u/CourageGlum7853","guid":611,"unread":true,"content":"<section entry=\"92905\"><p>Interviewed by Tucker Carlson for his <a href=\"https://www.youtube.com/watch?v=acvu2LBumGo&amp;t=3276s\">YouTube show</a>, <a href=\"https://www.kyivpost.com/topic/witkoff\">Steve Witkoff</a>, Donald Trump’s special envoy, spoke in barely concealed admiration of Russian President <a href=\"https://www.kyivpost.com/topic/putin\">Vladimir Putin</a> following their meetings in Moscow. His positive view of the Kremlin’s leader was only matched by Carlson’s description of Witkoff as “the most effective American diplomat in a generation.”</p><p>Talking about his two meetings with Putin on Feb. 11 and March 13, Witkoff said “I liked him. I think he was honest with me.”</p><p>Carlson said that assessment was shared by “all the presidents in the world” including Joe Biden: “They may not agree with what Russia is doing, but they say: ‘You know, Putin is an open person,’” Carlson said.</p><p>Witkoff, in response to criticism of the bilateral meetings with Russia, said that as the “president’s emissary” he had been tasked with attempts to restore [US-Russian] relations and to start productive discussion on “how to end this conflict.”</p></section><section entry=\"92906\"><div><figure><blockquote><p>It's a complicated situation, this war, and all the components that led to it. You know, it's never just one person who's right.</p></blockquote></figure></div></section><section entry=\"92907\"><p>He said that Putin had criticized the Biden administration’s refusal to enter in dialogue. “President Putin said to me at our first meeting: ‘How do we resolve a conflict with the head of a major nuclear power if we don’t establish trust and good relations with each other? … I haven’t spoken to Joe Biden in three and a half years’,” Witkoff said.</p><p>He summed up his meetings with Putin as the first steps in what will become “a good, healthy conversation” between the two countries saying: “President Putin, to his credit, has sent every signal to President Trump that this is the path he wants to take.”</p><p>In addition to describing Putin as “not a bad person,” Witkoff said: “It’s a complicated situation, this war, and all the components that led to it. You know, it’s never just one person who’s right.”</p><p>Witkoff added that after the July 13 assassination attempt against Trump, Putin went to church and prayed for him: “… not because he could be the president of the United States, but because they had a friendship, and he prayed for his friend.” He added telling Trump of this, “He [Trump] was clearly touched.”</p></section><section entry=\"92908\"><div><figure><blockquote><p>If there is a peace agreement between Ukraine and Russia the consensus is that Ukraine cannot be a member of NATO.</p></blockquote></figure></div></section><section entry=\"92909\"><p>In speaking about the situation on the battlefield Witkoff repeated the contentions that Ukrainian troops have been surrounded in Russia’s Kursk region – despite the claim being contradicted by the Ukrainian authorities, independent experts, and even US intelligence assessments.</p><p>He added that Putin told him Kursk wasn’t the only instance where his troops had surrounded and isolated Kyiv’s forces.</p><p>“President Putin told me that: ‘… the Ukrainians have people trapped there [Kursk]’... he then asked: ‘What should I do in this or that area where we have people surrounded and they don’t want to surrender? Should I kill them? How can I make them surrender? I’m happy not to kill everyone. I’m happy to make people wave a white flag if I can make them.’”</p><p>Asked about Ukraine’s aspiration to join NATO (and Moscow’s declaration this would be an unacceptable red line) or failing that to at least be offered “Article 5 protection,” Witkoff said:</p><p>“I think [Ukraine’s president] Zelensky and his right-hand man Yermak, have pretty much accepted that Ukraine will not become a member of NATO. There has been a lot of talk about whether they could have Article 5 protection… from the US or from European countries without being a member of NATO? I think that’s open to debate… but… If there is a peace agreement between Ukraine and Russia the consensus is that Ukraine cannot be a member of NATO.”</p></section><section entry=\"92910\"><div><figure><blockquote><p>If the world recognizes these [five regions] as Russian territories, will this end [the war] and will Zelensky survive politically if he recognizes this?</p></blockquote></figure></div></section><section entry=\"92911\"><p>Asked by Carlson about European fears that if Russia “wins” in Ukraine Putin would “want to march on Europe,” Witkoff simply replied “100% no.” He then went further saying he didn’t believe Moscow wanted to “absorb” the whole of Ukraine:</p><p>“… The Russians have what they want: They got back these five regions. They have Crimea. They got what they wanted. So what else do they want?” He then went on to say that the main ongoing problem to resolving the war is the issue of [the occupied] territories.</p><p>In another echo of the Kremlin propaganda line Witkoff said that the “Russian speaking residents” of these regions [Crimea, <a href=\"https://www.kyivpost.com/topic/donbas\">Luhansk, Donetsk</a>, Zaporizhzhia and Kherson] had overwhelmingly indicated they wanted to be part of the Russian Federation in referendums – a process that most of the world thinks were not only illegal but were held under occupation, subject to coercion (sometimes at gunpoint) and falsification in the absence of independent observers.</p><p>He then mentioned, what he called “the elephant in the room” - Ukrainian constitutional issues that prevented the ceding of territories despite being under de facto Russian control and then asked the question: “If the world recognizes these [five regions] as Russian territories, will this end [the war] and will Zelensky survive politically if he recognizes this?”</p><p>Needless to say, international media and analysts expressed concern (in the case of <a href=\"https://newsukraine.rbc.ua/news/witkoff-sparks-controversy-with-statement-1742632966.html\">Ukrainian media</a> outrage) that Witkoff’s commentary seemed to spout almost verbatim Putin’s avowed red lines for peace, was filled with half-truths and reiterated many of “Moscow’s lies.”</p><p>In particular, his assertion that the remaining obstacle to peace was the future of (and Kyiv’s agreement to give up) the occupied territories. He seemed to suggest that these should remain as part of Russia, including by implication, those parts of the contested regions that remain under Ukrainian control. In general, comments on Ukrainian social media expressed fears for the country’s future as the US continues to “hand over the keys to the kingdom” before negotiations proper have even started.</p></section>","contentLength":6115,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jhc9u3/us_special_envoy_to_russia_praises_putin_says_hes/"},{"title":"China is considering deploying a contingent to Ukraine","url":"https://unn.ua/en/amp/china-is-considering-deploying-a-contingent-to-ukraine-media","date":1742659218,"author":"/u/Antique-Entrance-229","guid":615,"unread":true,"content":"<p>Diplomats from Beijing have asked the EU to participate in peacekeeping forces in Ukraine. There is hope that Russia will take action if China participates in the mission. This was reported by Welt, citing EU diplomatic circles, reports . </p><blockquote><p>China is apparently considering participating in a possible peacekeeping force in Ukraine. Chinese diplomats in Brussels have been probing the question of whether such a step would be conceivable and possibly even desirable from Europe's point of view&nbsp;</p></blockquote><p>Diplomatic circles in Brussels said: \"The inclusion of China in the \"coalition of the willing\" could potentially strengthen Russia's agreement to the presence of peacekeeping forces in Ukraine.\" In any case, the issue is \"sensitive.\"</p><p>French President Emmanuel Macron has announced another summit of supporters of Ukraine next Thursday. </p><p>\"Next Thursday we will hold a summit of the coalition of the willing,\" Macron said Thursday evening after the EU summit in Brussels. \"My goal on Thursday is, first of all, a renewed, clear and possibly somewhat more concrete commitment to support Ukraine in the short term.\"</p><p>Macron added that Ukrainian President Volodymyr Zelensky will also attend the summit in Paris. Both Macron and British Prime Minister Keir Starmer are ready to deploy peacekeepers to Ukraine in the event of a ceasefire between Moscow and Kyiv - an idea that, according to Welt, Russia has so far categorically rejected.</p><p> Ukrainian Foreign Ministry spokesman Georgiy Tykhyi <a href=\"https://unn.ua/ru/news/uzhe-yest-spisok-stran-kotorie-virazhayut-gotovnost-mid-ob-inostrannom-kontingente-dlya-ukraini\">reported</a> that several countries have officially stated their readiness to send military contingents to Ukraine, and a corresponding list has already been formed.</p><p>On March 20, President Volodymyr Zelensky <a href=\"https://unn.ua/ru/news/zelenskii-o-voennom-kontingente-poka-yest-raznoe-videnie\">said</a> that there is currently a different vision regarding the military contingent for Ukraine, because there are countries that are ready to provide it in the event of a repeated aggression by the Russian Federation, there are those who agree to be located on the border, and there are those who want only at sea or in central large cities. Therefore, it is necessary to develop a common vision.</p>","contentLength":2071,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jhbpa4/china_is_considering_deploying_a_contingent_to/"},{"title":"Germany finalizes 3 billion euro aid package for Ukraine","url":"https://newsukraine.rbc.ua/news/germany-finalizes-3-billion-euro-aid-package-1742650353.html","date":1742654580,"author":"/u/Deedogg11","guid":610,"unread":true,"content":"<p>It is noted that Steinmeier signed a law that practically cancels the \"debt brake\" rule. It now needs to be published in the federal law gazette.</p><p>Expenditures on defense, intelligence services, and cybersecurity exceeding 1% of GDP will be exempt from the debt rule. Importantly, this also unlocks the allocation of 3 billion euros in military aid to Ukraine.</p><p>According to the approved law, 500 billion euros could be allocated for infrastructure investments over the next 12 years. The federal states are required to use 100 billion euros for their own infrastructure, 300 billion euros will be transferred to the German government, and the remaining 100 billion euros will be allocated for climate protection.</p><p>German Foreign Minister <a href=\"https://newsukraine.rbc.ua/news/additional-3-billion-euros-for-military-aid-1742582955.html\">Annalena Baerbock welcomed this decision </a>and emphasized its critical importance as the situation in Ukraine continues to worsen. She added that Ukraine urgently needs more surface-to-air missiles, artillery ammunition, spare parts, and weapon systems.</p><p>Germany is one of Ukraine's main allies and leaders in providing military assistance. Since the start of Russia's full-scale invasion, Berlin has provided the Ukrainian army with tanks of various modifications, artillery, armored vehicles, shells, ammunition, and other weaponry.</p><p>Germany has also provided Ukraine with means to enhance its air defense, including the latest IRIS-T and Patriot missile systems.</p><p>However, Germany has yet to approve the transfer of long-range Taurus cruise missiles, which Ukraine has requested. Find out more about these missiles in the RBC-Ukraine <a href=\"https://newsukraine.rbc.ua/analytics/striking-at-500-km-what-s-known-about-taurus-1691431046.html\">article</a>.</p>","contentLength":1570,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jh9z9x/germany_finalizes_3_billion_euro_aid_package_for/"},{"title":"Trump says ‘contract’ being drafted on ‘dividing up’ land in Ukraine war","url":"https://thehill.com/policy/international/5208000-trump-says-contract-being-drafted-on-dividing-up-land-in-ukraine-war/","date":1742645798,"author":"/u/M795","guid":617,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jh74wa/trump_says_contract_being_drafted_on_dividing_up/"},{"title":"EU leaders fail to agree €5 billion military aid package for Ukraine","url":"https://www.semafor.com/article/03/21/2025/europe-fails-to-agree-5-billion-ukraine-aid-package","date":1742642493,"author":"/u/milktanksadmirer","guid":612,"unread":true,"content":"<p>European Union leaders failed to agree a €5 billion ($5.4 billion) military aid package for Ukraine at a summit in Brussels Thursday, as the continent struggles to unite on a strategy to rearm itself and assert influence on peace talks with Russia.</p><p>There was greater consensus on imposing <a href=\"https://www.theguardian.com/world/2025/mar/20/eu-ready-to-impose-more-sanctions-on-russia-after-summit-talks\" rel=\"no-referrer\">fresh sanctions on Russia</a>, although Hungary — which has grown more willing to diverge from the EU on Ukraine — declined to take part.</p><p>Few countries have committed to sending peacekeepers to Ukraine, the focus of a separate summit in London Thursday. “A major concern is that coalition troops could get sucked into <a href=\"https://www.wsj.com/world/europe/europe-hatches-plans-for-ukraine-peacekeepers-without-u-s-26dd5f06?utm_source=semafor\" rel=\"no-referrer\">a hot war with Russia</a> without substantial US support to back them up,” the Wall Street Journal reported.</p>","contentLength":715,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jh69fw/eu_leaders_fail_to_agree_5_billion_military_aid/"},{"title":"Musk’s X suspends opposition accounts in Turkey amid civil unrest","url":"https://www.politico.eu/article/musks-x-suspends-opposition-accounts-turkey-protest-civil-unrest-erdogan-imamoglu-istanbul-mayor/","date":1742638605,"author":"/u/Gopu_17","guid":619,"unread":true,"content":"<div><p>Elon Musk’s X has challenged a German court decision that instructed the platform to share data with researchers, the court confirmed to POLITICO. In an urgent injunction, …</p></div>","contentLength":177,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jh5c3v/musks_x_suspends_opposition_accounts_in_turkey/"},{"title":"UK says it has £25 billion in frozen Russian assets","url":"https://www.politico.eu/article/uk-says-it-has-25-billion-in-frozen-russian-assets/","date":1742625053,"author":"/u/donutloop","guid":614,"unread":true,"content":"<div><p>Debanking went stateside in November, but has a well-trodden history in Britain after Farage was kicked out of Coutts bank.</p></div>","contentLength":123,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jh2c09/uk_says_it_has_25_billion_in_frozen_russian_assets/"},{"title":"Prime Minister Carney promises free trade between provinces and territories by Canada Day","url":"https://www.cbc.ca/news/politics/carney-premiers-meeting-1.7489368","date":1742601772,"author":"/u/BonkMcSlapchop","guid":616,"unread":true,"content":"<ul><li><em><strong>Canada to develop&nbsp;national trade strategy, PM says.</strong></em></li><li><em><strong>Carney says he'll keep carbon emissions cap.</strong></em></li><li><em><strong>Ottawa to set up 'one project, one review'&nbsp;system to speed approval of major projects.</strong></em></li><li><em><strong>Government will temporarily remove one-week waiting period for employment insurance.</strong></em></li></ul><p>Prime Minister Mark Carney says he and Canada's premiers have agreed to develop a national trade strategy and promised a&nbsp;slew of support for workers and businesses.</p><p>\"We intend from a federal level to have free trade by Canada Day,\" he said, noting that the plan would be directed at easing&nbsp;transportation, energy, critical minerals&nbsp;and digital connectivity restrictions across&nbsp;the country.&nbsp;&nbsp;</p><p>The announcement comes after his meeting&nbsp;with&nbsp;premiers at the Canadian War Museum in Ottawa on Friday, with some&nbsp;calling for trade barriers within the country to be swiftly removed in order to&nbsp;make Canada's economy more resilient.</p><p>\"The agreement is to turn what has been a concept into a reality that will&nbsp;diversify and strengthen our economy… We are committing to removing all federal exemptions under the Canada free-trade agreement,\" Carney said.&nbsp;</p><p>The gathering between Carney and the provincial and territorial leaders&nbsp;ran about 40 minutes longer than expected — and comes two days before a federal election <a href=\"https://www.cbc.ca/news/politics/carney-to-call-election-this-sunday-1.7488444\">is likely to be called.</a></p><div><em><strong>WATCH | PM addresses possibility&nbsp;of election interference</strong></em>:</div><p>U.S. President Donald Trump's trade war escalated last week as the country imposed 25 per cent tariffs on all steel and aluminum imports entering the country, prompting Canada to effectively double its retaliatory tariffs on U.S. goods.</p><p>Trump has also repeatedly suggested that Canada should become the 51st state.</p><p>\"We have to do things that we hadn't imagined possible before at a speed that we haven't moved before,\" Carney said in his remarks before the meeting. \"One aspect of that is we need builders and it's part of the reason why earlier today we've brought back the level of the capital gains so that those who take those risks get the rewards.\"</p><ul dir=\"ltr\"><li>Temporarily waiving the one-week employment insurance waiting period.</li><li>Temporarily allowing businesses to defer corporate income-tax payments and GST and HST remittances.</li><li>Deploying a new financing facility (the Large Enterprise Economic and National Security Facility).</li><li>Implementing a&nbsp;\"one window\" approval process to speed up major projects.&nbsp;</li><li>Doubling the Indigenous Loan Guarantee to $10 billion, unlocking access to capital for First Nations, Inuit and Métis.</li><li>Providing more funding for regional development agencies.</li><li>Removing any mobility restrictions for federally regulated professions.&nbsp;</li></ul><p dir=\"ltr\">Carney said removing barriers to the free movement of workers, goods and services would increase the size of Canada's economy by $250 billion — equivalent to more than $6,000 for every Canadian.</p><p dir=\"ltr\">He said he&nbsp;is proud&nbsp;the&nbsp;federal government moved on a number of projects today, such as the&nbsp;Cedar LNG and LNG Canada in B.C. and&nbsp;Port of Churchill in northern Manitoba.&nbsp;</p><p dir=\"ltr\">\"It's high time to build,\" Carney said.&nbsp;</p><p dir=\"ltr\">Carney told reporters he would maintain a carbon emissions cap,&nbsp;but that legislation isn't enough to reduce emissions, which is why, he said, he is \"focused on action.\"&nbsp;<p> \"One of the projects, I firmly believe this, of national significance is major investments in carbon capture and storage,\" he said.&nbsp;</p></p><p dir=\"ltr\">\"We have the opportunity not just to get emissions down but very importantly to create an entirely new industry that will serve Canadians well but will create exports and jobs and opportunities for many decades.\"</p><p dir=\"ltr\">The Conservative Party later alleged Carney was lying about his support of Canada's oil and gas industry.</p><p dir=\"ltr\">\"If Carney was sincere, he would immediately commit to the full repeal of the Liberals' C-69, the 'No More Pipelines' Act, C-48, the West Coast Tanker Ban, and the production cap,\" the party said in a statement. \"Instead he doubled down on capping Canadian energy production.\"</p><p dir=\"ltr\">Carney's announcement about a national development strategy is also reminiscent of Conservative campaign promises.</p><p dir=\"ltr\">Just yesterday, Conservative Leader Pierre Poilievre <a href=\"http://www.cbc.ca/news/politics/poilievre-campaign-plane-bus-1.7488694\">said in Jonquière, Que.</a>, that he plans to create \"shovel-ready zones\" with pre-approved construction permits for major resource or energy projects if elected.</p><p dir=\"ltr\">In 2019,&nbsp;Conservative&nbsp;Andrew Scheer, leader of the Official Opposition at the time, pledged that if elected, his government would&nbsp;build a <a href=\"https://www.cbc.ca/news/politics/scheer-national-energy-corridor-announcement-1.5301488\">single coast-to-coast energy corridor</a> to transport natural resources.</p><h2>Most premiers in agreement: Ford</h2><p>In a scrum with reporters following the meeting, Ontario Premier Doug Ford said most premiers agreed&nbsp;about eliminating trade barriers, with he and the federal government intending to clear&nbsp;all exemptions.</p><p>\"Nova Scotia is clearing all exemptions. As we move across the country, eventually everyone is going to hop on,\" he said. \"They'll have no choice but to hop on board. Not forced, but there will be so much pressure within their territory or their province.\"</p><p>Ford repeated that all options remain on the table, including potentially increasing an energy tax on the U.S. despite Alberta Premier Danielle Smith's&nbsp;opposition to that approach.&nbsp;</p><div><em><strong>WATCH | Carney presents national strategy</strong></em>:</div><p>\"Ontario will decide that. No other jurisdiction,\" he said. \"I don't worry about her oil and she doesn't have to worry about my energy.\"</p><p>Smith and Saskatchewan's Scott Moe and&nbsp;B.C.'s David Eby attended&nbsp;virtually, as did&nbsp;Newfoundland and Labrador Premier Andrew Furey who is&nbsp;in Japan for&nbsp;a trade mission.</p><p>Ford reiterated that he would work with anyone as long as it's in Ontario's best interest.&nbsp;</p><p>New Brunswick Premier Susan Holt voiced&nbsp;support for Carney, saying in French that she is \"very happy\" to have him as prime minister while Canada is under tariff threats.&nbsp;</p><p>\"From what I've seen of Mr. Carney and the conversations we have had, his passion for Canada shines through, his intelligence shines through,\" she said.&nbsp;</p><p>She said she has yet to meet with Poilievre and doesn't have a comparison point.&nbsp;</p><div><em><strong>WATCH | How trade works in this border city:&nbsp;</strong></em></div><h2>Legault&nbsp;wants 'global negotiation'&nbsp;&nbsp;</h2><p>Shortly after arriving for the meeting, Quebec Premier François Legault&nbsp;told reporters that&nbsp;he wants the next prime minister to ask Trump for a \"global\" negotiation of a&nbsp;trade agreement rather than one that is piecemeal.</p><p>\"Right now, Mr. Trump doesn't respect the agreement between Canada, the U.S.&nbsp;and Mexico, especially&nbsp;on steel and aluminum. So it's important we renegotiate all the agreement,\" he said.</p><p>He said premiers and the prime minister need to be careful about counter-tariffs and \"eventual\" counter-tariffs&nbsp;to&nbsp;maximize the negative impact on U.S. businesses but minimize the impact on Canadian ones.&nbsp;</p><p>The Quebec premier said his&nbsp;province would be \"open\" to pipeline projects, due to Trump's threats, but there needs to be social acceptability.</p><p>Yukon Premier Ranj Pillai&nbsp;acknowledged that, with increased focus on&nbsp;the North and the Arctic,&nbsp;it's important to hear the plans of&nbsp;all political parties for the region, especially in light of the rhetoric south of the border.</p><p>Pillai said he wants to&nbsp;make sure the prime minister is aware that it is a \"special moment in time for us\" and that&nbsp;his visit to Iqaluit, the first domestic trip of his leadership of&nbsp;Canada, was \"important and set a tone.\"</p><p>\"Other people are focusing on the North and we sure need to do the same,\" Pillai said. \"In the first week, personally, I'm very impressed with what I've seen.\"</p><p>Nunavut Premier P.J. Akeeagok&nbsp;agreed, saying it was great to see Carney underline \"how important the North is and how much incredible of an&nbsp;opportunity we have to provide the country with an opportunity to&nbsp;diversify.\"</p><p dir=\"ltr\">Manitoba Premier Wab Kinew emphasized the need for a \"solid plan for Canada's economy\" because the country is \"fighting a trade war on two fronts.\"</p><p dir=\"ltr\">\"Trump tariffs certainly attract so much attention, but in Manitoba and in Western Canada, the tariffs from the People's Republic of China on canola and pork are having a major impact already,\" Kinew&nbsp;said.</p><p><em>With files from CBC's Olivia Stefanovich, Lisa Mayor, Meagan Fitzpatrick, Kate McKenna, Raffy Boudjikanian</em></p>","contentLength":8118,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgvgn0/prime_minister_carney_promises_free_trade_between/"},{"title":"Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US","url":"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254","date":1742592424,"author":"/u/ComplexWrangler1346","guid":618,"unread":true,"content":"<p>Donald Trump has said Russia is only fearful of NATO with the US as a member.&nbsp;</p><p>In a news conference on Friday, the US president claimed: \"<a href=\"https://news.sky.com/topic/nato-5921/1\" target=\"_blank\"></a>was gone until I came along\".</p><p>\"President Putin will tell you that without the United States, he wouldn't be worried, but he is worried when the United States is involved,\" he said.</p><p> also alleged the previous and current NATO secretary generals said: \"If it wasn't for Trump, you wouldn't even have NATO because we were paying the costs of almost all of the countries.\"</p><p>Mr Trump made the comments as he announced in the White House that Boeing has won a contract to develop the US Air Force's most sophisticated fighter jet yet.</p><p>The new sixth-generation jet would be named F-47, Mr Trump said.</p><p>\"Nothing in the world comes close to it... it's something the likes of which nobody has seen before,\" he added.</p><p>\"(The F-47) will be the most lethal aircraft ever built.\"</p><p>On defence, Mr Trump said the US is also \"well-equipped\" to fight any potential war with China.</p><p>\"We don't want to have a potential war with China. But I can tell you if we did, we're very well-equipped to handle it,\" he said.</p><p>He also rejected reports that his adviser Elon Musk would be briefed on how the United States would fight a hypothetical war with China - a rare suggestion that his far-reaching role in the administration will face limits.</p><p>\"Elon has businesses in China,\" he said. \"And he would be susceptible, perhaps, to that.\"</p><p>The president confirmed he would be speaking to China's president Xi Jinping about tariffs. Mr Trump also said there was flexibility on his controversial economic measure.</p><p>It comes as Mr Trump expressed enthusiasm for possibly becoming a member of the Commonwealth.</p><p>Sharing an article on his Truth Social network about plans to allegedly make the USA the next associate member, the President wrote: \"I Love King Charles. Sounds good to me!\"</p><p><strong>'Our allies are calling constantly'</strong></p><p>The plane's design remains a closely-held secret, but would likely include stealth, advanced sensors, and cutting-edge engines.</p><p>The initial contract to proceed with production on the jets is worth an estimated $20bn (£15.5bn).</p><div data-component-name=\"sdc-article-custom-markup\" data-consent=\"pending\" data-vendor-name=\"spreaker\"><section aria-label=\"Consent required\" data-component-name=\"ui-consent-roadblock\" data-aspect-ratio=\"16/9\"><div><div><a href=\"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254#\" data-single-click-vendor-name=\"spreaker\" data-show-on-fallback=\"false\">Enable Cookies</a><a href=\"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254#\" data-single-click-vendor-name=\"spreaker\">Allow Cookies Once</a></div></div></section></div><p>Mr Trump said the jets will be built over several years and \"it's something nobody has ever seen before\".</p><p>\"Our allies are calling constantly,\" Trump said, adding foreign sales could be an option. \"They want to buy them also.\"</p><p>After saying the US would \"tone down\" the new jets by 10% for any sales to allies, Trump said: \"[It] probably makes sense, because someday, maybe they're not our allies.\"</p><p>Critics have questioned the cost and the necessity of the programme as the Pentagon is still struggling to fully produce its current most advanced jet, the F-35, which is expected to cost taxpayers more than $1.7tr (£1.01tr) over its lifespan.</p><a href=\"https://news.sky.com/download-app\" target=\"blank\" data-tracking-label=\"ui-app-promo-download-link\" data-type=\"\" data-component-name=\"ui-app-promo\"></a><p><strong>'I'll pay out of my own pocket'</strong></p><p>Meanwhile, Mr Trump said he will pay NASA astronauts  overtime pay after their trip to the International Space Station lasted nine months longer than planned.</p><p>A reporter at the news conference said the pair are not entitled to overtime pay, prompting Mr Trump to say: \"If I have to, I'll pay it out of my own pocket.\"</p>","contentLength":3145,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgs1h6/trump_announces_most_lethal_aircraft_ever_built/"},{"title":"US to import eggs from Türkiye, South Korea amid crisis: Agriculture secretary","url":"https://www.aa.com.tr/en/americas/us-to-import-eggs-from-turkiye-south-korea-amid-crisis-agriculture-secretary/3516892","date":1742590089,"author":"/u/ArconaOaks","guid":613,"unread":true,"content":"<p>The US will import hundreds of millions of eggs from Türkiye and South Korea to address a severe shortage caused by an avian influenza outbreak and supply chain disruptions, Agriculture Secretary Brooke Rollins announced on Friday.</p><p>“We’ve got Turkey and South Korea importing eggs,” Rollins told reporters at the White House.</p><p>“We are talking in the hundreds of millions of eggs for the short term. (This is) significant enough to help continue to bring the prices down for right now” she said.</p><p>The US is also in talks with other countries for additional imports.</p><p>The move is part of a five-point plan Rollins unveiled in early March to combat the crisis which has driven egg prices up by 15.2% in January 2025—the largest monthly increase since June 2015. Over the past five years, egg prices have surged by 230%, according to Labor Department data.</p><p>Rollins emphasized the importance of biosecurity measures to control the avian flu outbreak, which has devastated poultry populations for nearly two years.</p><p>“The most proven way to solve for that is through biosecurity measures and what that means is locking down your barns,” she said. “Since we began doing that ... we've seen a significant decline in the bird flu.”</p><p>The US is also working to repopulate egg-laying hens, a process Trump administration claims slowed by regulations from previous administrations.</p><p>\"When our chicken populations are repopulated and we've got a full egg laying industry going again ... we then shift back to our internal egglayers and moving those eggs out onto the shelf,\" Rollins added.</p><p>It was earlier announced that Türkiye will send 15,000 tons of eggs by June 2025 as a key short-term solution.</p><p>Long-term measures include a $1 billion investment to stabilize the market and prevent future outbreaks. “This is a pretty big, massive plan,” Rollins said on February, expressing optimism about its impact.</p>","contentLength":1902,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgr4xv/us_to_import_eggs_from_t%C3%BCrkiye_south_korea_amid/"}],"tags":["news","reddit"]}