{"id":"4W3i2hyrJTVfcMQuhrPttG722C8HBF31qxeFbViR6n6b4GrtNEa","title":"NEWS_EN – WordPress","displayTitle":"hololive Official News","url":"https://hololivepro.com/news_en/feed/","feedLink":"https://hololivepro.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Kaela Kovalskia from hololive Indonesia to Reveal New Design","url":"https://hololivepro.com/news_en/20250319-kaela-kovalskia-from-hololive-indonesia-to-reveal-new-design/","date":1742352631,"author":"Horii","guid":83,"unread":true,"content":"<img width=\"1920\" height=\"1080\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia.jpg\" alt=\"\" decoding=\"async\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia.jpg 1920w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia-640x360.jpg 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia-1440x810.jpg 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia-768x432.jpg 768w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00bnr_KaelaKovalskia-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"><p>Kaela Kovalskia from hololive Indonesia will reveal her new visual on her YouTube channel on March 26th, 2025 (JST).</p><h3>[Kaela Kovalskia’s New Design Reveal Livestream]</h3><p>We hope you take the opportunity to watch a powered-up Kaela Kovalskia with her new visual.</p><p>Click <a href=\"https://hololive.hololivepro.com/en/talents/kaela-kovalskia/\">here</a> for Kaela Kovalskia’s Talent Page.</p>","contentLength":304,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Octopus x hololive Gen 0 Virtual Cards are Available from March 14th","url":"https://hololivepro.com/news_en/20250317-octopus-x-hololive-gen-0-virtual-cards-are-available-from-march-14th/","date":1742185491,"author":"Horii","guid":82,"unread":true,"content":"<img width=\"981\" height=\"483\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250314184840.png\" alt=\"\" decoding=\"async\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250314184840.png 981w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250314184840-640x315.png 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250314184840-768x378.png 768w\" sizes=\"(max-width: 981px) 100vw, 981px\"><p>COVER Corporation has announced a new collaboration between hololive production and Octopus Card, introducing exclusive virtual card images featuring hololive Gen 0 talents. These special edition Octopus Card images are available for purchase through the “Octopus Card Image Store”.</p><p>As one of the most widely used smart payment systems in Hong Kong,  Octopus Card will release a set of five unique virtual card images featuring Tokino Sora, Roboco-san, AZKi, Sakura Miko, and Hoshimachi Suisei. Each design features the talents in traditional Hong Kong style outfits, enjoying iconic local street food and embracing the city’s vibrant culture.</p><p>The hololive Gen 0 virtual card images will be available exclusively on the “Octopus Card Image Store” starting from March 14th, 2025 at HK$38 each.</p><p>During the sales period, all fans who purchase the card will automatically qualify for a giveaway event. Stay tuned to Octopus’ official social media channels for details on entry requirements and giveaway announcements.</p><p>For more information, please visit the official Octopus social media accounts.</p><p>\nOctopus is a contactless stored value card that provides customers with a simple, safe, and secure way to pay. First launched in 1997 across public transport systems, the applications of the Octopus card have since expanded to include retail stores and various facilities, making everyday life more convenient.</p>","contentLength":1411,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive performs at the Final Act of “ENTRY Inc. presents Japan Expo Paris in Osaka 2025” at the Osaka-Kansai Expo!","url":"https://hololivepro.com/news_en/20250317-hololive-performs-at-the-final-act-of-entry-inc-presents-japan-expo-paris-in-osaka-2025-at-the-osaka-kansai-expo/","date":1742180412,"author":"maki","guid":81,"unread":true,"content":"<img width=\"2560\" height=\"773\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-scaled.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-scaled.jpg 2560w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-640x193.jpg 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-1440x435.jpg 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-768x232.jpg 768w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-1536x464.jpg 1536w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250317_en_main-2048x618.jpg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"><p>COVER Corp., the company behind the VTuber agency “hololive production,” is pleased to announce that hololive will perform at “ENTRY Inc. presents Japan Expo Paris in Osaka 2025,” held at the Osaka-Kansai Expo on April 26th (Sat) and 27th (Sun), 2025.</p><h3>Confirmed as the Final Act for “ENTRY Inc. presents Japan Expo Paris in Osaka 2025”!</h3><p>Talents from hololive, hololive Indonesia, and hololive English will come together for a special showcase during the “2nd part” on April 27th at the EXPO Arena of the Osaka-Kansai Expo. This will be a one-night-only performance that you won’t want to miss!\nTo attend, advance reservations are required through the official Osaka-Kansai Expo website. The “2nd part” performance will be available through a lottery system, and applications must be submitted via the Expo’s official website up to 8 days before the event.<p>\nDon’t miss this special opportunity! We look forward to your applications.</p></p><p>\nHoshimachi Suisei, Sakura Miko, Nakiri Ayame, Oozora Subaru, Usada Pekora, Shirogane Noel, Houshou Marine, Amane Kanata, Tsunomaki Watame, Kobo Kanaeru, Mori Calliope, Shiori Novella, Koseki Bijou, Nerissa Ravencroft, Fuwawa Abyssgard, Mococo Abyssgard.</p><p>Note: Performers are subject to change without notice.</p><h3>Japan Expo Paris in Osaka Information</h3>","contentLength":1299,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive SUPER EXPO 2025 & hololive 6th fes. – UNDONE Arcade Theme Watch & Merch Collection Now Available for Pre-Order","url":"https://hololivepro.com/news_en/20250308-hololive-super-expo-2025-hololive-6th-fes-undone-arcade-theme-watch-merch-collection-now-available-for-pre-order/","date":1741387249,"author":"Horii","guid":80,"unread":true,"content":"<img width=\"1900\" height=\"882\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE.jpg 1900w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE-640x297.jpg 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE-1440x668.jpg 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE-768x357.jpg 768w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/00UNDONE-1536x713.jpg 1536w\" sizes=\"auto, (max-width: 1900px) 100vw, 1900px\"><p>COVER Corporation has announced that the UNDONE x hololive production – hololive SUPER EXPO 2025 &amp; hololive 6th fes. – GAMEONE watch and merch collection is now available for pre-order.\nThe collection set will feature all members of hololive production to commemorate UNDONE’s gold sponsorship of hololive SUPER EXPO 2025 &amp; hololive 6th fes.</p><p>UNDONE GAMEON collection is inspired by an arcade theme, offering fans a choice between two exclusive timepieces: THE ARCADE SHOOT and THE ULTIMATE SHOOTER.\nThese watches feature unique customization options, allowing fans to immortalize any of the 90 hololive production talents on the case back.<p>\nBeyond the single watch option, UNDONE introduces an exclusive GAMEON KIT that includes both a wristwatch and a matching desk clock. For the ultimate collectors, there’s the limited arcade machine boxset, with only 1,000 available, each printed with unique serial numbers to celebrate this special event.UNDONE, as the gold sponsor of the event, has launched the GAMEON collection inspired by the event’s arcade theme. </p></p><p>This collection offers fans a choice between two exclusive timepieces: THE ARCADE SHOOT and THE ULTIMATE SHOOTER. These watches feature unique customization options, allowing fans to immortalize any of the 90 hololive production talents on the case back. Beyond the single watch option, UNDONE introduces an exclusive GAMEON KIT that includes both a wristwatch and a matching desk clock. </p><p>For the ultimate collectors, there’s the limited arcade machine boxset, with only 1,000 available, each printed with unique serial numbers to celebrate this special event!</p><p>Merchandise bundled with the watch set includes arcade coins, key visual coin sets, watch cleaning cloths, playing cards, puzzle sets, passport holders and more.</p><h3>GAMEON Watch &amp; Merch Collection</h3><p>Pre-Order: March 7th, 5PM (EST) (March 8th, 7AM JST) – April 30th, 11:59 PM</p><p>For more information, please visit the official website of UNDONE.</p>","contentLength":1964,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Feelings Transcend Dimensions – VTuber Group hololive production Releases Branding Video in a Joint Development Between VTubers and Creators Across Dimensions.","url":"https://hololivepro.com/news_en/20250307-01-154/","date":1741316126,"author":"narita","guid":79,"unread":true,"content":"<img width=\"1920\" height=\"960\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN.webp\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN.webp 1920w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN-640x320.webp 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN-1440x720.webp 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN-768x384.webp 768w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/20250307_main_EN-1536x768.webp 1536w\" sizes=\"auto, (max-width: 1920px) 100vw, 1920px\"><p>COVER Corporation (Minato-ku, Tokyo; CEO: Tanigo Motoaki) has released a branding video for hololive production titled “Feelings Transcend Dimensions” on March 7th, 2025.</p><p>The video will be streaming on some digital billboards, and on the official hololive production website and social media accounts (TikTok, YouTube, and X).</p><p>Talent Appearances: Hoshimachi Suisei, Houshou Marine, Kobo Kanaeru, Takanashi Kiara, ReGLOSS\nCreator Appearances: Tsumiki, Araki Yuka, HoneyWorks, Mumeixxx, Sawamura Kirari</p><h3>“Feelings Transcend Dimensions” Branding Video</h3><p>The video follows the talents of hololive production working with popular creators across dimensions to create works that express their creativity in a mix of animation and live-action film.</p><p>Appearing in the video are five creators: Tsumiki, who worked on the lyrics, composition and arrangement for Hoshimachi Suisei’s megahit “BIBBIDIBA;” Araki Yuka, who choreographs songs for ReGLOSS; HoneyWorks, who worked on the overall directions for hololive production’s hololive × HoneyWorks project, and Mumeixxx and Sawamura Kirari, two influencers who collaborated with Houshou Marine to create dance covers. This video shows how each of these creators worked together with the talents in their respective productions.</p><p>The narration is done by Iwami Manaka, who has voiced popular characters such as Kurokawa Akane from the anime Oshi no Ko.</p><p>It is also currently being broadcast on some digital billboards.</p><p>*When and where the video is to be shown is subject to change without notice.\n*Please refrain from contacting any buildings or stores about this video.<p>\n*We hope you enjoy the video, but please consider your safety and do not obstruct traffic when taking photos.</p>\n(We may stop broadcasting the video in emergency situations)</p><h3>hololive production Official Website Renewal</h3><p>The design of the hololive production official website has been revamped, so please take a look as we continue to bring you all the latest hololive news.<a href=\"https://hololivepro.com/en\" rel=\"noopener\">https://hololivepro.com/en</a></p><p>\nStarting his career as a Vocaloid music producer in 2017, Tsumiki has risen to fame with his highly addictive songs such as the 2022 track Tokyo Shandy Rendez-vous by MAISONdes feat. KAF and Tsumiki that sparked another sensation in fan works, to go along with the smash hit “phony” that released in June 2021, and BIBBIDIBA, which he composed for Hoshimachi Suisei that surpassed one hundred million streams across YouTube and other streaming platforms.</p><p>\nAraki Yuka’s activities are primarily focused on providing choreography and directing performances for a myriad of 3D characters. She also established a company in 2021 for casting choreographers and motion actors.</p><p>\nHoneyWorks is a team of creators who mainly work on video-posting platforms such as Niconico and YouTube, and has garnered over 2.5 billion streams across their videos.<p>\nThey create music under the “positive rock” genre with lots of heart-racing themes and youthful sounds.</p></p><p>\nAn extremely influential talent with a total of over 6.5 million followers, Mumeixxx posted her first TikTok in July 2020 and has become a sensation for her cuteness and addictiveness.<p>\nShe has expanded out into participating in fashion events, collaborating with companies and has also kicked off her music career.</p></p><p>\nWith a TikTok following of 1.39 million, twenty year-old Sawamura Kirari is the vogue of TikTok creators right now.<p>\nWith the MV of her debut song “lethal dose darling” surpassing one million views on YouTube, she is also a noteworthy artist on the rise.</p></p><p>\nHailing from Saitama Prefecture, Iwami Manaka was born on April 30th, and is currently affiliated with Raccoon Dog.<p>\nSome of her notable appearances have been in works such as Ameku Takao’s Detective Karte (as Konoike Mai), Oshi no Ko (as Kurokawa Akane), and Umamusume: Pretty Derby (as Rice Shower).</p></p>","contentLength":3835,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"HOLOSTARS English -ARMIS- Announces 3D Showcase Schedule","url":"https://hololivepro.com/news_en/20250301-02-5/","date":1740801484,"author":"Horii","guid":78,"unread":true,"content":"<img width=\"1920\" height=\"1080\" src=\"https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00.jpg\" alt=\"\" loading=\"lazy\" srcset=\"https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00.jpg 1920w, https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00-640x360.jpg 640w, https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00-1440x810.jpg 1440w, https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00-768x432.jpg 768w, https://holostars.hololivepro.com/wp-content/uploads/2025/03/armis00-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"><p>HOLOSTARS English -ARMIS- talents Jurard T Rexford, Goldbullet, Octavio, and Crimzon Ruze will star in their individual 3D Showcases, followed by a 3D Collaboration livestream together.</p><p>Tokyo, JAPAN — COVER Corporation (Minato-ku, Tokyo, Japan, CEO: Motoaki Tanigo) today announced the HOLOSTARS English -ARMIS-’s 3D Showcase Schedule, kicking off with Crimzon Ruze on March 9th, Goldbullet on March 16th, Jurard T Rexford on March 23rd, Octavio on March 28th, and a final 3D Collaboration on April 5th. (PDT)</p><p>The 3D showcases for HOLOSTARS English -ARMIS- members and their collaboration stream will feature various contents and performances from each of the talents.</p><h3>HOLOSTARS English -ARMIS- 3D Showcase</h3>","contentLength":707,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive English Teams Up with Capcom USA for Monster Hunter Wilds Collaboration","url":"https://hololivepro.com/news_en/20250301-01-153/","date":1740787275,"author":"maki","guid":77,"unread":true,"content":"<img width=\"1920\" height=\"1080\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main.webp\" alt=\"\" decoding=\"async\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main.webp 1920w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main-640x360.webp 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main-1440x810.webp 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main-768x432.webp 768w, https://hololive.hololivepro.com/wp-content/uploads/2025/03/250301_main-1536x864.webp 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"><p>Tokyo, Japan – February 28, 2025 – hololive English and Capcom USA are excited to announce a special collaboration with Monster Hunter Wilds, launching today! Four hololive EN talents—<a href=\"https://www.youtube.com/@KosekiBijou\" rel=\"noopener\">Koseki Bijou</a>, <a href=\"https://www.youtube.com/@NinomaeInanis\" rel=\"noopener\">Ninomae Ina’nis</a>, <a href=\"https://www.youtube.com/@holoen_raorapanthera\" rel=\"noopener\">Raora Panthera</a>, and <a href=\"https://www.youtube.com/@holoen_gigimurin\" rel=\"noopener\">Gigi Murin</a>— have been chosen for this collaboration due to their deep love and passion for the Monster Hunter franchise. Together, they’ll bring their unique energy and creativity to this exciting crossover.</p><p>The collaboration kicks off with custom Live2D Palico accessories designed by the talents themselves. These adorable Palico companions, inspired by their in-game creations, will debut during a special relay stream on February 28 (PST). Following the reveal, the talents will team up for a fun Monster Hunter Wilds gameplay stream, showcasing their Palicoes in action.</p><p>And that’s just the beginning of the collaboration! Stay tuned for more exciting updates in the close future!</p><p>\nThis partnership marks the first collaboration between hololive English and Capcom USA, bringing together two innovative brands to create a unique experience for fans. By combining the creativity of hololive’s talents with the rich world of Monster Hunter Wilds, this collaboration celebrates the shared passion for gaming and community.</p><p>\nTune in to the Palico Reveal Relay on February 28 (PST) and follow the hashtags  and  for updates. Don’t miss this chance to see your favorite VTubers team up with their Palico partners!</p><h3>About Monster Hunter Wilds</h3><p>Launching February 28, 2025, Monster Hunter Wilds takes players on an epic adventure in a vast, living world.\nPlatforms: PS5, Xbox Series X|S, and Steam<a href=\"https://www.monsterhunter.com/wilds\" rel=\"noopener\">https://www.monsterhunter.com/wilds</a>.</p>","contentLength":1675,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive OFFICIAL CARD GAME English Edition Launching in 2025","url":"https://hololivepro.com/news_en/20250221-01-152/","date":1740117651,"author":"pr","guid":76,"unread":true,"content":"<p>COVER Corporation (hereinafter referred to as the “Company,” headquartered in Minato-ku, Tokyo, Japan; President &amp; CEO: Motoaki Tanigo), hereby announces that the Company will be launching an English edition of its trading card game (TCG), “hololive OFFICIAL CARD GAME,” developed under VTuber group hololive production in 2025.</p><p>The hololive OFFICIAL CARD GAME is an immersive trading card game created on the concept of “Collaboration &amp; Competition” designed to highlight the individuality and charm of the talents from hololive. Since its launch in Japan in September 2024, the game has received an overwhelmingly positive response from fans, so in order to make the experience as accessible as possible to hololive fans worldwide, the Company is currently working on an English edition.</p><p>The English edition will retain the appeal of the original Japanese version by preserving its card designs and game rules while localizing the experience to make it even more accessible and engaging for hololive English-speaking fans. In addition, there are plans to release special cards and hold events to further excite the global fan community and enhance the overall experience.</p><p>The English edition, like the Japanese version, will be distributed and operated in collaboration with Bushiroad Inc. Sales are planned to take place primarily in North America, with availability at specialty TCG stores, stationery retailers, online marketplaces, and our official online store hololive production OFFICIAL SHOP (<a href=\"https://hololive.hololivepro.com/en/goods/\" target=\"_blank\" rel=\"noopener\">https://hololive.hololivepro.com/en/goods/</a>).</p><p>Further details on the release schedule, sales channels, and upcoming events will be announced in due course. For the latest information, please visit our official website and follow our official social media accounts.</p><p>The Company, through hololive production, is dedicated to delivering new entertainment experiences to fans worldwide. With the release of the English edition of the hololive OFFICIAL CARD GAME, we are excited to bring the magic of hololive to an even wider audience.</p><p>please visit our official website and follow our official social media accounts.<strong>hololive OFFICIAL CARD GAME【公式】X</strong><a href=\"https://x.com/hololive_OCG_EN\" target=\"_blank\" rel=\"noopener\">@hololive_OCG_EN</a></p>","contentLength":2176,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Moona Hoshinova 1st Album PANDORA, Pertama dari hololive Indonesia","url":"https://hololivepro.com/news_en/20250217-01-151/","date":1739781037,"author":"narita","guid":75,"unread":true,"content":"<p>COVER Corporation (Minato-ku, Tokyo, Japan, CEO: Motoaki Tanigo) dengan bangga mengumumkan perilisan album pertama dari salah satu talent hololive Indonesia, Moona Hoshinova. Album yang bertajuk PANDORA ini tidak hanya menjadi debut album bagi Moona, tetapi juga menandai album pertama yang dirilis oleh hololive Indonesia, menjadikannya tonggak sejarah bagi aktivitas talent hololive Indonesia di dunia musik.</p><p>PANDORA berisi 10 lagu yang mencerminkan perjalanan musikal Moona serta filosofi dan dedikasinya dalam menghadirkan musik bagi para penggemar. Album ini tersedia dalam dua edisi, yaitu Limited Edition dan Regular Edition, dengan bonus eksklusif untuk masing-masing edisi.</p><h3>Moona Hoshinova 1st Album PANDORA Limited Edition bonus</h3><p>・ Moona Hoshinova 1st Album PANDORA\n・ CD jacket dengan tanda tangan asli Moona Hoshinova<p>\n・ Surat spesial dari Moona Hoshinova</p>\n・ 2 pembatas buku eksklusif<p>\n・ Kesempatan mengikuti undian Meet &amp; Greet bersama Moona</p></p><h3>Moona Hoshinova 1st Album PANDORA Regular Edition bonus</h3><p>・ Trading card (tersedia dalam 4 tipe + 1 secret, diberikan secara random)</p><p>Album ini sudah dapat dipesan melalui hololive production OFFICIAL SHOP. Kunjungi situs tersebut untuk info selengkapnya!</p>","contentLength":1208,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Post-Event Report on hololive STAGE World Tour ’24 -Soar!-","url":"https://hololivepro.com/news_en/20250217-01-150/","date":1739761252,"author":"Horii","guid":74,"unread":true,"content":"<img width=\"1440\" height=\"810\" src=\"https://hololive.hololivepro.com/wp-content/uploads/2025/02/WT00.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://hololive.hololivepro.com/wp-content/uploads/2025/02/WT00.jpg 1440w, https://hololive.hololivepro.com/wp-content/uploads/2025/02/WT00-640x360.jpg 640w, https://hololive.hololivepro.com/wp-content/uploads/2025/02/WT00-768x432.jpg 768w\" sizes=\"auto, (max-width: 1440px) 100vw, 1440px\"><p>We just finished the first 3D Concert World Tour of hololive production in Taipei on January 18th! We are very grateful for all the support received from fans all over the world and that we were able to spread the charm of hololive production to more than 14,000 visitors in 6 major cities within 6 months. </p><p>We always appreciate the love from hololive production fans around the world and strive to give as many people as possible the chance to experience hololive production 3D concerts. In this report, we would like to share with you the excitement and milestones we have achieved together with you and the talents!</p><h3>About hololive STAGE World Tour ’24 -Soar!-</h3><p>As hololive STAGE, we hope to bring the best 3D performances to every world stage for everyone to enjoy. The first hololive STAGE concert, a world tour, was conceptualized with the theme of “Soar!”. With “Soar!” as the concert title, we wanted to fly higher and further together. In the key visual illustrated by OMOCAT, each talent has a wing symbol on their back to further emphasize this message. </p><p>The first world tour featured 7 of our talents: AZKi and Tsunomaki Watame from hololive, Moona Hoshinova and Kobo Kanaeru from hololive Indonesia, as well as Takanashi Kiara, Ninomae Ina’nis and Hakos Baelz from hololive English. Together, they delivered spectacular musical performances in multiple languages that were loved by international audiences. A unique experience for each show in different cities was created by varying each set list and also creating special performances tailored to the local audience. </p><p>From solo, duet, to group performances in both the default and Our Bright Parade costumes and also the retro theatre-style stage, hololive STAGE World Tour ’24 -Soar!- provided an unforgettable experience for every hololive fan, regardless of their location. To further hype up our first world tour, the fan favorite “Shiny Smily Story” was also arranged in an EDM style. Starting from the Jakarta venue, “Shiny Smily Story” Soar Ver. has become one of the highlights of the concert, positioned as the last song. </p><p>To enhance and immortalize the experience, we also released hololive STAGE World Tour ’24 -Soar!- merchandise in the form of T-shirts, penlights, and towels. These items were available for purchase through both hololive production’s online store and at each venue’s merchandise booth. In addition, unique merchandise was available at select venues. </p><h3>Anime NYC 2024 (New York City)</h3><p>Concert Date: Friday, August 23, 2024\nVenue: JAVITS CONVENTION CENTER</p><p> – The first show of the world tour, one day before “hololive English 2nd Concert -Breaking Dimensions-”\n – A hololive booth with world tour photo spots.<p>\n – Performed 14 songs with a mix of solo and unit combinations.</p></p><h3>Indonesia Comic Con 2024 (Jakarta)</h3><p>Concert Date: Saturday, November 9, 2024\nVenue: Jakarta Convention Center</p><p> – The second show of the world tour, hololive came back to jakarta after “VRChat Presents viv:ID CRUISE hololive Meet Asia Tour”\n – Performed cover songs popular with anime fans, they also performed “Pretender”, which is very popular in Indonesia, and ended with “Shiny Smily Story” Soar Ver. </p><h3>Anime Festival Asia (Singapore)</h3><p>Concert Date: Saturday, November 30, 2024\nVenue: Suntec Singapore Convention &amp; Exhibition Centre</p><p> – This is the third year hololive held a 3D concert in Singapore.\n – Pre-concert panels featuring Kaela Kovalskia and Ouro Kronii, as well as FUWAMOCO.<p>\n – AZKi and Tsunomaki Watame performed a cover song duet.</p></p><h3>Anime Weekend Atlanta (Atlanta)</h3><p>Concert Date: Saturday, December 15, 2024\nVenue: Georgia World Congress Center</p><p> – Pre-concert panel starring Nerissa Ravencroft and Elizabeth Rose Bloodflame.\n – Ninomae Ina’nis, Takanashi Kiara, and Hakos Baelz graced the stage with their performance.</p><h3>Comic Fiesta (Kuala Lumpur)</h3><p>Concert Date: Saturday, December 21, 2024\nVenue: Kuala Lumpur Convention Center</p><p> – Before the start of the concert, audiences were also served with a panel of Nerissa Ravencroft and Elizabeth Rose Bloodflame.\n – The world tour stage was modified in adjustment to the concert hall to provide an even greater view of talents.<p>\nClose to the holidays, Moona Hoshinova, Kobo Kanaeru, Takanashi Kiara and Hakos Baelz gave a spectacular performance.</p></p><p>Concert Date: Saturday, January 18, 2025\nVenue: Taipei Music Center</p><p> – Fans had a blast with the photo spots, flower stands corner and ad-truck outside the venue.\nLonger setlist featured with new songs! A new castle stage was also introduced in the middle.<p>\n – The audience got emotional when the encore was played with video clips from the whole tour. We were #1 in the region for 2 days.</p>\n – Kobo Kanael and Hakos Baelz also graced the end of the show with a cover of the popular Taiwanese song: Ai ni. With the last “Shiny Smily Story” Soar Ver. performed at the end, the long and exciting world tour finally came to an end. </p><p>Together with you and the talents, we have made history with hololive STAGE World Tour ’24 -Soar!- and couldn’t be more thrilled! We hope to see you again at future events.\nThe world is a stage, so soar, soar, soar! </p>","contentLength":5166,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["hololive"]}