{"id":"6C2W1azD1rBrkHBvqx8Hr6tThNZTGcK2qBkXYyh3eQSnUGRTeWfMVxX","title":"COVEREdge| COVER\\\\\\’s official owned media","displayTitle":"COVEREdge Magazine","url":"https://coveredge.cover-corp.com/en/feed","feedLink":"https://coveredge.cover-corp.com/en","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":4,"items":[{"title":"From Newcomer to Manager of 100 Million Yen-Level Live Events: What is the Appeal of Arena-Level Project Management?","url":"https://coveredge.cover-corp.com/en/list/1367","date":1744254000,"author":"cover_yamaguchi","guid":184,"unread":true,"content":"<p>Well, I am in a position where I can lead arena-scale live events and projects worth hundreds of millions of yen. I don’t think there are many opportunities to be so deeply involved in projects of this scale in your 20s. Because COVER and this business are still in a growing phase, everyone’s responsibilities are not fixed, allowing those with ambition to gain experience in a wide range of fields.<p>It’s a bit of a cliche, but the sense of accomplishment is also one of its appeals. Live event productions span long periods and involve many challenges. Still, when the event day arrives, and I see the fans’ enthusiasm, I sincerely appreciate the hard work I have put in when I see their smiles. When I spy fans who are happy to be holding merch from a live event that I was involved in, I want to tell them, “I made those!” (lol)</p><p>In addition to making proposals for live productions, another key role of a Live Events PM is to make decisions on the details to move the event forward, so I also find it rewarding to be able to manage projects with a certain degree of decision-making authority.</p></p>","contentLength":1106,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A New Space for Fans to Connect. Our Boots-on-the-Ground Report from hololive OFFICIAL CARD GAME’s First Major Event: “World Grand Prix 2025”","url":"https://coveredge.cover-corp.com/en/list/1297","date":1743649200,"author":"cover_yamaguchi","guid":167,"unread":true,"content":"<h2><strong><strong>hololive OFFICIAL CARD GAME debuted in the rapidly growing TCG market</strong></strong></h2><p>The TCG market has been growing rapidly in recent years. According to a study by The Japan Toy Association*1, the domestic TCG market roughly doubled in size in just two years, from 122.2 billion yen in fiscal 2020 to 234.9 billion yen in fiscal 2022. The market is also projected to grow on a global scale.</p><p>Amid this market environment, the <a href=\"https://hololive-official-cardgame.com/\" target=\"_blank\" rel=\"noreferrer noopener\">“hololive OFFICIAL CARD GAME”</a>(commonly known as hOCG), that debuted in September 2024, is attracting attention as a new form of TCG that utilizes VTuber IP. This work is built around the concept of “creating and competing together&nbsp;with fans,” offering a unique world where players can relive their activities in support of hololive through a card game experience. Players select their favorite hololive member, known as their “oshi holo member,” and develop the game by producing stages for them.</p><p>The card designs are also very elaborate, and even the same card may have a VTuber’s autograph printed on it, or there may be a “parallel” version with special processing, making it a very collectible item. The game’s achievement of both gameplay and collectability makes it appealing for both TCG and hololive fans alike. After the game was released, card shops across Japan began holding periodic how-to-play classes and tournaments, creating an environment where players of all skill levels, from beginners to experts, could enjoy the game in their play styles.</p><h2><strong><strong>A report from the day of the World Grand Prix 2025, the first large-scale event for hOCG</strong></strong></h2><p>At the World Grand Prix 2025 event held at Makuhari Messe on January 18, 2025, the main event was the WGP 2025 Main Tournament where players competed for the right to participate in the National Championship, and there were also a variety of other tournaments tailored to the needs of players, such as the easy-to-join eight-player “Casual Tournament” and the large-scale individual battle “Bloom Cup DX,” letting players enjoy hOCG throughout the day.</p><p>From early in the morning, many participants gathered at the venue, and participants with various objectives came to the venue, including those who sat down at tables and began preparing for the tournament as soon as the doors opened, those who visited the exhibition area to look at and photograph the exhibits, and those who went to the merchandise corner.</p><p>The opening ceremony was held at 10:00 AM, with CEO Motoaki Tanigo taking the stage to deliver the opening address, while hololive member Hakui Koyori appeared in a video declaring the event open. The venue erupted with a thunderous surprise at the unexpected guest.</p><p>While the matches in the WGP 2025 Main Tournament that started in the morning were progressing smoothly, the Casual Tournament, which started at 12:00 PM, was held in the form of an eight-person team mini-tournament that also allowed people to participate on the day, and registration was accepted at any time until 6:30 PM in response to needs such as participating in a low-key manner as well as with friends.</p><p>In the afternoon, the large-scale individual competition, the Bloom Cup DX, began. At this tournament, the plan was designed to improve players’ motivation to win, so the prizes became more and more luxurious as players advanced through the rounds.</p><p>In the evening, the WGP 2025 Main Tournament progressed to the semi-finals and finals. As the heated battles unfolded, there were many participants quietly watching the battles from the sidelines.</p><h2><strong><strong><strong><strong>There are other ways to enjoy the event besides competing. Creating a venue that only hOCG could deliver and brief details of prizes won</strong></strong></strong></strong></h2><p>In addition to banners of hololive production-affiliated VTubers lining the venue, a life-size figure of Usada Pekora was on display near the entrance. This created a space where one could be fully immersed in the world of hololive.</p><p>In the exhibition area, people who had finished playing or were taking a break were seen taking photos of the banners and display cards as well as enjoying chatting with other participants. In addition, cards and related products were sold in the merchandise corner, where many popular items sold out early in the day.</p><p>As a special bonus for participating in the event, all participants received a “Super PR Pack vol. 1” (containing one randomly selected card from a total of 10 different types), and the players who made it through to the finals were given cards with special illustrations and specifications depending on their placings.</p><p>In addition to the commemorative plaque, the winners and runners-up of the WGP 2025 Main Tournament qualified for the next goal, the “Extremer Cup National Finals.”</p><h2><strong><strong><strong>Becoming new touchpoints for hololive fans. A new community brought together by hOCG, as attested by the voices of participants</strong></strong></strong></h2><p>The World Grand Prix 2025, hOCG’s first large-scale event, attracted a diverse range of participants from all over the country, from TCG novices to veteran players. While heated battles were being waged across the tables, in between matches, people could be seen excitedly talking about their oshi (favorites members). From participants’ feedback, we will introduce the new connections that were formed through hOCG.</p><p>A man in his 20s from Miyagi Prefecture told us, “My encounter with Sui-chan’s (Hoshimachi Suisei) songs was the trigger that drew me more and more into the charms of hololive.” A female fan of Amane Kanata, who was playing card games with him, commented, “I didn’t play TCG before, but I gradually started to join local tournaments,” while the male fan, talking about the unique fun of hOCG, enthusiastically stated, “The passion I had for TCG before was completely rekindled by hOCG. The appeal of hOCG is that you can fight using cards your oshi!”</p><p>A party of seven men from Aichi Prefecture noted they all met through hOCG, and commented, “In our local community, we enjoy ourselves together across generations with players in their teens to through the 60s.” Among them, one told us, “Encountering hololive made me want to spread online communities and VTubers more, and in the future, I hope to work in social media marketing. I am currently studying for that.” This person found his future passion through hololive.</p><p>Two men who participated after arriving the day before the event from Nagoya brought their own custom character bags and commented, “We originally played TCGs, but what’s unique about hOCG is that the decks are divided, and most importantly, it’s fun to use cards of my oshi members,” sharing the fans’ perspective on hOCG’s appeal.&nbsp;</p><p>A pair of men from Shizuoka Prefecture remarked they met each other through hOCG. One told us, “I’ve been away from TCGs for a while, but I remembered how fun TCGs are when I played with my oshi’s card in hOCG.” His friend also stated with a smile, “I usually watch streams alone, so I couldn’t interact with anyone, but I’m glad I made friends with like-minded people to invite to live events through this game.”</p><p>From another group of seven people who connected through social media and were meeting face-to-face for the first time that day, one explained, “Maybe it’s because hololive fans are gathering, but even though it’s a TCG tournament, there’s no tense atmosphere.” Another added, “During the breaks between matches, we can get excited talking about our oshis, like, ‘This one is so cute!’ I think that’s what makes hOCG tournaments unique.” We also heard comments such as, “When you see someone’s deck case or playmat and say, ‘Oh, we have the same oshi!’—that’s how conversations start.” This shows how the combination of VTubers x TCG is creating new touchpoints among hololive fans.</p><p>There was also feedback along the lines of, “This card got me interested in the ‘hololive English’ stars, and I started watching English-language VTuber broadcasts too.” There were also many participants who were captivated by the fun of the competition, saying, “I’ve set a new goal of aiming to compete in the National Championship.”</p><p>This year’s World Grand Prix 2025 also attracted visitors from outside Japan, and we also spoke to a pair of exchange students from Italy and the United States who shared, “We met on Discord for overseas fans and got together for this event.” They decided to participate after seeing an ad for the event on a social media site, and are enjoying cross-border interactions through hOCG. It was impressive to see how communication that transcended language barriers was created naturally through the common language of TCG.</p><h2><strong><strong><strong>Asking the producer about how the tournament went and new potential of hOCG</strong></strong></strong></h2><p>We spoke with Mr. Kawatsu, product and event producer at Bushiroad Inc., which handles the operations for hOCG events, about the participant demographics at the tournament. Analyzing the growth in new players entering the TCG scene through hOCG, he explained, “According to data from Bushi Navi,* more than half of the participants created a new account on the platform after mid-July 2024, when registration opened for the classes on how to play hOCG.”&nbsp;</p><p>When asked about the measures that are unique to hololive in terms of event management, Mr. Kawatsu explained, “The venue announcements made by the affiliated VTubers are one of the unique elements of hololive, and it is a special experience that you cannot get at other TCG events.” He added, “In the Bloom Cup DX, we focused on table numbers and rankings by adopting a format in which special awards are given to players whose table numbers correspond to the numbers associated with affiliated VTubers.” He also shared some of the unique developments underway, noting, “This scheme has been well received by hololive fans, and it is spreading, with some users even incorporating similar measures into their own events.”</p><p>At the World Grand Prix Tokyo tournament to be held in May, a Casual Tournament called the “Oshi Holomem’s Cup” is planned, which will provide a venue where players with the same oshi holo members can compete against each other. He also shared what’s ahead, saying, “The image we have is that hOCG events are like amusement parks. We aim to create a place where various attractions are prepared and where visitors can enjoy them in their own ways.”</p><p>Mr. Kawatsu closed our conversation by expressing his enthusiasm, “I think the value of hOCG events lies in the fact that they bring people together through the likes of hololive and TCG. By creating a better environment through the combined efforts of the players, the store staff, and our management team, I want to create a place where people will naturally say things like, ‘Let’s meet again at a hOCG event!’ and ‘Let’s go to a hololive event next time!'”</p><p>Mr. Horie, Manager and Producer of the Card Business Development Office at COVER Corp., shared his feelings and views on hOCG’s potential after the event: “I can sum my feelings in one word: gratitude. The fact that we were able to host a tournament with approximately 2,700 participants in just four short months since the release of hOCG is entirely thanks to the love and support shown for the cards. Leading up to the event, I saw users actively engaging with one another on social media, and at the venue, I witnessed real-life interactions taking place everywhere. This was exactly what we had dreamed of when we first launched hOCG, and now that it has become a reality, I find myself at a loss for words to fully express the joy and gratitude I feel.”&nbsp;</p><p>He explained the intent behind each event when holding this tournament: “Our hope was for participants to experience the excitement of realizing, ‘There are so many others who share my interests!’ and to connect with one another by sharing that passion. To achieve this, we organized three key events: the WGP 2025 Main Tournament, where players compete for a spot in the National Championship; the Bloom Cup DX, a one-day competition where participants can win luxurious prizes as they advance through the rounds; and the Casual Tournament, designed to encourage friendly matches and interactions among attendees.”</p><p>Looking ahead, he added, “While tournaments naturally involve intense competition and not every moment is relaxed, our ultimate goal has always been to create an experience where participants leave with smiles on their faces, eager to join another hOCG event and engage with even more players. We’ve carefully planned each aspect of this tournament with that in mind. I want to continue to cherish the connections and enjoyment that are born through hOCG. I hope that through these events, people will continue to feel the presence of the hOCG community,” articulated Mr. Horie.</p><h2><strong><strong><strong>A new future of entertainment drawn out by hololive x TCG</strong></strong></strong></h2><p>At the World Grand Prix 2025, we witnessed a new card game culture emerging that seamlessly blends digital and analog experiences. Participants were not only fully immersed in intense matches but also enthusiastically sharing stories about their oshi, while the crowd erupted with excitement at venue announcements made by hololive production-affiliated VTubers.</p><p>This event has brought people together from all over Japan, including Aichi and Miyagi prefectures, welcoming players regardless of age or experience. Starting with a shared interest of oshi hololive members, the bonds that deepen through card games presented a new way of enjoying VTuber content.</p><p>The unique worldview and community that has been created through the fusion of the digital existence known as VTubers and TCG gaming has given us a glimpse of new possibilities and developments in the entertainment industry.</p><p>Stay tuned for more reports from COVERedge on the events that COVER is engaged in.</p>","contentLength":13851,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Outside Director Kimiyuki Suda Unravels COVER’s Growth Journey and Future Challenges Build on Relationship of Trust Spanning 20 Years","url":"https://coveredge.cover-corp.com/en/list/1230","date":1742518800,"author":"cover_hirata","guid":91,"unread":true,"content":"<p>When COVER was founded in 2016, it was developing a VR table tennis game in a modest multi-tenant building in Shibuya. After that, I also watched in real time as the Company shifted its focus to the VTuber business. At first, COVER didn’t have a clear direction, but as it continued its research into voice apps and surveyed illustrators, and with the backdrop of the emergence of Kizuna AI—the world’s first virtual YouTuber—the pieces gradually came together.<p>A major turning point for the Company was when Mr. Tanigo spoke at the Infinity Ventures Summit (IVS) held in December 2017. His presentation at IVS was the trigger for spreading the COVER name in the startup community. Until then, it had been difficult to gain the understanding of investors regarding the VTuber business, but the situation flipped after the presentation at IVS, and COVER received many offers for funding on the same day.</p><p>My most memorable touchpoint with COVER’s fans was the first concert held by hololive production at Toyosu PIT. At the time, I was somewhat skeptical about holding the concert, but I was blown away by the excitement of the audience waving their glow sticks at the venue.</p>During the event, there was a technical glitch that caused the concert to be temporarily interrupted. A prolonged silence during a concert is quite a mess, isn’t it? After a while, people here and there in the audience started to shout encouragement along the lines of “You got this!!” (aimed at the concert organizers)&nbsp; Then, someone shouted “YAGOO (CEO Tanigo’s nickname), You got this!”, and before we knew it, the whole auditorium transformed into a frenzied chorus of “YAGOO! YAGOO!”&nbsp; &nbsp; I got goosebumps from the sense of unity at that moment. After that, hololive production grew steadily as a business including its global expansion. Looking back, the road to listing seems to have been relatively smooth, but in reality the problems were endless (lol). My impression is that the Company has grown through a variety of experiences, including these kinds of problems. I also believe the presence of rivals in the industry has been a positive for market growth.</p>","contentLength":2166,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What’s Ahead for the VTuber Industry: Looking to the Future with COVER CFO Yosuke Kaneko","url":"https://coveredge.cover-corp.com/en/list/1147","date":1741834800,"author":"cover_hirata","guid":90,"unread":true,"content":"<p>I grew up with anime and games since childhood, and I have always been fond of such culture. My father was an art dealer, and that gave me a lot of exposure to contemporary and other types of art. So from an early age I developed a strong interest in art and creativity. When I think about it, there may be a sense in which I perceive entertainment, such as games and anime, in an artistic way.<p>When I was working in the London branch of a securities firm around 2018, I watched quite a lot of YouTube in my free time and was quite interested in the trends in VTuber culture. In those days, the popularity of Japanese manga, anime, and Vocaloid culture was gradually spreading throughout London. Later, the under the pandemic lockdown</p>, anime and internet culture became popular with mass audiences through Netflix and other media. I was in London at a time when such Japanese culture was becoming mainstream, and I was also keeping a close watch on the new VTuber culture that was emerging from Japan and gaining momentum.<p>Also, from my perspective as a consumer, I was struck by the uniqueness and novelty of VTubers’ creativity. At the time, I was witnessing the birth of various start-ups in Japan and abroad, creating new value in the world. I felt that VTubers had great potential to create a new industry by utilizing the uniqueness of Japan.</p><p>After that, the stimulus for my joining COVER was applying for the position of international business development manager. When I had the opportunity to speak with Tanigo during that process, I shared my thoughts on how to achieve sustainable business expansion and growth. COVER in 2021 had more than 100 employees and was preparing to relocate its office. Amid the rapid and intense expansion of COVER and its customer base, it was decided that I would officially join the team upon completing my assignment in London. In February, I began working as the GM of the Corporate Planning Office. Back then, I worked in business planning in a newly established department and later was appointed CFO.</p></p>","contentLength":2045,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}