{"id":"6C2W1azD1rBrkHBvqx8Hr6tThNZTGcK2qBkXYyh3eQSnUGRTeWfMVxX","title":"COVEREdge| COVER\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\’s official owned media","displayTitle":"COVEREdge Magazine","url":"https://coveredge.cover-corp.com/en/feed","feedLink":"https://coveredge.cover-corp.com/en","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":4,"items":[{"title":"Achieving Creators’ Dreams and Creating a Challenge-Oriented Organization: An Interview with the Head of the Administration Department","url":"https://coveredge.cover-corp.com/en/list/2670","date":1755097200,"author":"平松梨沙","guid":695,"unread":true,"content":"<p>In recent years within the entertainment industry, anime in particular has seen a significant increase in the demand for proper compliance. This isn’t just demanded of us as a publicly listed company, but as the result of a structural shift within the industry as a whole.&nbsp;In fact, the anime market has grown two-fold over the last 10 years to be currently worth over 3 trillion yen, and of this, 1.6 trillion yen is in the Japanese market alone. It is now to the point where anime has lost the ‘Cool Japan’ tag and is now considered to be a major industry on the global stage. However, for a while there, admittedly, our creators were handling excessive workloads, but a report from the United Nations Commission of Inquiry in October 2023 shedding light on labor conditions within the anime industry has garnered international attention on the issue (with discussions reaching the point of whether or not to release details on Netflix, etc.) causing the industry to rethink and apply global standards to traditional working methods that have propped up the anime industry up until now.&nbsp;<p>We are fully aware of these issues having received our own recommendations with regards to the Subcontractor Act in Japan. For our hard-working creators, we need to adopt measures that may be seen as rather strict regulations at times, but this is a necessary path we have to take for the betterment of the industry as a whole.</p>To address this, we are implementing measures such as improvements to workflows and eliminating excessive working hours by working with the Corporate Planning Office in particular to come up with fundamental ways to resolve such structural issues. We also feel like we are coming together as an industry through collaborations with other companies in the industry and media mix projects.<p>As a company at the forefront of the industry, here at COVER we are not content with just simply addressing compliance issues, but rather proactively providing information and making efforts to ensure the steady development of the industry as a whole. This is absolutely necessary to continue to develop Japanese anime and VTubing as an entertainment industry we can be proud of, which includes improving our efforts in ensuring that talents and creators can thrive under sustainable working conditions.</p></p>","contentLength":2313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"An Interview with Shishiro Botan & Project Leader – The Passion and Creative Collaboration Behind Shishiro Hai","url":"https://coveredge.cover-corp.com/en/list/2555","date":1753930800,"author":"cover_hirata","guid":628,"unread":true,"content":"<p>There are around 90 talents affiliated with hololive production*. As a business, we naturally need to focus on driving revenue – but our resources aren’t unlimited. And from the talent side, they each have projects they want to pursue too, while also managing their regular streams, preparing for anniversary events, and planning other special content. So they’re constantly juggling a lot. Back in 2023, when Shishiro Hai was just getting off the ground, one of the biggest challenges was figuring out how the company could expand its support among the resources limitations that exist on both the company and talent sides.<p>So I approached my manager with a proposal: “Maybe we can generate revenue in ways that go beyond the traditional model if we can turn the things our talents genuinely want to do into business opportunities.” That way the talents get to pursue what they’re passionate about, and the company can allocate resources accordingly if it’s a viable revenue stream. It’s a win-win for everyone. Shishiro Hai was a perfect example of this: it became a way to bring Shishiro Botan’s passion to life, while also creating opportunities for sponsorship and monetization.</p><p>Fortunately, I happened to be in the sales department at that time, which allowed me to casually sound out a few trusted companies and get an early read on their interest. That helped me sketch out a rough budget plan and move forward with an internal proposal, which was officially approved on the condition that it would be monetized properly from the very first installment. In her interview, Shishiro Botan mentioned that “there wasn’t a lot of movement” after our initial discussions but the truth is that this was the time when I was working behind the scenes to try and get everyone on board! lol.</p></p>","contentLength":1810,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shishiro Hai – A Dynamic Crossover of eSports and VTuber Culture","url":"https://coveredge.cover-corp.com/en/list/2502","date":1753326000,"author":"cover_hirata","guid":604,"unread":true,"content":"<h2>The Vision Behind Shishiro Hai: Where eSports Meets VTubers</h2><p>In recent years, the esports industry has been gaining remarkable momentum. According to the <a href=\"https://www.lab-kadokawa.com/release/detail.php?id=0315\"> (Japan eSports White Paper) 2024 by KADOKAWA ASCII Research Laboratories Inc., </a>Japan’s domestic esports market reached JPY 14.685 billion in 2023 – a 117% increase from the previous year and looking ahead to 2025, the market is expected to approach 20 billion yen in scale. Some companies from a wide range of industries are stepping into the scene, becoming sponsors of professional esports teams and supporting major tournaments and events.&nbsp;</p><p>Did you know that the worlds of esports and VTubers are coming together more than ever before?</p><p>For those who aren’t so familiar with gaming, the esports scene and professional tournaments can sometimes feel a bit out of reach, but when it is a VTuber you already follow stepping into the arena, that barrier may not feel quite so high. Fans can cheer on their favorite VTubers as they improve from beginner level to becoming skilled players, and watch them connect with other creators through gaming. In the process, viewers naturally find themselves learning more about the game and enjoying it alongside their favorite talents.&nbsp;</p><p>Some VTubers have even gone beyond simply practicing on their own, with some embracing being coached by professional esports players to sharpen their skills and improve their chances of winning in tournaments and competitive matches. Coaching sessions are often shared as livestreams or videos, serving as a unique bridge between the esports and VTuber communities, and as these collaborations have continued over time, some VTubers and pro gamers have even developed bonds that feel almost like a mentor/apprentice relationship.&nbsp;</p><p>The lifelong gamer at heart received coaching from several professional players and steadily streamed her progress reaching Master Rank – a level widely recognized as the mark of an advanced player – in just one year, and has even been interviewed by media outlets about her tips when choosing gaming devices. It was not only her dream to compete in these kinds of tournaments but the challenge of hosting them that led to the creation of Shishiro Hai.</p><p>With Shishiro Botan taking the lead on tournament planning and day-of operations, and our company supporting coordination with partner organizations, the first Shishiro Hai STREET FIGHTER 6 powered by GALLERIA was held on March 31, 2024. This was followed by a second tournament on October 13-14 of the same year. Perhaps in recognition of her efforts to create and run these events, Shishiro Botan was honored with the title of VTuber of the Year 2024 in the Live Entertainment category at the JAPAN eSPORTS AWARDS 2024, announced at the year’s end.</p><h2>What Makes Shishiro Hai Unique?</h2><p>Online esports tournaments take place all the time in all kinds of formats, but here are a few key reasons why Shishiro Hai is unique.</p><p>Firstly, Shishiro Botan’s own influence and the strength of her brand have made it possible to bring in renowned players and commentators alongside fellow VTubers and creators from other communities, with the tournament not only attracting a range of different fanbases, but also creating dream matchups you won’t see anywhere else.&nbsp;</p><p>The commentary team features a lineup invited by Shishiro Botan personally, including esports commentator Kousuke Hiraiwa, formerly of Asahi Television Broadcasting, along with other experienced commentators and professional players. Not only does their involvement help ensure the tournament’s quality and legitimacy, but their clear commentary and insightful analysis also makes matches easier to follow and understand for viewers who may have never played STREET FIGHTER 6 themselves before or who are unfamiliar with the game altogether.</p><p>Another unique aspect is the inclusion of open entry slots. For example, when recruiting for the 3rd tournament, applicants needed to meet several criteria: hold a qualifying rank in STREET FIGHTER 6, have prior experience streaming the game, be able to broadcast from their own perspective during the event, and having at least 1,000 channel subscribers. Because of the format of the tournament, participants also had to be able to dedicate up to two full days exclusively for Shishiro Hai. Despite these conditions, there were an impressive 254 applications.&nbsp;</p><p>One particularly interesting aspect of Shishiro Hai is how the participants were eventually selected – live on Shishiro Botan’s own stream. With so many dedicated fans hoping to see their favorite players chosen, it is only natural that everyone would have different opinions during the selection process, but by making every step of the decision-making process more transparent, Shishiro Botan has been able to turn what could be tense proceedings into something truly entertaining that everyone can share and enjoy together.</p><p>Above all, what truly sets Shishiro Hai apart is its scale – it is one of the largest tournaments ever hosted by a VTuber. In the next section, we will have a look at data reports as well as the sponsorships and partner collaborations that have made this event possible.</p><h2>Shishiro Hai Achievements and Sponsorship Highlights</h2><h3>Shishiro Hai STREET FIGHTER 6 powered by GALLERIA</h3><p>The very first Shishiro Hai was held on March 31, 2024, with the main stream on Shishiro Botan’s channel reaching a peak of 80,045 concurrent viewers, and including mirror streams, this increased to 190,806. The tournament amazingly had 301,897 unique viewers overall and was trending at #4 on X in Japan.&nbsp;&nbsp;</p><p>Sponsors (in no particular order): Gaming PC GALLERIA (THIRDWAVE CORP) / nosh (nosh Inc.) / VICTRIX by PDP (SB C&amp;S Corp.) / Red Bull Japan (Red Bull Japan Co., Ltd.) / GiGO (GENDA GiGO Entertainment Inc.) / esports Challenger’s Park (QTnet, Inc.) / GOKURAKUYU HOLDINGS CO., LTD. / TOKYO DESIGN TECHNOLOGY CENTER / VAXEE (VAXEE) / TSUKUMO (Project White Co., Ltd.)</p><h3>The 2nd Shishiro Hai STREET FIGHTER 6 powered by GALLERIA</h3><p>The second tournament grew even larger, taking place over two days on October 13-14, 2024. On Day 1, the main broadcast peaked at 56,643 concurrent viewers, reaching 147,402 concurrent viewers when taking mirror streams into account, and 296,410 unique viewers in total. Day 2 attracted an even bigger audience, with the main stream peaking at 72,040 concurrent viewers (150,096 including mirrors) and a total of 305,969 unique viewers. 　</p><p>Sponsors (in no particular order): Gaming PC GALLERIA (THIRDWAVE CORP) / Red Bull Japan (Red Bull Japan Co., Ltd.）/ elgato / Aishitoto Co., Ltd. / VAXEE (VAXEE) / REALFORCE (Topre Corporation) / PWS JAPAN (Kanematsu PWS LTD.) / esports Challenger’s Park (QTnet,Inc.) / TOKYO DESIGN TECHNOLOGY CENTER / GRAPHT (MSY Inc.) / Yaro Ramen (FOOD REVAMP CO.,LTD.) /&nbsp; DMM Factory (<a href=\"http://dmm.com/\">DMM.com</a> LLC) / nosh (nosh Inc.)&nbsp;</p><h3>The 3rd Shishiro Hai STREET FIGHTER 6 powered by HP</h3><p>The 3rd Shishiro Hai went up yet another notch, with the tournament on Day 1 featuring a Master Division competition along with an Exhibition Match, followed by Grand Master and Legend Division tournaments on Day 2.&nbsp;</p><p>This time, the tournament had a slightly more creative format with a unique feature: a cross-divisional progression system. This unique approach, proposed by Shishiro Botan, allowed the winners of the Master and Grand Master Division tournaments to challenge players in the next division up. From the moment it was announced, this system was met with an enthusiastic response from both viewers and participants.&nbsp;</p><p>In fact, <a href=\"https://www.youtube.com/channel/UChLfthKoUV502J7gU9STArg\">Shibuya HAL</a>, who won the Master Division, and <a href=\"https://x.com/DONPISHA22\">Donpisha</a>, who took first place in the Grand Master Division, both went on to secure impressive victories in the higher divisions as well proving that the cross-divisional progression system not only worked as intended, but was responsible for some unforgettable moments unique to Shishiro Hai.&nbsp;</p><p>The exhibition match held during the latter half of Day 1 featured a team competition, with two groups of four players facing off against each other for both prizes and to avoid punishments, creating a fun and relaxed atmosphere. The mix of competitive tournaments and casual fun kept things fresh and engaging for beginners and veteran players, ensuring there was always something to enjoy for everyone.&nbsp;</p><p>Sponsors for the third event were as follows:HP Inc. / Red Bull Japan (Red Bull Japan Co., Ltd.) / GRAPHT (MSY Inc.) / TOKYO DESIGN TECHNOLOGY CENTER / VAXEE (VAXEE) / HUB (HUB CO., LTD.) / JOYPOLIS (CA Sega Joypolis Ltd.) / Turtle Beach (SB C&amp;S Corp.) / Ajinomoto Co., Inc. “あえて、®”</p><p>There have also been some standout initiatives that have made this event truly special.&nbsp;</p><p>First, thanks to HP Inc., the main sponsor of the tournament, Shishiro Botan hosted an interactive livestream on her channel ahead of the event where viewers could take part in special missions to unlock the Sponsorship Sale for the 3rd Shishiro Hai, which was successful thanks to everyone’s efforts in completing the challenges. This challenge-based initiative sought to involve the audience more and add to the festival atmosphere surrounding the tournament.&nbsp;</p><p>During the two days of the main event, public viewings were held at HUBs (UK-style pubs) across Japan, with special Shishiro Hai collaboration drinks also available from May 9 to 25.</p><p>Right before the tournament, the brand “あえて、®” (pronounced ) from Ajinomoto Co., Inc. was also announced as an official sponsor, but as they had only just launched its own esports initiatives, they contributed by offering their “あえて、®” frozen meal deliveries for the event. During the main event, there was a special segment featuring a fun quiz called  (cooked rice with seasonal ingredients) Blind Challenge that introduced some of the “あえて、®” range and highlighted the uniqueness of the meals in an engaging way.&nbsp;</p><h2><strong><strong>The Value Created by Shishiro Hai</strong></strong></h2><p>With the support of countless participants and partner companies, Shishiro Hai has evolved into an unprecedentedly influential tournament, opening the door for fans who usually follow VTuber streams to discover the energy and passion of the esports and professional gaming worlds. We even saw the emergence of a few Cinderella stories, with the spotlight shining on certain players in ways they hadn’t experienced before. Above all, everyone involved wants the same thing – to entertain viewers and to have fun themselves: a mindset evident in every part of the event and is one of the reasons Shishiro Hai is continued to be loved by all.&nbsp;</p><p>Of course, the viewers themselves are an essential part of what makes the tournament so special, but it goes beyond cheering for one’s favorite players in stream chat sections. The excitement and inspiration generated by Shishiro Hai can often be seen as the catalyst for all kinds of new connections and activities with many people joining sponsorship campaigns or discovering new creators to support even after watching their performances at this event.&nbsp;&nbsp;</p><p>Stay tuned for the upcoming second and third installments of this special feature, where we interview partners who were on board for Shishiro Hai, the team behind the project, and Shishiro Botan herself who gives us a sneak peek into the collaboration that goes on behind the scenes.</p><p>* Parts 3 of this article will be published soon.</p><p><sup>©CAPCOM* All company names, product names, and service names mentioned on this page are trademarks or registered trademarks of their respective companies.</sup></p>","contentLength":11516,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CEDEC2025: COVER Engineers Discuss the Forefront of Live Production Technology","url":"https://coveredge.cover-corp.com/en/list/2471","date":1752112800,"author":"平松梨沙","guid":543,"unread":true,"content":"<p>COVER Corporation is pleased to announce that two of our engineers will present at , scheduled from July 22-24, 2025.</p><p> is one of Japan’s largest conferences dedicated to computer entertainment developers, providing a platform for sharing the latest gaming industry-related technologies and insights. In the two sessions featuring our engineers, we will showcase our cutting-edge technology and behind-the-scenes development that power the live performances of hololive production, where the real and virtual seamlessly come together.&nbsp;</p><h2>Remote Live Performances! Transmission Technology Enabling Real-Time Sessions with On-Site Bands</h2><p>Wednesday, July 24, 11:10 AM -12:10 PM (Venue #6)Speaker: Toshiyuki Ono (Livestream Technology Division Filming Team/Studio Maintenance Team Manager, Creative Production Department)</p><p>During this session, we will present our ultra-low latency transmission technology, enabling performers in remote studios to engage in real-time music sessions with live bands on site, and take a look behind the scenes at how live vocal performances by VTubers come to life, sharing insights from the forefront of network innovation.&nbsp;</p><h2>Feeling Like They Are Actually There: Lighting Design Enhancing the Realism of hololive production’s On-Site and AR Live Shows</h2><p>Wednesday, July 24, 4:40 PM – 5:40 PM (Venue #7)Speaker: Akitsugu Hirano (Development Team #3, Creative Production Department)</p><p>This session will explore lighting technologies that create an immersive experience of “actually being there” during both AR and on-site live performances. We will share our proprietary lighting system developed with Unity, how we have implemented ray tracing, and advanced techniques for precisely synchronizing real and virtual elements.</p><h5>Note: You will need to have a valid attendee pass to attend CEDEC. For more information, please check the <a href=\"https://cedec.cesa.or.jp/2025/ticket_guide/\">website</a> (Japanese only).</h5>","contentLength":1877,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}