{"id":"6C2W1azD1rBrkHBvqx8Hr6tThNZTGcK2qBkXYyh3eQSnUGRTeWfMVxX","title":"COVEREdge| COVER\\\\\\’s official owned media","displayTitle":"COVEREdge Magazine","url":"https://coveredge.cover-corp.com/en/feed","feedLink":"https://coveredge.cover-corp.com/en","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":4,"items":[{"title":"Outside Director Kimiyuki Suda Unravels COVER’s Growth Journey and Future Challenges Build on Relationship of Trust Spanning 20 Years","url":"https://coveredge.cover-corp.com/en/list/1230","date":1742518800,"author":"cover_hirata","guid":91,"unread":true,"content":"<p>When COVER was founded in 2016, it was developing a VR table tennis game in a modest multi-tenant building in Shibuya. After that, I also watched in real time as the Company shifted its focus to the VTuber business. At first, COVER didn’t have a clear direction, but as it continued its research into voice apps and surveyed illustrators, and with the backdrop of the emergence of Kizuna AI—the world’s first virtual YouTuber—the pieces gradually came together.<p>A major turning point for the Company was when Mr. Tanigo spoke at the Infinity Ventures Summit (IVS) held in December 2017. His presentation at IVS was the trigger for spreading the COVER name in the startup community. Until then, it had been difficult to gain the understanding of investors regarding the VTuber business, but the situation flipped after the presentation at IVS, and COVER received many offers for funding on the same day.</p><p>My most memorable touchpoint with COVER’s fans was the first concert held by hololive production at Toyosu PIT. At the time, I was somewhat skeptical about holding the concert, but I was blown away by the excitement of the audience waving their glow sticks at the venue.</p>During the event, there was a technical glitch that caused the concert to be temporarily interrupted. A prolonged silence during a concert is quite a mess, isn’t it? After a while, people here and there in the audience started to shout encouragement along the lines of “You got this!!” (aimed at the concert organizers)&nbsp; Then, someone shouted “YAGOO (CEO Tanigo’s nickname), You got this!”, and before we knew it, the whole auditorium transformed into a frenzied chorus of “YAGOO! YAGOO!”&nbsp; &nbsp; I got goosebumps from the sense of unity at that moment. After that, hololive production grew steadily as a business including its global expansion. Looking back, the road to listing seems to have been relatively smooth, but in reality the problems were endless (lol). My impression is that the Company has grown through a variety of experiences, including these kinds of problems. I also believe the presence of rivals in the industry has been a positive for market growth.</p>","contentLength":2166,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What’s Ahead for the VTuber Industry: Looking to the Future with COVER CFO Yosuke Kaneko","url":"https://coveredge.cover-corp.com/en/list/1147","date":1741834800,"author":"cover_hirata","guid":90,"unread":true,"content":"<p>I grew up with anime and games since childhood, and I have always been fond of such culture. My father was an art dealer, and that gave me a lot of exposure to contemporary and other types of art. So from an early age I developed a strong interest in art and creativity. When I think about it, there may be a sense in which I perceive entertainment, such as games and anime, in an artistic way.<p>When I was working in the London branch of a securities firm around 2018, I watched quite a lot of YouTube in my free time and was quite interested in the trends in VTuber culture. In those days, the popularity of Japanese manga, anime, and Vocaloid culture was gradually spreading throughout London. Later, the under the pandemic lockdown</p>, anime and internet culture became popular with mass audiences through Netflix and other media. I was in London at a time when such Japanese culture was becoming mainstream, and I was also keeping a close watch on the new VTuber culture that was emerging from Japan and gaining momentum.<p>Also, from my perspective as a consumer, I was struck by the uniqueness and novelty of VTubers’ creativity. At the time, I was witnessing the birth of various start-ups in Japan and abroad, creating new value in the world. I felt that VTubers had great potential to create a new industry by utilizing the uniqueness of Japan.</p><p>After that, the stimulus for my joining COVER was applying for the position of international business development manager. When I had the opportunity to speak with Tanigo during that process, I shared my thoughts on how to achieve sustainable business expansion and growth. COVER in 2021 had more than 100 employees and was preparing to relocate its office. Amid the rapid and intense expansion of COVER and its customer base, it was decided that I would officially join the team upon completing my assignment in London. In February, I began working as the GM of the Corporate Planning Office. Back then, I worked in business planning in a newly established department and later was appointed CFO.</p></p>","contentLength":2045,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[Part 2]COVER’s Head of International Business Development Talks about the Global Strategy for Japanese Entertainment","url":"https://coveredge.cover-corp.com/en/list/1168","date":1740625200,"author":"cover_hirata","guid":89,"unread":true,"content":"<p>We are currently working on a medium-term plan that will take us through the next three to five years. hololive is a very unique case, as it has grown organically outside of Japan without taking any strategic measures. This is an exceptionally rare case even in the industry. We are now in the process of developing strategies for the next stage of growth while leveraging such strengths. The scale of what I can accomplish here is entirely different compared to when I was running my own company. When formulating strategies, I am constantly discovering new insights through conversations with other departments. This makes repeatedly aware of the depth of knowledge that exists within COVER. I see even more potential each time the company comes into sharper focus for me. When running a company alone, I was naturally limited by my own capacity. But now, I feel that I can take on even greater challenges as part of a team filled with experts with diverse skills.<p>When it comes to overseas development, I’ve found that there’s almost no difference in the passion of our core fans across countries and regions. Fans share a similar level of enthusiasm and love for our content regardless of where they may be. Having said that, how those emotions filter down to the light user base varies greatly by country and region. In Japan, for example, idol and anime culture are already deeply ingrained in society, making it easier to reach a wider audience. In other countries, the journey from core fan to light user requires different steps depending on the cultural context there.</p><p>Taking all that under consideration, we are particularly focusing on the North American market. In July 2024, we established COVER USA as our North American base, creating the most strategically advantageous environment for expansion. A US dollar-based market also presents an attractive opportunity from an economic perspective. hololive production is home to a broad roster of talented VTubers, and this diversity allows us to attract fans with a wide range of interests in North America as well. Additionally, through game streaming activities, we have successfully expanded our reach to new fan bases. The way we expand varies depending on the cultural foundations and economic environment, but I am aware that our growth is possible only with the support of our core fans in every region.</p></p>","contentLength":2374,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[Part 1]COVER’s Head of International Business Development Talks about the Global Strategy for Japanese Entertainment","url":"https://coveredge.cover-corp.com/en/list/1164","date":1740106800,"author":"cover_hirata","guid":88,"unread":true,"content":"<p>After graduating from university, I joined Accenture Japan Ltd as a strategy consultant in charge of clients in the manufacturing and logistics industries. I was often involved in projects to roll out Japanese businesses worldwide, and gradually I came to want to work on developing overseas strategies in the entertainment field, which I had long been interested in.<p>I then moved to a company founded on the “Cool Japan Strategy” promoted by the Ministry of Economy, Trade and Industry. As a business development manager, I was involved in the Hollywood film adaptation of Japanese works, and worked on projects to adapt popular Japanese works into films. The know-how and connections I cultivated through this path have become major assets to my career. I then joined Akatsuki Inc. where I served as Head of the COO Office and a Director at Akatsuki Entertainment USA, leading initiatives such as Hollywood film production, the launch of immersive entertainment* ventures, and new game development. I led global expansion across a wide range of fields, from live entertainment to gaming.</p><p>Following Akatsuki’s restructuring, I established AMMO Inc. to take over the film  business. At AMMO (hereinafter AMMO), I was involved in end-to-end content production, from acquiring rights to Japanese works to financing, selecting production companies, and overseeing distribution. My projects include adapting popular manga into Hollywood films and publishing award-winning mystery novels in the United States. The Japanese entertainment industry has a relatively short history in overseas expansion, but I always had the ambition to pursue new potential in this field. The theme of combining overseas markets and entertainment has been a consistent one throughout my career.</p></p>","contentLength":1773,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}