{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"ReactOS 0.4.15 released","url":"https://reactos.org/project-news/reactos-0415-released/","date":1742661114,"author":"/u/LAUAR","guid":576,"unread":true,"content":"<p>We are pleased to announce the release of ReactOS 0.4.15!\nThis release offers Plug and Play fixes, audio fixes, memory management fixes, registry healing, improvements to accessories and system tools including Notepad, Paint, RAPPS, the Input Method Editor, and shell improvements.</p><p>We chose to release this version of ReactOS in honor of Eric Kohl’s <a href=\"https://git.reactos.org/?p=reactos.git;a=commit;h=108fcceee22216b169b448932bb3f86c81b9448e\">first commit</a> to the ReactOS code base, which dates back to 1999.\nEric Kohl is the oldest active contributor of the project, and this is his 26th ReactOS anniversary!\nHe has participated in the project as a developer since its beginnings.</p><p>This release is a culmination of the work of numerous contributors since 0.4.14 was branched in 2020.\nThis has been the largest release to date.\nThere are nearly 8 times more commits going into this release than in 0.4.14.\nWe are proud of the progress we have made, and are eager to continue with this growth.\nLet’s dive in and see what’s new.</p><p>Victor Perevertkin (Extravert-ir) has accomplished major rewrites to the Plug and Play Manager in the ReactOS kernel.\nWith these changes, ReactOS now has the ability to run more third party drivers and to boot from USB devices.\nThis also allows ReactOS to boot on chipsets with EHCI, OHCI, and UHCI controllers.\nThis work is a stepping stone to ReactOS being truly compatible with vendor drivers for the Windows operating system.</p><p>Johannes Anderwald (janderwald) solved an issue where the USB driver would enter an infinite loop when a USB device would not enter the ready state.\nFixing this infinite loop allowed ReactOS to boot on more hardware.</p><p>Thanks to the work of Oleg Dubinskiy, 0.4.15 features many audio improvements.\nOleg added support for more audio formats, looped playback of wave files, higher sample rates, and multiple output channels.\nIn addition, Victor Perevertkin imported the open source AC’97 driver from the Windows Driver Kit (WDK).\nThis enables sound out of the box in VirtualBox when the virtual machine is configured to use the ICH AC’97 Audio Controller and various motherboards from 2004 and earlier.</p><h2>Memory Manager and Cache Controller</h2><p>Section Objects have been refactored by Jérôme Gardou (zefklop) for better compatibility with Windows.\nThis fixes a long-standing bug preventing executables from starting in remote locations, such as network shares or virtual machine shared folders.</p><p>Because of improvements in the memory manager and cache controller, we can now import the open source Microsoft FAT filesystem driver from the Windows Driver Kit (WDK).\nThis FAT filesystem driver is a huge improvement from the old one, which was slower and less stable.\nAdditionally, external drives with FAT filesystem can now be properly ejected thanks to this new driver.</p><h2>Registry Healing and Caching</h2><p>Fundamental mechanisms of the system registry have been implemented courtesy of George Bișoc (GeoB99).\nThese mechanisms include registry healing, flushing, and caching.\nRegistry healing and flushing are both designed to improve system stability when faced with an unexpected power outage or a crash.\nHealing applies appropriate fixes to a corrupted registry and flushing periodically writes registry changes to the disk, ensuring registry changes persist even if the system is not cleanly shut down.\nCaching improves performance when accessing it.</p><p>George Bișoc also improved the Security Subsystem (Se) of the kernel.\nPrior to George’s work, kernel access checks always passed, allowing anyone to access any system object.\nNow, kernel access checks are fully functional and prevent unauthorized access to system objects.\nAs a result, the Windows kernel now works with the vast majority of modules from ReactOS.</p><p>Katayama Hirofumi MZ (katahiromz) has been hard at work making quality of life improvements, performance enhancements, and new features in system accessories such as the text tool in Paint and the “Now Printing” dialog in Notepad.\nKatayama Hirofumi MZ has also improved the Input Method Editor (or IME), which is a component that types characters not originally present on the connected input devices by using a sequence of characters.\nHis work improved CJK support and allows for the installation of custom IMEs for different locales. For example, Japanese ReactOS can now utilize MZ-IME Japanese input.\nWhindmar Saksit (whindsaks) made several bugfixes to improve the stability of RAPPS and Hermès Bélusca-Maïto (HBelusca) implemented a minimal view mode for RAPPS for uninstalling programs.</p><div itemscope=\"\" itemtype=\"http://schema.org/ImageGallery\"><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/project-news/reactos-0415-released/ime.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/project-news/reactos-0415-released/ime.png\" alt=\"Japanese input with MZ-IME and CJK font\"></a><figcaption><p>Japanese input with MZ-IME and CJK font</p></figcaption></figure></div><p>In 0.4.15 the graphical shell was improved by several contributors.\nCarl Bialorucki (cbialorucki) added support for large taskbar icons.\nMark Jansen (learn-more) added native ZIP archive support.\nDoug Lyons (DougLyons) made several fixes to address an issue where incorrect icons were displayed in programs such as Microsoft Office 2000, Microsoft Visual Basic 6, and Hoyle Cards.\nKatayama Hirofumi MZ added support for the “Internet Browser” icon on the desktop.\nIn addition, Whindmar Saksit made several bugfixes to improve the stability of Shell32, a critical component of the ReactOS shell.</p><div itemscope=\"\" itemtype=\"http://schema.org/ImageGallery\"><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/project-news/reactos-0415-released/large_taskbar2.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/project-news/reactos-0415-released/large_taskbar2.png\" alt=\"Large taskbar icons\"></a></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/project-news/reactos-0415-released/zip_extract_wizard2.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/project-news/reactos-0415-released/zip_extract_wizard2.png\" alt=\"ZIP extraction wizard\"></a></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/project-news/reactos-0415-released/zip_virtual_folder2.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/project-news/reactos-0415-released/zip_virtual_folder2.png\" alt=\"ZIP virtual folder\"></a></figure></div><p>In this release, we also decided to set the default visual style and wallpaper to Mizu.\nMore visual styles and wallpapers are available in RAPPS.</p><p>ReactOS is a community of people focused around the Windows ecosystem and free open source software.\nIt includes various projects to research and document Windows internals, use Windows software in a free enviornment, and make life easier for the broader Windows developer community.</p><p>0.4.15 was branched 6 months ago.\nSince then, many new and exciting features have been worked on in the master branch.\nUEFI support, symmetric multiprocessing (SMP), a new graphical installer, a new NTFS filesystem driver, power management, and newer application support are just a few features being worked on.\nWe are excited to share this journey with you as ReactOS improves and matures.</p><p>Resolved Jira issues: 1,319</p><p>Oldest Jira issue resolved: <a href=\"https://jira.reactos.org/browse/CORE-1091\">CORE-1091</a> from 19 December 2005</p>","contentLength":6007,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jhcfbj/reactos_0415_released/"},{"title":"Introducing two new open source PebbleOS watches!","url":"https://ericmigi.com/blog/introducing-two-new-pebbleos-watches","date":1742642118,"author":"/u/B3_Kind_R3wind_","guid":577,"unread":true,"content":"<p>We’re excited to announce two new smartwatches that run open source PebbleOS and are compatible with thousands of your beloved Pebble apps. </p><ul><li> has an ultra crisp black and white display, polycarbonate frame, costs $149 and starts shipping in July.</li><li> has a larger 64-colour display, metal frame, costs $225 and starts shipping in December.</li></ul><p>Both are available in limited quantities, with worldwide shipping. Prices are in USD. Pre-ordering is the only way to get one - they will not be sold in stores. Pre-order today at <a href=\"http://store.repebble.com/\">store.rePebble.com</a>!</p><h2>Why are we making new Pebble-like smartwatches?</h2><p>Pretty simple - because we want one! No company has made a perfect smartwatch for people like <a href=\"https://www.youtube.com/watch?v=lKie-vgUGdI\">us</a>, so we’re going to make the exact smartwatch we want. Read the <a href=\"https://ericmigi.com/blog/why-were-bringing-pebble-back\">full story on my blog</a>, but it comes down to 5 key features:</p><ul><li>Simple and beautiful design</li></ul><p>No smartwatch on the market since Pebble offers this combination of features…until today!</p><p>I think you might recognize this one 😉 It’s almost exactly a Pebble 2, upgraded with modern chips and new tricks. Duo is short for ‘Do-over’.</p><p><em><strong>Similar to Pebble 2, it features</strong></em></p><ul><li>Ultra crisp 1.26” black and white e-paper display</li><li>Runs 10,000+ Pebble apps and watchfaces</li><li>Lightweight polycarbonate frame in two colour options - White or Black</li><li>Water resistant (targeting IPX8)</li></ul><ul><li>30 day battery life (up from 7)</li><li>Linear resonance actuator (quieter and stronger than vibrating motor)</li><li>More reliable buttons (up to 30% longer lifetime in testing)</li><li>Barometer and compass sensors</li></ul><p>Since this watch will look and feel just like a Pebble 2, you can refamiliarize yourself with it via<a href=\"https://www.youtube.com/watch?v=KQh1b_srGM4\"> videos</a>, or<a href=\"https://www.starkinsider.com/2016/10/pebble-2-review-smartwatch-perfected.html?utm_source=chatgpt.com\"> reviews</a>. For people interested in hacking on PebbleOS firmware, we’re offering an optional JTAG connector. I recommend buying 2 units if you want to hack, just in case!</p><p>This is my dream watch. It’s everything Pebble Time 2 was going to be and more! </p><ul><li>64-colour 1.5” e-paper display. Same display as Pebble Time 2 - much more room for text and details (53% bigger and 88% more pixels)</li><li>Runs 10,000+ Pebble apps and watchfaces</li><li>Metal frame and buttons (Black/White and likely a 3rd colour option as well)</li><li>30 day battery life (estimate)</li><li>Flat glass lens (less glare and reflections than Pebble Time family curved lens)</li><li>Water resistant (targeting IPX8)</li><li>Linear resonance actuator (vibrator)</li><li>Standard 22mm watch strap</li></ul><p>The industrial design is closely based on Pebble 2, which I really love. It’s slightly bigger to accommodate the larger display. Both the frame and buttons are made of metal (most likely CNC milled aluminum). More details, including final colour options, will be shared later this year. </p><p>Left: Core 2 Duo - Right: Core Time 2</p><table><tbody><tr></tr><tr></tr><tr></tr><tr><td>6-axis IMU, compass, barometer</td></tr><tr></tr><tr><td><em><strong>Linear resonance actuator (vibrator)</strong></em></td></tr><tr></tr><tr></tr><tr></tr><tr><td>Heart rate, step and sleep tracking</td></tr><tr></tr></tbody></table><p>Each watch runs open source&nbsp;<a href=\"https://github.com/pebble-dev/pebble-firmware\">PebbleOS</a>. This enables all the baseline Pebble features like receiving notifications, timeline, watchfaces, alarms, timers, calendar, music control, basic fitness tracking, etc. </p><p>The really fun part is that most of the existing 10,000+ PebbleOS watchfaces and apps will immediately work on these new watches, though some may try to access web services that no longer exist. Browse the full appstore on <a href=\"https://apps.rebble.io/en_US/watchfaces\">apps.rebble.io</a>.</p><p>Existing apps/faces will show up with a border on Core Time 2 until developers update them, since it has a larger display (200x228 vs 144x168 pixels). Read more about on the <a href=\"https://developer.rebble.io/developer.pebble.com/blog/2016/10/11/Emery-SDK-Beta/index.html\">old Pebble dev blog</a>.</p><p>We will publish a companion mobile app for Android and iOS. My friend and past Pebble colleague, Steve, recently joined us to lead this effort. He’s joining crc32, long-time <a href=\"https://github.com/pebble-dev/mobile-app/actions/runs/13609363513\">Cobble</a> developer, who has been working with me since last summer. We’ll also be working on an updated SDK for creating new PebbleOS watchfaces or apps.</p><p>These watches will be sold exclusively through <a href=\"http://store.repebble.com/\">store.rePebble.com</a>. Due to limited supply of display inventory, both watches will be manufactured in limited quantities. I highly recommend placing a pre-order - we will be manufacturing fewer watches than the number of people who have signed up on rePebble already! A pre-order secures your watch but gives you flexibility if you change your mind - you can get a refund at any time up until your watch ships. </p><p>Left: Core 2 Duo running PebbleOS - Right: Engineering samples</p><p>Schedule-wise,  is quite far along. We’ve already produced dozens of Core 2 Duo watches for testing and development. We’ve tested and confirmed our <a href=\"https://i.imgur.com/HwdTncx.mp4\">button improvements</a>. PebbleOS has been compiled for the new architecture and runs on the watch. All firmware development is open source - you can follow the fun on <a href=\"https://github.com/pebble-dev/pebble-firmware/commits/main/\">Github</a> and <a href=\"https://discord.gg/aRUAYFN\">Discord</a>. Our current schedule calls for shipments to begin in July. </p><p>How are we so far along, given that PebbleOS was only open-sourced in January? Two things helped: a) I took a monetary risk and began product development a bit earlier 😉,&nbsp;and b) we found a supplier who still had inventory of some Pebble 2 components. </p><p>Core Time 2 display lighting up! </p><p>For , we’ve finished component selection, initial industrial and mechanical design, and found sources for long lead time components. Now, we’re in the middle of creating the first prototypes. </p><p>The grand irony of hardware development is that software development is usually the slowest part of the project. Not this time! We’re extraordinarily thankful to Google for open sourcing PebbleOS, which gave us a massive boost.</p><p>We’ll share more details (like Core Time 2 frame colour options) later this year, as we get closer to mass production. Our current schedule shows shipments beginning in December. Follow along on this <a href=\"https://ericmigi.com/\">blog</a>, via <a href=\"https://repebble.com/signup\">email</a>, on <a href=\"https://bsky.app/profile/ericmigi.com\">Bluesky</a> or <a href=\"https://twitter.com/ericmigi\">Twitter</a>.</p><h3>Why were these specific specifications selected?</h3><p>Building a smartwatch is an exhausting (😂) exercise of constraint maximization. Think of it as linear algebra - we’re solving multiple equations with multiple unknown variables. The primary constraint is display selection. This choice governs the size and shape of the physical design, as well as being the component with the most power drain and biggest cost. Other variables are Bluetooth chip (governs: cost, software compatibility, engineering time), factory selection (cost, quality, speed, risk), sensors (power, cost, software), battery (size, battery life, cost) and more!</p><p>Despite what Pebble’s second Kickstarter branding proclaimed, solving this inherently requires compromise. It’s a fine line to walk and generally the data is not 100% known upfront, so it inevitably requires some degree of trusting your gut. </p><p>: we’re adding a touchscreen to Core Time 2. Why? Very specifically, I want to add the concept of ‘complications’ to watchfaces and widgets. Like on Apple Watch, these complications/widgets will show glanceable information like weather, next calendar event, step count, etc. The touch screen adds the ability to tap on the complication and directly open the associated app. This is much faster to use than opening an app via the button menu, and saves your quick launch (long-press on the buttons) for other apps. The touchscreen may be used for other interactions, like swiping to rapidly scroll down a list, but that will be lower priority. </p><p>Core Time 2 will be the first PebbleOS watch to ship with a touchscreen, but not the first that we designed! In 2015, Pebble designed it into a watch called Cutts (or C2) and did some (very) preliminary software development work to integrate a touchscreen into PebbleOS.</p><p>: I’m really excited that battery life will be increased from 7 days to 1 month! This is due to massive improvements in Bluetooth chip power efficiency over the last 10 years. </p><p>: we’re adding this primarily for potential use in apps that benefit from audio output, like a ChatGPT or other AI agent app. It can’t easily be used for making voice calls, since the watches will not support Bluetooth Classic (required for headset profiles), but theoretically someone could write a custom voice calling client (eg SIP or something).</p><p>: neither watch will support smartstraps. Sorry. Most people don’t even remember this feature even existed, which is kinda the answer to why it will not be supported. RIP.</p><h3>You shouldn’t get one if…</h3><p><strong>You need a perfectly polished smartwatch.</strong> This project is a labour of love rather than a startup trying to sell millions of watches. There may be some rough edges (literally). Things will get delayed. Some features will not be ready at launch. Things could break. Things could not last as long as you’d like. The only thing we can guarantee is that it will be awesome and a lot of fun! Every time you look down at your watch, you will smile 🙂</p><p><strong>You’re looking for a fitness or sports watch</strong>. That’s not what we’re making. From what we hear, Garmin watches are great for runners/cyclists/triathletes!   </p><p><strong>You’re comparing this to an Apple Watch</strong>. There is NO way for a 3rd party smartwatch to compete with Apple Watch. Apple restricts 3rd parties in major ways - read <a href=\"https://ericmigi.com/blog/apple-restricts-pebble-from-being-awesome-with-iphones\">my blog post</a> for more information. For example, 3rd party watches on iOS cannot send replies to notifications.   </p><p>These watches are not made for everyone. We want to be upfront with you about what to expect. </p><blockquote><p>Watch images above feature impeccably designed watchfaces from <a href=\"https://ttmm.is/pebble/\">TTMM</a>, including one of my all-time favourites - <a href=\"https://apps.rebble.io/en_US/application/57812aa56c21044501000ed5?query=ttmm&amp;section=watchfaces\">TTMMBRN</a>. Thank you Albert!</p></blockquote>","contentLength":9212,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jh661j/introducing_two_new_open_source_pebbleos_watches/"},{"title":"Firefox: Mozilla is working on Progressive Web Apps (PWA) support","url":"https://www.ghacks.net/2025/03/17/firefox-mozilla-is-working-on-progressive-web-apps-pwa-support/","date":1742641708,"author":"/u/B3_Kind_R3wind_","guid":579,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jh62fx/firefox_mozilla_is_working_on_progressive_web/"},{"title":"This Week in Plasma: 6.4 Improvements","url":"https://blogs.kde.org/2025/03/22/this-week-in-plasma-6.4-improvements/","date":1742625666,"author":"/u/gabriel_3","guid":575,"unread":true,"content":"<p>Welcome to a new issue of \"This Week in Plasma\"! Every week we cover the highlights of what's happening in the world of KDE Plasma and its associated apps like Discover, System Monitor, and more.</p><p>This week Plasma 6.4 continued to take shape, with a number of additional user-visible modernizations and improvements — in particular some nice progress on the topics of keyboard navigation, accessibility, and customizing apps' presentation in launcher menus.</p><p>Added keyboard navigation and interaction to the User Switcher widget's popup. (Marco Martin, <a href=\"https://bugs.kde.org/show_bug.cgi?id=501649\">link</a>)</p><p>KMenuEdit has received a UI modernization, including a simplification of the default toolbar contents, showing a well-curated hamburger menu by default, and adopting modern-style tool view tabs. (Oliver Beard, <a href=\"https://invent.kde.org/plasma/kmenuedit/-/merge_requests/42\">link 1</a> and <a href=\"https://invent.kde.org/plasma/kmenuedit/-/merge_requests/40\">link 2</a>)</p><p>When installing apps in Discover, progress feedback now appears right in the place you were just looking, rather than in the opposite corner of the window. (Nate Graham, <a href=\"https://bugs.kde.org/show_bug.cgi?id=475845\">link</a>)</p><p>Plasma's Calculator widget now announces the calculated result using the screen reader, if one is active. (Christoph Wolk, <a href=\"https://invent.kde.org/plasma/kdeplasma-addons/-/merge_requests/698\">link</a>)</p><p>Improved keyboard navigation for Plasma's Calculator widget; now navigation wraps around on the same row or column. (Christoph Wolk, <a href=\"https://invent.kde.org/plasma/kdeplasma-addons/-/merge_requests/696\">link</a>)</p><p>In System Monitor's table views, you can now press + to select everything, as you would expect. (Arjen Hiemstra, <a href=\"https://bugs.kde.org/show_bug.cgi?id=499112\">link</a>)</p><p>After editing a page in System Monitor, the app now scrolls to show a newly-added row if it would otherwise appear out of the visible area. (Arjen Hiemstra, <a href=\"https://bugs.kde.org/show_bug.cgi?id=499052\">link</a>)</p><p>KWin's \"Dim Screen for Administrator Mode\" plugin is now on by default, helping to focus attention on authentication prompts so you're less likely to miss them or lose them, especially with a cluttered desktop full of stuff. (Vlad Zahorodnii, <a href=\"https://invent.kde.org/plasma/kwin/-/merge_requests/7368\">link</a>)</p><p>OSDs are now consistently referred to as \"OSDs\" in all the places you can disable them. (Nate Graham, <a href=\"https://invent.kde.org/plasma/plasma-desktop/-/merge_requests/2897\">link 1</a> and <a href=\"https://invent.kde.org/plasma/plasma-pa/-/merge_requests/331\">link 2</a>)</p><p>System Monitor now displays something more user-friendly when asked to report the battery charge level of a device whose battery technology it can't determine. (David Redondo, <a href=\"https://invent.kde.org/frameworks/solid/-/merge_requests/204\">link</a>)</p><p>Narrowed the range of data that the Plasma clipboard accepts to be more in line with what it did in Plasma 6.2 and earlier. This prevents Plasma form crashing when copying certain types of content in certain apps. (Fushan Wen, <a href=\"https://bugs.kde.org/show_bug.cgi?id=501623\">link</a>)</p><p>Triggering the system bell a zillion times in rapid succession (e.g. by holding down  in an XWayland-using GTK app; don't do that) no longer freezes the entire system. (Nicolas Fella, <a href=\"https://bugs.kde.org/show_bug.cgi?id=500916\">link</a>)</p><p>Fixed a bug in the Weather Report widget that caused it to fail to save its settings (size, position, even its existence) under certain circumstances when placed on the desktop, rather than a panel. (Marco Martin, <a href=\"https://bugs.kde.org/show_bug.cgi?id=501066\">link</a>)</p><p>The User Switcher widget now lays out text for the username more sensibly, neither getting too big with huge horizontal panels, nor overflowing with not-huge vertical panels. (Marco Martin and Nate Graham, <a href=\"https://bugs.kde.org/show_bug.cgi?id=356603\">link 1</a> and <a href=\"https://invent.kde.org/plasma/kdeplasma-addons/-/merge_requests/712\">link 2</a>)</p><p>Fixed a regression in the new spatial quick tiling code that made global actions to instantly quarter-tile the active window not always work correctly the first time they were invoked. (Vlad Zahorodnii, <a href=\"https://bugs.kde.org/show_bug.cgi?id=501731\">link</a>)</p><p>Fixed a regression that broke pasting numbers into Plasma's Calculator widget. (Christoph Wolk, <a href=\"https://invent.kde.org/plasma/kdeplasma-addons/-/merge_requests/713\">link</a>)</p><p>Fixed a regression that caused the icons of Folder View popups in list mode to be displayed with too much transparency. (Nate Graham, <a href=\"https://bugs.kde.org/show_bug.cgi?id=501797\">link</a>)</p><p>Fixed a bug that caused KMenuEdit to be unable to save changes you made to systemwide-installed Flatpak apps that had previously been customized using the properties dialog. (Oliver Beard, <a href=\"https://bugs.kde.org/show_bug.cgi?id=394476\">link</a>)</p><p>Fixed several minor issues affecting the Media Frame widget, including flickering on image change and not remembering customized popup sizes when living in a panel. (Marco Martin, <a href=\"https://invent.kde.org/plasma/kdeplasma-addons/-/merge_requests/709\">link</a>)</p><p>Non-full-screen screen recordings taken in Spectacle now have significantly higher visual quality when using a fractional screen scale factor. (Vlad Zahorodnii and Noah Davis, <a href=\"https://invent.kde.org/plasma/kwin/-/merge_requests/7322\">link 1</a>, <a href=\"https://invent.kde.org/plasma/kwin/-/merge_requests/7310\">link 2</a>, <a href=\"https://invent.kde.org/libraries/plasma-wayland-protocols/-/merge_requests/99\">link 3</a>, <a href=\"https://invent.kde.org/plasma/kwin/-/merge_requests/7326\">link 4</a>, <a href=\"https://invent.kde.org/graphics/spectacle/-/merge_requests/445\">link 5</a>)</p><p>KDE has become important in the world, and your time and contributions have helped us get there. As we grow, we need your support to keep KDE sustainable.</p><p>You can help KDE by becoming an active community member and <a href=\"https://community.kde.org/Get_Involved\">getting involved</a> somehow. Each contributor makes a huge difference in KDE — you are not a number or a cog in a machine!</p><p>You don’t have to be a programmer, either. Many other opportunities exist:</p><p>You can also help us by <a href=\"https://kde.org/donate\">making a donation!</a> Any monetary contribution — however small — will help us cover operational costs, salaries, travel expenses for contributors, and in general just keep KDE bringing Free Software to the world.</p><p>Enter your email address to follow this blog and receive notifications of new posts by email.</p>","contentLength":4702,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jh2gww/this_week_in_plasma_64_improvements/"},{"title":"Choose Freedom, Not Trialware","url":"https://news.opensuse.org/2025/03/21/choose-freedom-not-trailware/","date":1742594174,"author":"/u/gabriel_3","guid":574,"unread":true,"content":"<p>A few weeks ago, a customer walked into a <a href=\"https://www.bestbuy.com/\">Best Buy</a>, which is a well-known retailer in North America that sells computers, appliances and gadgets of all kinds.</p><p>On a mission to buy a new laptop for a family member, the customer sought something simple, reliable and future-proof. After browsing through the selection, a solid <a href=\"https://www.lenovo.com\">Lenovo</a> laptop stood out; it had good hardware, decent battery life and no unnecessary gimmicks.</p><p>As the customer approached the checkout and began paying for the new laptop, the salesperson turned and asked an unexpected question:</p><p><strong>“Would you like to prepay for Windows?”</strong></p><p>The customer blinked in surprise.</p><p><strong>“These computers you are displaying don’t include Windows?”</strong></p><p> the salesperson responded. <strong>“Windows comes with a 30-day trial offer.”</strong></p><p>Without hesitation, the customer responded firmly:</p><p><strong>“Absolutely not. I’m putting Linux on it.”</strong></p><p>The salesperson hesitated, as if hearing this statement for the first time.</p><p>What many people don’t realize is that in certain regions, antitrust laws require manufacturers to sell computers with an option not to preinstall Windows. This is a response to decades of monopolistic practices, where users were forced to pay for a Microsoft license whether they wanted it or not. Some manufacturers have introduced Linux-preinstalled models or “no OS” options, though these remain relatively niche. In regions without such regulations, like the U.S., Windows-free computers are still uncommon outside of specialized retailers and business contracts.</p><p>Some stores (depending on the country) are legally required to offer a refund for the cost of the Windows license if the customer chooses not to use it. This is, however, rarely advertised. Many people don’t even know they have a choice or that there is a choice for freedom.</p><p>If you’re in the market for a new computer, don’t let the assumption of Windows dictate your purchase. Here’s how you can take control of your computing experience:</p><ul><li><strong>Ask for a non-Windows option</strong>: Many stores don’t advertise it, but some models are available without a preinstalled OS.</li><li>: If your country has consumer protection laws, you might be entitled to a refund for the Windows license if you don’t use it.</li><li><strong>Download and install openSUSE</strong>: Head to get.opensuse.org and choose the version that best fits your needs. Leap for long-term stability or Tumbleweed for the latest rolling updates.</li><li><strong>Enjoy a system without restrictions</strong>: No licensing fees, no activation headaches, and no locked-down software.</li></ul><p>Linux has always been there, unlocked and ready to go.</p><p>So the next time you walk into a store looking for a new computer, remember; you have a choice. And that choice can be freedom.</p><p><small> This is part of a series on <a href=\"https://news.opensuse.org/category/upgrade-to-freedom\">Upgrade to Freedom</a> where we offer reasons to transition from Windows to Linux.</small></p>","contentLength":2785,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jgsozm/choose_freedom_not_trialware/"},{"title":"Davinci Resolved Add ProRes Encode Support on Linux","url":"https://www.newsshooter.com/2025/03/20/davinci-resolve-19-1-4-update/","date":1742592605,"author":"/u/Blackstar1886","guid":578,"unread":true,"content":"<p>Blackmagic Design has released <a rel=\"noreferrer noopener\" aria-label=\"DaVinci Resolve version 19.1.4 (opens in a new tab)\" href=\"https://www.blackmagicdesign.com/support/family/davinci-resolve-and-fusion\" target=\"_blank\">DaVinci Resolve version 19.1.4</a>. The big news is that it adds Apple ProRes encode support on Windows and Linux. Windows users have been waiting for this for a very long time and it will be welcome news for so many people who have had to do work around for years.</p><p>It also features additional software for remote monitoring and utilities for setting up hardware control panels, and it installs Blackmagic RAW Player and Proxy Generator into the applications folder.</p><h2>New in DaVinci Resolve 19.1.4</h2><ul><li>Support for Blackmagic RAW SDK 4.5.</li><li>Apple ProRes encode support on Windows and Linux.</li><li>Support for Samsung Log LUTs.</li><li>Addressed network decode performance for large embedded AAFs.</li><li>Addressed issues with exporting embedded AAFs.</li><li>Addressed audio stutters when recording interlaced media to tape.</li><li>Addressed inspector audio track selections for source multicams.</li><li>Addressed issues decoding some transport stream clips.</li><li>Support for Photon 4.10.8.</li><li>Addressed issue with importing large Dolby audio files.</li><li>Addressed playback delay after import for large Dolby audio files.</li><li>Addressed issue with default ISO selection for Canon RAW clips.</li><li>Addressed centre crop issue playing back ARRI RAW clips.</li><li>General performance and stability improvements.</li></ul><p>The free version of DaVinci Resolve 19 includes the same high-quality processing as DaVinci Resolve 19 Studio and can handle unlimited-resolution media files. However, it limits project mastering and output to Ultra HD resolutions or lower and only supports a single processing GPU on Windows and Linux.</p><p>If you need features such as support for multiple GPUs, 4K output, motion blur effects, temporal and spatial noise reduction, multiple AI-based tools, HDR tools, camera tracker, voice isolation, surround sound and immersive audio, multiple Resolve FX, 3D stereoscopic tools and remote rendering, upgrade to <a href=\"https://www.bhphotovideo.com/c/product/1196612-REG/blackmagic_design_dv_resstud_davinci_resolve.html/BI/7759/KBID/8285/DFF/d10-v21-t1-x1288059/SID/DFF\">DaVinci Resolve 19 Studio</a>. ($295 USD)</p>","contentLength":1884,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jgs3ue/davinci_resolved_add_prores_encode_support_on/"}],"tags":["dev","reddit"]}