{"id":"8bTEcWm","title":"COVER","displayTitle":"COVER","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Sharing the Same Joy Worldwide: What Does Localization Look Like at hololive production?","url":"https://coveredge.cover-corp.com/en/list/3520","date":1764212400,"author":"平松梨沙","guid":1451,"unread":true,"content":"<h2>The Wide-Ranging Work of Localization</h2><p>Content localization refers to the process of adapting content created in one country or region so it resonates naturally with users in another language or cultural setting: it is more than simply translating words. The role of our Localization Team requires an understanding of local customs, cultural context, regulations, and values, and adjusting expressions so the overall message feels authentic and reaches the audience effectively.</p><p>Our Localization Team is made up of around ten members, covering a wide range of languages – English, Indonesian, Spanish, Korean, and both Traditional and Simplified Chinese. Each language has its own in-house specialist, who also works with a network of freelance translators. The team is also supported by our subtitle production staff, who take care of technical tasks such as “spotting,” the process of working out when subtitles should appear on screen.&nbsp;</p><h3><strong>Examples of Content We Localize</strong></h3><ul><li>Videos on the official channel (including the 3D animated series “holo no graffiti” (hologra), variety segments, short videos, etc.)</li><li>The manga series “hololive Alternative” (including “Yamato Phantasia,” “Vesta de Cooking,” and “Underworld Academy Overload!!”）</li><li>Subtitles for Blu-ray versions of real-life concerts</li><li>Talent voice pack content</li><li>Individual talent projects (e.g., “Legend of Polka” by Omaru Polka; members-only four-panel comics of Tsunomaki Watame, etc.)&nbsp;</li></ul><h3>&lt;Example&gt; How We Localize hologra</h3><p>1.Subtitle staff does the spotting for the episode2.A script is prepared in a spreadsheet ready to be translated<p>3.Translators for each language are assigned to input their translations(English, Spanish, Indonesian, Korean, Chinese, Thai subtitles)</p>4.Localization staff for each region review and refine the translations<p>5.Once everything is checked, the finalized version is used to create the subtitles</p></p><h3>&lt;Example&gt; How We Localize hololive Alternative Manga</h3><p>1.Japanese dialogue and sound effects are translated by localization staff or by external translators, who create the initial draft2.The translated text is inserted directly into the manga panels<p>3.The Japanese and translated versions are reviewed side by side, and necessary adjustments are made</p>4.Finally, our team carries out a Linguistic Quality Assurance check to ensure there are no typos or missing lines/sound effects.&nbsp;</p><h2>From NARUTO to GTO: How Entertainment Sparked Journeys to Learning Japanese</h2><p>Quietly supporting COVER’s global expansion behind the scenes are two members of the Localization Team with whom we sat down for this interview: team leaders Sriram Gurunathan (also known as Ram) and Natalia Solichin, who oversee English and Indonesian respectively.</p><h3>――When did you both come to Japan, and when did you start working at COVER?</h3><div><div><p>I came to Japan from Indonesia seven years ago. After spending a few years studying Japanese, I worked at a gaming company where I handled translation and localization for social games before joining COVER in 2024.</p></div></div><div><div><p>I arrived in Japan later than Natalia. I’m originally from India, and I began working with COVER around 2019 as a freelance translator from my home country. I was set to join the company in 2021, but the pandemic made it impossible to travel. Once I finally received permission to enter Japan, I moved here and officially joined the company in May of 2022.</p></div></div><h3>――Since you’re from India, is Hindi your first language?</h3><div><div><p>No, my first language is English. In India, English is one of the official languages, and many school curriculums are taught entirely in English, including mine.India has more than 450 regional languages – some similar to one another and others completely different. Even distances as close as Tokyo and Kanagawa can see people speaking entirely different languages, not just different dialects. As my father’s job required us to move frequently, I spent my childhood relocating to all kinds of places and each time we moved, I had to learn a new language. Looking back, I think that experience really strengthened my ability to pick up languages.</p></div></div><h3>――What inspired you both to start learning Japanese?</h3><div><div><p>Japanese pop culture is hugely popular in Indonesia. I grew up watching manga and anime like “Doraemon” and “NARUTO,” and that naturally made me curious about the country they came from. At one point, I even tried playing a NARUTO game without understanding any Japanese and as I kept playing, I slowly started to recognize katakana – mainly because the character names were written in katakana.&nbsp;</p></div></div><h3>――That’s very true. The first names of Naruto, Sasuke, Sakura, and Hinata all appear in katakana, don’t they?!</h3><div><div><p>Exactly. That’s actually how I ended up learning Japanese: I started with katakana before moving on to hiragana, and then kanji.&nbsp;</p></div></div><div><div><p>I’ve never met anyone who learned Japanese in that order! Most people start with hiragana, then katakana and after that kanji.&nbsp;</p></div></div><div><div><p>It probably is a little unusual (lol). Even after that, I continued consuming other Japanese works that had been translated into Indonesian, but there were no translated versions of things such as (self-published works), and there were some that I really wanted to read, so that pushed me to start studying Japanese more seriously.</p></div></div><div><div><p>That’s actually a pretty common pattern among overseas  learning Japanese (lol). About ten years ago, it was normal to wait six months to a year for the English versions of Japanese content to come out, so a lot of fans started learning Japanese simply because they wanted to read or watch things as soon as they could.&nbsp;In my case, the first Japanese show I ever watched was GTO, the one starring Takashi Sorimachi. I watched it with English subtitles and got completely hooked. After that, I spent the next seven years devouring all kinds of Japanese content and eventually, I could understand about 70 percent of it and that’s when I decided to start studying the language more seriously.</p></div></div><h2>Bringing Out Each Talents’s Charm Through Translation</h2><h3>――What are some of the challenges you face when localizing Japanese content?</h3><div><div><p>One challenge is translating expressions that are commonly used in Japanese but don’t exist in Indonesian. For example, phrases like “” or “” don’t have direct equivalents. So I adjust them depending on the context – sometimes as a greeting, or sometimes as a message of appreciation.&nbsp;</p></div></div><div><div><p>Right. Instead of translating the words literally, we focus on what the phrase means in that specific situation and choose the wording that fits best.&nbsp;</p></div></div><div><div><p>That’s right. Another challenge is translating Japanese onomatopoeia. Manga often uses sound effects as if they were dialogue, like “rero-rero” for licking or “sara-sara” for the sound of writing. But in Indonesian, those kinds of onomatopoeia feel very unnatural. So in those cases, I usually rewrite them as descriptive sentences instead of trying to recreate the sound.&nbsp;</p></div></div><div><div><p>When I first started translating, I remember wondering what “” means in expressions such as “” (staring intently). Japanese onomatopoeia can be tricky even when translating into English.</p></div></div><h3>――Content from hololive production seems especially challenging to localize, since each talent has their own unique way of speaking and distinct character.&nbsp;</h3><div><div><p>That’s true. hologra, in particular, is a comedy-style show with lots of wordplay in Japanese, so localizing it can be quite tough.&nbsp;</p></div></div><div><div><p>Comedy… I’m not sure that’s the right word (lol). To me, it feels more like “(nonsense humor)” – the kind of charm that comes from things being slightly nonsensical. For example, the maid cafe episode was absolute chaos.</p></div></div><h3>――You’re talking about the <a href=\"https://www.youtube.com/watch?v=z9L9YL2NVkw\">“U Maid?”</a> episode, right?</h3><div><div><p>It was the episode where Shirakami Fubuki, La+ Darkness, and Omaru Polka – classic old-school otaku types – dote on FUWAMOCO (Fuwawa Abyssgard and Mococo Abyssgard), who are dressed as maids. The whole thing was filled with otaku slang and internet memes like “, “,” and “.” There was no way to translate them literally, so I replaced them with English slang and memes that would convey a similar vibe.&nbsp;&nbsp;</p></div></div><div><div><p>For the Indonesian subtitles, I use Indonesian memes instead.&nbsp;</p></div></div><h3>――So, even though the wording wasn’t exactly the same as the original Japanese, you chose English or Indonesian expressions that still have that slightly old-school, otaku-like feel. That sounds like quite a challenge.&nbsp;</h3><div><div><p>Surprisingly, that part was actually pretty easy for me. I’m an old-school otaku myself, so all the phrases just came naturally (lol). Translating otaku terms comes with its own set of challenges, though. Take “,” for example. In English-speaking otaku circles, the word “” is already widely used, so I understand why many people think we should simply keep it as is. But as an official localization team, we want the content to be enjoyable for fans who aren’t necessarily familiar with otaku culture, which is why I intentionally choose words that are easier for a broader audience to understand.</p></div></div><h3>――How would you translate it?</h3><div><div><p>There are expressions like “hot and cold,” but that isn’t really well-received among otaku. They’ll say, “Why does it start with the ‘dere (hot)’ part?” since the whole point of ‘’ is that someone goes from feeling ‘ (cold)’ to ‘ (hot)’. ” So when I translate it, I adjust the wording each time depending on the context.</p></div></div><div><div><p>“” is also tricky to translate into Indonesian. Sometimes I adapt it depending on the context, and other times I add a brief note explaining what “” means.&nbsp;&nbsp;</p></div></div><div><div><p>Adding explanations is another option too. But we’ve been doing it less and less lately because, with entertainment content, it’s important that people understand things instantly, so we try not to make it feel too much like studying.</p></div></div><div><div><p>Exactly. I think it’s all about finding the right balance so the subtitles remain easy to read as part of the content. Indonesian subtitles tend to be longer than those in Japanese or Chinese, so they can easily take up more space. But if viewers are too busy reading the subtitles to enjoy the content itself, that defeats the purpose. So while keeping translations accurate, I try to keep them as short as possible – ideally within two lines.&nbsp;</p></div></div><div><div><p>As the official localization team, we also see it as our role to keep each talent’s image consistent across different regions. In the VTuber community, fans often add their own translations to clipped videos, which creates a culture of many different interpretations. That means a single phrase can end up with multiple translations depending on who’s doing it. For example, take the unique greeting “Tis’ I!” (“Yo dayo~”) used by Nakiri Ayame. Everyone has translated it differently, so by providing an official translation through hololive production’s content, we’re able to offer something that fans can consider a standard translation.&nbsp;</p></div></div><h3>――That makes sense. The words you choose in translation can really shape how a character comes across – cute, serious, playful, and so on. That’s a big responsibility.</h3><div><div><p>Exactly. That’s why we research each talent carefully, including watching their streams, so we can produce translations that feel natural and stay true to their personality.</p></div></div><h2>Sharing the Same Joy Across Languages and Cultures Through Localization</h2><h3>――Is there a project that left a strong impression on you?</h3><div><div><p>For me, it would be the hologra graduation episode for Nanashi Mumei, titled “Memories I Will Not Forget.” It’s the episode where Nanashi Mumei visits other talents before graduating, and there’s a scene where Anya Melfissa from hololive Indonesia prepares a whole stack of stone tablets covered in ancient writing just so Nanashi Mumei can get to know her better. In the scene, Nanashi Mumei reads the ancient inscriptions with ease, which really impresses everyone around her, but in the original script, those “ancient characters” were just random strings of text. I felt that instead of having her read out meaningless letters, having her read the inscriptions in Javanese would give more context to the tablets in relation to Anya’s lore and make the moment feel more authentic.When I pitched this idea, they decided to run with it. I also recorded the Javanese lines for reference and shared them with Nanashi Mumei, who used them during the actual recording. After the episode was released, seeing that fans had noticed and reacted with comments like, “Nanashi Mumei is speaking Javanese!” and “They even localize such small details like that?” made me really happy.&nbsp;</p></div></div><div><div><p>One project that has really remained with me was when I localized the lyrics for Hoshimachi Suisei’s “Stellar Stellar” music video. I translated the English subtitles so they could actually be sung along with the melody, which was quite a challenge. Hoshimachi Suisei once mentioned that she wrote the lyrics after extensively reading The Little Prince, so I wanted the English version to subtly reflect that. Not by stating it outright, but in a way that would make attentive listeners think, “Is this inspired by The Little Prince?” Striking that balance was tricky, but taking a deep dive into the lyrics and searching for the best possible wording made the whole process both challenging and enjoyable.&nbsp;</p></div></div><div><div><p>Translating Japanese song lyrics is pretty difficult, isn’t it?</p></div></div><div><div><p>It is. Even when the lyrics are abstract or don’t specify a subject, they still make sense in Japanese. But that doesn’t work the same way in English or Indonesian – we have to decide who the lyrics are referring to or to whom something belongs. I struggle with that every single time, but music is something people can enjoy regardless of language – it’s universal. And that’s exactly what we aim for as a localization team. So I really want to keep putting energy into lyric localization for music videos moving forward.&nbsp;</p></div></div><h3>ーーHave you noticed any differences in how fans from different countries react to content?</h3><div><div><p>Our job in localization is to minimize those differences. Even if the language they receive is different, the goal is for fans everywhere to have the same experience and the same sense of enjoyment. If there’s still a gap in that sense, it means we haven’t done our jobs well.&nbsp;</p></div></div><div><div><p>Localization is all about making content feel just as natural in different languages and cultures. That’s the challenging part, but it’s also what makes the work so enjoyable.&nbsp;</p></div></div><h3>――Lastly, what do you find most rewarding about working in localization at COVER?</h3><div><div><p>I’ve spent countless hours enjoying Japanese entertainment, and I’m genuinely grateful for all the great moments it has given me. Now, being able to help share that same content with fans around the world feels deeply rewarding.&nbsp;</p></div></div><div><div><p>At COVER, there’s a strong commitment to global expansion, and the Localization Team plays a key role in that. That certainly comes with some added pressure, but when a localization project turns out well, the sense of accomplishment is huge.&nbsp;</p></div></div><div><div><p>It really does come with a lot of responsibility. Since each language has just one person in charge, you feel almost like the representative for that language within COVER. For anyone who wants to take on meaningful, high-impact work, I think this is an incredibly rewarding place to be.</p></div></div>","contentLength":15330,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"From Three-Dimensional Audio to On-Location Recording: Inside COVER’s Voice Pack Projects Showcasing a Different Side of Talents","url":"https://coveredge.cover-corp.com/en/list/3413","date":1763607600,"author":"平松梨沙","guid":1408,"unread":true,"content":"<p>In the Voice Pack Project Team, one staff member takes full responsibility for each project, all the way from the planning stage right through to it going on sale. The process starts with creating a proposal and presenting it internally, and once it gets approved, we send an offer to the talent and move on to developing the script.<p>To go into a little more detail, the staff member in charge also handles things like commissioning jacket illustrations, creating banners for sales pages, and preparing promotional videos and X posts ready for a pack’s release.&nbsp;</p><p>There are two main ways we offer voice packs roles to talents. The first is a survey-based approach. For large projects that involve many talents, such as Christmas or Valentine’s Day, we send out a survey in advance to see who’s interested in participating.</p><p>The other way is then, of course, individual offers to specific talents. We regularly watch all of the talents’ streams and look for those who would be a good fit for a particular project we’re planning. Or sometimes it works the other way around – we see something on a stream and realize “Oh, this talent really likes that kind of theme,” and then create a project based on that.&nbsp;</p></p>","contentLength":1219,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ueda Shuhei, COVER Director, on the Journey Toward Becoming an Essential Presence in the Global Content Industry","url":"https://coveredge.cover-corp.com/en/list/3368","date":1763002800,"author":"cover_hirata","guid":1379,"unread":true,"content":"<p>I believe that our greatest strength lies in the incredible passion of our fans. At hololive production, streaming is at the core of what we do. Those streams ignite enthusiasm among our viewers, which then carries over to music concerts, creating a powerful cycle of energy and connection. At those live events, fans come together again and celebrate a common passion, and that passion continues to spread, building a strong sense of unity throughout the community. The thought of how we can carry that passion forward and make it resonate with fans around the world is incredibly exciting.<p>The atmosphere at trading card game tournaments is a little more subdued than that of live concerts, yet it’s common to see players meeting for the first time start their conversations with a question like, “Who’s your </p>?”, leading to spontaneous interactions among fans. The more touchpoints fans have with each other in different settings, the more the community grows, and that’s where we see exciting chemistry start to build.&nbsp;<p>It’s precisely because of such incredible passion from our fans that we’re able to explore many different business opportunities to attempt to meet their expectations. We took on a new challenge in the trading card game space last year, and starting next fiscal year, we’ll be launching a full-scale game business as well. By responding to our fans’ desire for new kinds of experiences, and by offering opportunities that differ from what we’ve done before, we’re able to create entirely new ways for them to enjoy and engage with our content.&nbsp;</p><p>I’ve been in the entertainment industry for a long time, but I’ve never seen this level of passion anywhere else. Meeting fans in person and feeling their energy firsthand is incredibly inspiring for me. That’s why I make a point to attend every live concert I can, and I also try to visit trading card game tournaments and shop events whenever possible.</p></p>","contentLength":1949,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社（5253）2026/Q2決算分析 増収減益も営業利益は+10.2%会社予想を上振れ、好悪材料が混在［2025.11.11］","url":"https://note.com/karuta54/n/na2d12b5b6755","date":1762879531,"author":"","guid":1376,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社 2026年/Q2決算展望 タレント卒業による業績影響は底打ちを想定［2025.11.3］","url":"https://note.com/karuta54/n/n5e623143e55e","date":1762097407,"author":"","guid":1354,"unread":true,"content":"<p name=\"166e7d98-a8e8-4672-b802-263b5150d8ce\">　2025年11月11日にVTuberグループ・ホロライブプロダクションを運営するカバー株式会社（証券コード：5253）2026/Q2決算発表が予定されております。　当記事ではプレスリリースやIR情報などの公開情報を基に、決算における注目ポイントの事前整理や今後の動向を考察していきたいと思います。</p><a href=\"https://note.com/karuta54/n/n5e623143e55e\">続きをみる</a>","contentLength":408,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Summer Internship 2025: Learning About Business Strategy and Production","url":"https://coveredge.cover-corp.com/en/list/3223","date":1761188400,"author":"cover_hirata","guid":1255,"unread":true,"content":"<h2>What is COVER’s Summer Internship?</h2><p>It was another scorching hot summer this year – how did everyone spend it?</p><p>In mid-August, COVER held a three-day hands-on Summer Internship program designed for students to experience business production and learn how to structure business development through practical exercises. Through the program, participants had the opportunity to experience the actual process of creating new business ideas, particularly in the entertainment industry, and to receive direct feedback from upper management. The internship aims to give students a firsthand understanding of COVER’s approach to business strategy and how new projects are brought to life.&nbsp;</p><p>We spoke with the team in charge of the Summer Internship to learn more about its purpose.&nbsp;</p><p>&nbsp;“The purpose of this program is to give participating students the opportunity to learn and experience the following three key aspects:</p><ul><li>To understand the strategic thinking and processes behind management within the entertainment industry</li><li>To experience the planning and development processes of business projects within the entertainment field</li><li>To gain a firsthand understanding of COVER’s new business creation centered on VTubers, while receiving mentorship and feedback from professionals on-site.&nbsp;</li></ul><p>That’s why, for the Summer Internship 2025, we set a clear goal: to deliver presentations from multiple perspectives and receive direct feedback from the executive team.&nbsp;</p><p>At COVER, the Corporate Planning Division plays a vital role in, not simply coming up with ideas, but bringing those ideas to life, supporting them, putting them on a stable trajectory and ensuring they are profitable. Through this internship, we wanted students to understand the process and approach required to turn a business concept into reality as we believe that understanding this kind of thinking and workflow will serve them well in any career path they pursue – whether as working professionals or as future members of a corporate planning team.”</p><h2>Experiencing Business Production in COVER’s Corporate Planning Division</h2><p>So what exactly did the Summer Internship 2025 look like?</p><p>This year’s program invited nine students, who were divided into teams of three, to take on a three-day challenge in business production.</p><p>Here is how the three-day program unfolded:&nbsp;</p><p><strong>Day 1 ― Group Work Begins</strong></p><p>The program kicked off with an opening meeting, followed by introductions to members of the Corporate Planning Division who would be supporting the students as mentors throughout the internship. After a casual lunch where everyone got to know each other a little better, the mentors gave an overview of COVER’s main areas of business, adjacent industries, and potential markets before students were divided into their respective teams and their group work finally began!</p><p><strong>Day 2 ― Creating Proposals for a  New Business”</strong></p><p>Day 2 began with a quick morning meeting before diving straight into group work. Students were not just merely coming up with business ideas – if they stayed as “pie-in-the-sky” concepts, the experience would not have been quite as meaningful. With guidance from their mentors, students learned how to analyze businesses, design new business plans, and evaluate profitability and risk, as they continued to expand and shape their ideas. The group work continued after lunch, and the day wrapped up with progress reports and feedback sessions as everyone prepared for the final presentations.&nbsp;</p><p><strong>Day 3 ― Bringing It All Together: Presenting Before the Executive Team</strong></p><p>The final day also began with group work after the customary morning meeting. To ensure each group’s well-thought-out business ideas came across clearly, mentors shared tips on how to deliver effective presentations and helped the students refine their proposal materials. At 5 p.m. on the final day, the presentations began with CEO Tanigo and other members of the executive team in attendance.&nbsp;</p><h3>Final Day Presentation Report</h3><p>Summer Internship presentations were governed by three main rules: (1) 15 minutes for the presentation and 5 minutes for Q&amp;A, (2) strict time management, (3) no updates to the materials after submission. With those rules in place, each team arrived early at the venue alongside their mentors from the Corporate Planning Division to carefully go over their presentation materials.</p><p>As the clock neared 5 p.m. and the presentations were about to begin, members of the executive team started to fill out the venue one after another; the interns focused and determined. The session began with each team giving their presentation, followed by Q&amp;A sessions with the executives. After a short break, the event concluded with the awarding of the Excellence Award and feedback from CEO Tanigo.</p><p>Proposals included a social contribution project that utilizes COVER’s motion tracking technology to digitize and pass down the skills of experienced professionals, an immersive theme park concept where fans and talents can go between each other’s worlds, and a digital tabletop figure device designed to enhance and support fans’  activities.</p><p>During the feedback session, executives praised the students for their fresh perspectives and out-of-the-box thinking when coming up with ideas not bound by the conventions of the VTuber industry, as well as the feasibility of their proposals. This&nbsp; also served as the perfect opportunity for executives to share their insights on COVER’s vision for the future and offering practical advice on how to approach business planning.&nbsp;</p><h2>Looking Back on Summer Internship 2025</h2><h3>Feedback from Participants</h3><ul><li>We received feedback from perspectives we’d never considered before. It really made me realize the sincerity behind the advice we were given.&nbsp;</li><li>It was an invaluable experience to hear directly from the company’s top executives.</li><li>Through this experience, I learned that creating a business isn’t just about coming up with ideas. It’s about analyzing successful cases, understanding their core elements, and finding ways to differentiate them. The insights I gained here will definitely help shape my future approach to business.</li><li>I was able to move past surface-level trends for success and develop a more fundamental way of thinking. Getting direct feedback from the executives also helped me understand how real business decisions are made: something that will surely be a major asset in my career.&nbsp;</li><li>The mentoring sessions were especially meaningful. Every conversation was packed with insights and learning.</li></ul><h3>Reflections from the Program Coordinator</h3><h4>On the Final Day Presentations</h4><p>What stood out was how seriously each team considered the question “Why COVER be the one to take on this business idea?”</p><p>Their approaches were truly diverse – some worked backward from COVER’s strengths, others analyzed markets that could be accessed from our existing areas of business, and some made sure their ideas were grounded in solid reasoning to address real-world challenges. Rather than simply envisioning a “New business,” they kept asking themselves what it truly means for COVER to lead such an initiative giving depth and credibility to every proposal, which is what left the strongest impression on me.&nbsp;</p><p>What stood out to me was how each team built their projects around open discussions. Every member’s ideas could be seen in the final presentations – a true reflection of how well they collaborated.<p>We also held a short mid-program sharing session, where each team had five minutes to share their progress, challenges, and proposed solutions. Hearing other teams’ perspectives sparked new ideas and helped participants have a fresh take on their own projects and spot missing elements in their own proposals, expanding the scope of their learning. The sharing session encouraged more open communication within and across teams, which I believe ultimately led to higher quality presentations.</p></p><p>COVER continues to grow under its mission, “Together, Let’s Create Culture Loved by All,” driven by the challenge of elevating VTubers into a culture loved by people around the world. COVER’s greatest strength lies in its personnel – professionals from diverse backgrounds in creative, business, and technology, who respect and inspire one another and work together to achieve a common goal.&nbsp;</p><p>This internship offers a special opportunity to experience the passion and business innovation that drive COVER.</p><p>We’re excited to see the participants go on to create  that inspires people around the world together with COVER!&nbsp;</p>","contentLength":8545,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}