{"id":"8bTEcWm","title":"COVER","displayTitle":"COVER","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"カバー株式会社（5253）2026/Q3決算分析 増収増益・グッズ、ライセンス事業の収益拡大が寄与［2026.2.12］","url":"https://note.com/karuta54/n/nc1ad5d3c359b","date":1770906627,"author":"","guid":1819,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社による米国での著作権侵害訴訟（「マリアのVTuberにうず」）","url":"https://note.com/rihito_umbrella/n/n38cc964dd47f","date":1770766255,"author":"","guid":1816,"unread":true,"content":"<p name=\"7090e0ed-82c3-4132-a507-9846136f6661\">米国の裁判資料を検索していたら、おもしろい資料を見つけたので、紹介します。</p><p name=\"a51246c1-80f3-4bc5-9765-78f93c2a4cf8\">VTuberプロダクション「ホロライブプロダクション」を運営するカバー株式会社によって米国カリフォルニア州北部地区連邦地方裁判所で、カバー株式会社から日本に居住する男性に著作権侵害を理由とした訴訟が提起されています。</p><a href=\"https://note.com/rihito_umbrella/n/n38cc964dd47f\">続きをみる</a>","contentLength":438,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社 2026年/Q3決算展望 大型プロジェクト「hololive Dreams」が演出した先高感［2026.2.1］","url":"https://note.com/karuta54/n/neb520b070da9","date":1769931022,"author":"","guid":1784,"unread":true,"content":"<p name=\"166e7d98-a8e8-4672-b802-263b5150d8ce\">　2026年2月12日にVTuberグループ・ホロライブプロダクションを運営するカバー株式会社（証券コード：5253）2026/Q3決算発表が予定されております。　当記事ではプレスリリースやIR情報などの公開情報を基に、決算における注目ポイントの事前整理や今後の動向を考察していきたいと思います。</p><a href=\"https://note.com/karuta54/n/neb520b070da9\">続きをみる</a>","contentLength":407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Creating a Place Where Talents Shine the Brightest: The Role of a Talent Manager","url":"https://coveredge.cover-corp.com/en/list/4071","date":1769655600,"author":"COVER_iwasaki","guid":1771,"unread":true,"content":"<p>Yes. To be honest, these initiatives stemmed from a strong reflection that, as the organization expands rapidly, the systems in place to support talents were unable to keep up with that growth.&nbsp;Until now, hololive production has grown through close collaboration built on deep, one-on-one relationships of trust between talents and their managers. However, when information is contained solely within these “close relationships,” a challenge emerges: as the scale of activities expanded, it became difficult for the organization as a whole to provide swift backup support.&nbsp;<p>There were, in fact, instances in which delayed the sharing of information, such as that concerning the physical condition of the talents, or the response to unexpected situations, resulted in critical feedback that our responses had been “too slow.” We take such feedback very seriously. By relying too heavily on the passion of those on the ground, a single delay ended up placing a significant burden on talents’ physical and mental well-being, as well as on projects themselves. We are determined not to repeat the regret of feeling like the organization could have acted sooner.</p><p>The reforms currently underway aim to appropriately visualize information that the organization should share and collaborate on, while maintaining the trusted relationships between talents and their managers.&nbsp;</p>While strictly managing the privacy that must be protected, we are moving quickly to establish a system that allows necessary information to be shared in real time with teams and specialized divisions. The introduction of a database and new coordinator positions are not merely about improving efficiency, but&nbsp; of our resolve to ensure that the entire organization has an accurate understanding of each talent’s situation, and can swiftly unite to protect and support them when necessary.</p>","contentLength":1869,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[hololive ID 5th Anniversary] Behind the Scenes of “Chromatic Future”: Nine Talents, One Bridge from Indonesia to the World","url":"https://coveredge.cover-corp.com/en/list/4013","date":1769050800,"author":"cover_hirata","guid":1760,"unread":true,"content":"<p>Across hololive production as a whole, many initiatives are designed to reach audiences both inside and outside of Japan. The Japan-based members, for example, aren’t labeled as “JP,” and hololive English is grouped not by geography, but by language. In that context, hololive ID may sometimes be perceived as a group with a more limited regional focus. In reality, however, that isn’t the case at all.&nbsp;One of the defining characteristics of people in Indonesia is that many grow up exposed to multiple languages from an early age, in an environment that readily embraces diverse cultures. hololive ID talents share these same foundations. Their interest in and understanding of different cultures has allowed them to develop a level of fluency in languages such as Indonesian traditional language, and more, and to use these languages naturally across their streams and musical activities. By incorporating multiple languages and cultures, the talents are able to express themselves much more artistically and, because of this underlying potential, I feel that hololive ID has been able to strike a flexible balance between catering to global audiences and local viewers. Their ability to bridge different cultures and values, combined with a high level of adaptability, is perfectly suited for international activities, and I see it as one of hololive ID’s greatest strengths.&nbsp;</p>","contentLength":1391,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}