{"id":"8bTEcWm","title":"COVER","displayTitle":"COVER","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"Exploring New Possibilities for hololive x Offline Events – A Roundtable with ABEMA and COVER on “Cho-Cho-Cho-Cho GAMERS 2″","url":"https://coveredge.cover-corp.com/en/list/2897","date":1757559600,"author":"平松梨沙","guid":925,"unread":true,"content":"<p>On July 5-6, 2025, hololive GAMERS hosted the real event “hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS 2” (hereinafter “Cho-Cho-Cho-Cho GAMERS 2”) at Saitama Super Arena.</p><p>Organized by the video streaming service ABEMA, the two-day event was a huge hit with 35,000 passionate fans in attendance. In this article, we’ll take you inside Cho-Cho-Cho-Cho GAMERS 2 with an event report and a roundtable discussion between representatives from ABEMA and COVER.</p><h2><strong>A Frenzy of Gaming and Live Performances! “Cho-Cho-Cho-Cho GAMERS 2” Event Report</strong></h2><p>hololive GAMERS – true to their name – is a unit made up of Shirakami Fubuki, Ookami Mio, Nekomata Okayu and Inugami Korone from hololive, a team of talents who all share a deep love for gaming.</p><p>The four members of hololive GAMERS have become the main focal point of this event, with the very first installment, “hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS,” taking place at Yoyogi National Gymnasium in May 2024. It received such an enthusiastic reception that “Cho-Cho-Cho-Cho GAMERS 2” was inevitable.</p><p>The event was structured in two parts: a gaming segment where the talents took on challenges, and a live segment showcasing songs and dances. Day 1 opened with all four members appearing in brand-new outfits to perform their original unit song, “We Are GAMERS !!!,” kicking off the two-day festival in spectacular fashion.</p><p>The four members of hololive GAMERS have become the main focal point of this event, with the very first installment, “hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS,” taking place at Yoyogi National Gymnasium in May 2024. It received such an enthusiastic reception that “Cho-Cho-Cho-Cho GAMERS 2” was inevitable.</p><p>The event was structured in two parts: a gaming segment where the talents took on challenges, and a live segment showcasing songs and dances. Day 1 opened with all four members appearing in brand-new outfits to perform their original unit song, “We Are GAMERS !!!,” kicking off the two-day festival in spectacular fashion.</p><p>The gaming segment started with a massive controller decorated with motifs of the four members appearing on stage. They had a go at “Vivitter,” a game of courage, where Ookami Mio came out on top in the individual round and earned herself a special screenshot moment to strike a winning pose. The excitement continued as Cho-Cho-Cho-Cho GAMERS 2 welcomed “Cho-Cho-Cho-Cho SPECIAL” guests – Nakiri Ayame, Amane Kanata, Himemori Luna, Takane Lui – who joined the hololive GAMERS to take on the 3D puzzle challenge “hololive Treasure Mountain.” While the game is a familiar favorite for hololive fans, the game was updated especially for the event with new background music, character visuals, and voice lines, which all got cheers from the crowd throughout the show.&nbsp;</p><p>The following “Whisper Challenge” was also played in teams, but with the match ending in a draw, all of the talents joined in for a screenshot – perhaps the most rewarding moment for fans. The gaming segment then concluded with the original game “GAMERS BINGO, ” hosted by Takane Lui. With missions ranging from teamwork-based challenges to playful impressions of fellow hololive members, the hololive GAMERS gave it their all to fill in the board, sending the venue into a state of excitement.&nbsp;</p><p>The live segment featured a special medley that combined original songs and covers, capped off with the debut of their new unit track, “To Be Continued…” fully showcasing the appeal of the four members’ as idols, directly to their fans.&nbsp;Day 2 once again opened with “We Are GAMERS !!!!, ” but the gaming content had a completely different look from the first day. The party game Gang Beasts filled the stage with shouts and laughter, with Nekomata Okayu emerging victorious from the contest. The fun did not stop there as “Cho-Cho-Cho-Cho SPECIAL” guests Oozora Subaru, Sakura Miko, Fuwawa Abyssgard and Mococo Abyssgard joined for a “Voice Mimicry Show” where cheers of the audience were recorded on the spot and then recreated by the talents, offering a unique thrill only possible at a real event.&nbsp;</p><p>The most physically demanding challenge for talents had to be “Poko Poko Whack-a-Mole,” where one team swung hammers while the other scrambled to move moles in and out of the wall to avoid being hit, a heated battle that had the crowd on edge. The final game of Day 2 was the “GAMERS QUIZ,” hosted by Sakura Miko, where hololive members struggled with questions such as “Name eight things Sakura Miko likes.” With unexpected twists, the game delivered non-stop excitement right through until its conclusion.</p><p>The live medley on Day 2 offered a fresh twist on the performance from Day 1, with a fresh lineup of songs and each song carrying the members’ heartfelt emotions. Fans answered back by waving their penlights and through call-and-response chants, fueling the powerful performances that marked the climax of the two-day event. Another performance of “To Be Continued…,” rounded out what was a wonderful celebration of hololive and gaming.&nbsp;</p><h2><strong><strong>Behind the Scenes: A Shared Commitment to Creating the Best Experiences and Emotions for Our Audience</strong></strong></h2><h3>&nbsp;―― As you prepared for the second event, what mindset did you both share?</h3><div><div><p>It all started when you (ABEMA) approached us with the idea of hosting an event, right?</p></div></div><div><div><p>At that time, one of our directors had the opportunity to meet with your Gaming Business Development Office. While COVER was already hosting live music events, we felt that introducing a different kind of event could bring something new and exciting to both the talents and the fans. That’s why we proposed an event centered around gaming.</p></div></div><div><div><p>At COVER, we hold “hololive SUPER EXPO &amp; fes.,” our largest annual event, at the end of the fiscal year in March. While it’s a huge highlight across the organization, it also makes it harder to launch equally impactful initiatives in Q1 (April – June). That’s when we realized this project could be a way to fill that gap, and the discussions moved forward from there.</p></div></div><div><div><p>When we first brought up the idea, the venue hadn’t even been decided yet. But as discussions went on, we managed to book two days at the Yoyogi National Gymnasium in May, and as Kodera-san mentioned earlier, the timing worked out perfectly for the company. That’s said, it was a large-scale venue, so I’d say it really was a bold decision on COVER’s part to go ahead with it.</p></div></div><h3>―― From COVER’s side, were there any concerns?&nbsp;</h3><div><div><p>There were, of course, concerns. ABEMA assigned team members who had a strong understanding of the talents, so we were confident in how the content itself would look, but what concerned us was the fact that we had never held a game-focused event before. The biggest question was whether people would actually show up.</p></div></div><h3>――But the fact that a second event took place means the first one must have been a success, right?</h3><div><div><p>&nbsp;We’re grateful to say that both days sold out completely, including the limited-view reserved seats. The response was so overwhelming that it felt like the venue capacity wasn’t quite enough in the end. On top of that, since Ookami Mio had to miss the first event due to health reasons, we also felt strongly about making the second one happen with all the members together. Of course, both talents and fans had the same expectations.&nbsp;</p></div></div><div><div><p>Audience satisfaction was high, but what truly exceeded our expectations was how satisfied the talents themselves were. We were still in a trial-and-error phase for the first event, working out how to collaborate with them effectively while creating a concept and direction. By the second event, however, the talents already had a clear vision of their own, which gave both sides a strong sense of confidence as we moved ahead with securing the venue.&nbsp;</p></div></div><h2><strong>Made Possible by a Strong Partnership Between Both Companies</strong></h2><h3>―― As you prepared for the second event, what mindset did you both share?</h3><div><div><p>Planning for Cho-Cho-Cho-Cho GAMERS 2 began around October to November 2024, and from the outset up until the event, we had weekly online meetings between the two companies. Early on, the discussions focused on the bigger picture regarding the kind of event we’d like to create, and from there, talks gradually moved to specifics: how to structure the gaming segments, how to present the live performances and how to design the stage production and decorations.&nbsp;</p></div></div><div><div><p>Depending on the week’s agenda, some of ABEMA’s participants would change, but overall there were always about 20 people involved. The well-prepared materials ABEMA provided made it much easier to keep things moving smoothly.The strong response to the first event also meant audience expectations were high. How we could rise to that challenge and meet such lofty expectations was a major focus in our discussions with ABEMA. As Kamochi-san mentioned earlier, with all four members able to appear this time, we wanted to reach an even wider audience. While we were still debating the venue, the opportunity to host two days at Saitama Super Arena came at the perfect time.&nbsp;<p>At a venue as large as Saitama Super Arena, there is a considerable distance between the stage and the very back seats. That meant it was crucial to work out what kind of content and stage design to maximize the experience for every audience member. We even made sure to walk around the entire arena with ABEMA, carefully checking the view from every seat.&nbsp;</p></p></div></div><h3>――Was there anything else you focused on specifically for the second event?</h3><div><div><p>This year, we handed out silver streamers and cans of “holocharge!,” hololive’s original energy drink, as guests were leaving. We had many people comment on social media about how delighted they were to receive such gifts, which may seem like a small detail, but we wanted to create a little moment of joy even as the event was ending – and I think it added to the overall experience.&nbsp;Throughout the process, we were always able to come together to discuss how the audience would feel watching each part of the event and what would bring them the greatest amount of joy. I truly believe that this was only possible because we had such a wonderful partner in ABEMA.</p></div></div><div><div><p>Even though we were the organizer, our role was ultimately to work with the brand entrusted to us. That meant our top priority was staying true to the values that COVER and the talents, cares about most. Our entire team made sure to keep that in mind as we prepared for the event.&nbsp;</p></div></div><div><div><p>Another thoughtful touch was ABEMA setting up a small “ shop” (penny candy shop) in the green room. The talents lit up the moment they saw it, playing the lottery games, enjoying the sweets, and chatting together. I felt it really added to their positive energy and mindset going into the event.</p></div></div><div><div><p>There’s always some downtime between rehearsals and the main performance. At the first event, that time ended up being spent just waiting around, but for the second event, we wanted to make it more enjoyable, so we prepared something to help the talents pass the time in a fun way.</p></div></div><h3>――Looking back, what do you feel was made possible because ABEMA in particular was the organizer?</h3><div><div><p>One clear strength was that ABEMA already has a pay-per-view streaming platform, which made it easy to integrate the livestream component smoothly. What also stood out to me was the speed of their proposals. Whether it was about merchandise or program ideas, once we shared our feedback, they would quickly come back with alternative suggestions – and the quality was always impressive.</p></div></div><div><div><p>At ABEMA, we produce a wide variety of programs and events across different genres, so we were able to bring in experience that offered something different from the music-focused events hololive usually holds. From planning and merchandise development to streaming, as well as marketing, promotion, and sponsorship outreach – all areas where the CyberAgent Group has strong expertise – we were able to handle almost everything in-house as one team. Of course, some parts involved support from external partners, but I believe we were also able to contribute in terms of resources.&nbsp;</p></div></div><h2><strong>ABEMA’s Perspective on hololive’s Appeal and Potential</strong></h2><h3>――We’d also like to touch on COVER’s organizational setup. Could you tell us more, Kodera-san, about your department, the Gaming Business Development Office, which is mainly in charge of Cho-Cho-Cho-Cho GAMERS?</h3><div><div><p>&nbsp;Our work mainly falls into three areas: developing games, supporting game creators, and organizing events. Most of these projects begin from scratch, with no set format to follow, so we’re often building the framework ourselves. From my perspective in management, I see every day how the freedom within our department allows members to easily find places where they can make the most of their individual strengths and skills. Of course, creating something from nothing is never easy, but because the team approaches projects with a positive mindset, we’ve always been able to deliver new experiences through gaming – from this event, to the <a href=\"https://coveredge.cover-corp.com/en/list/2502\">Shishiro Hai</a> and even our collaboration with Death Stranding 2.</p></div></div><h3>――How many members are currently part of the Office?</h3><div><div><p>At the moment, there are around 20 of us: when the Office was officially launched in October 2024, there were only four or five of us. With our mission of “Together, Let’s Create Culture Loved by All” in mind, we’re looking toward the global content market and have already begun preparing initiatives for the coming years. The team has been growing rapidly in line with that vision.&nbsp;</p></div></div><h3>ーーThis May, you received the “United without Boundaries” Award at the COVER AWARDS 2024.</h3><div><div><p>We were honored to receive the Project Award for Cho-Cho-Cho-Cho GAMERS 1. The project was carried out through collaboration not only within the Business Development Office but also across many different departments. Our company embraces three core values – “Bold Spirited,” “United without Boundaries,” and “Outcome Driven” – and I believe it was this cross-department collaboration, combined with the new licensing framework with ABEMA, that led to us being recognized for this award.</p></div></div><h3>&nbsp;――From ABEMA’s perspective as a platform that handles not only VTubers but a wide range of IP and culture, what do you see as the appeal of hololive production, including its fandom?</h3><div><div><p>What really stands out to me, watching the talents in their streams and events, is how actively fans engage with one another. At events, you’ll see groups taking photos together, and there’s a strong culture of supporting their  together. I think that sense of community is a big part of why so many people choose to come to these events in person – not just to see the talents, but also to enjoy connecting with fellow fans.&nbsp; I believe this also comes from daily communication via streaming, with the bond between talents and their fans being incredibly strong. Beyond Cho-Cho-Cho-Cho GAMERS, we’ve also collaborated with hololive on projects like “HOLOGOE!” – ABEMA’s original late-night variety show – and even in those settings, you can really feel the warmth of fans rallying to support their . Of course, having such a wide fan base is part of it, but what truly stands out is the high level of passion each individual brings.</p></div></div><h3>――Looking ahead, what possibilities do you see?</h3><div><div><p>Working together, what really strikes me is how each of the talents has a strong personality and unique appeal, along with an impressive ability to promote themselves. At ABEMA, we’d love to continue creating further opportunities, beyond just events, to create new platforms together with COVER where those individual qualities and strengths can shine even more.</p></div></div><h3>■Data：hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS 2</h3><p>◆ DatesJuly 5 (Sat) – July 6 (Sun), 2025</p><p>◆ VenueSaitama Super Arena</p><p>◆ OrganizerAbema TV, Inc.</p><p>&lt;#ChoGAMERS2_day1&gt; hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS 2 (Sneak Peek)</p><p>&lt;#ChoGAMERS2_day2&gt; hololive GAMERS fes. Cho-Cho-Cho-Cho GAMERS 2 (Sneak Peek)</p><p>&lt;Cho-Cho-Cho-Cho GAMERS 2/Digest Video&gt; July 5 (Sat) – 6 (Sun) @ Saitama Super Arena</p>","contentLength":16159,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Popular HoloMyth Member Announces Retirement — And Fans Are Devastated - MSN","url":"https://news.google.com/rss/articles/CBMizwJBVV95cUxPRHd3dE9JRF9wb0hNWE9BbWZoNFVReGtLaXloalJtUFZvVjNJTWxfdHBqYXhfalNmdk1FRkVoV2hhQkVFUmNhSFlNczhVLThZU3VzMm5vVGM2WHdkM1ktZUhoRHNYakFvV1pSTkUwcy1YN3lISlVmVjBjNUYzUWZMYjlXZWRvdXZuZjdydEtRckw5clhJSHZhRGpBZ1dhYXFqRG9wNHZDWjI4NEdYRUpaUTAxWXgxS0otS01Qd1ljLTBVeHplZUdQUzQ2UVRqMlRka1NVODVGMHhXelFGdmpfX1NEMC1BdW9yc3VGY0ZManpXek0xZ2JXNjFaYkxNaTJJOHRpcm1xQzd3clV1eC03UVc5SjlQVXJTN2xCc2tDbk5LWERYeDdBcTBmNGJFLUN2ZWJSODNkbWJSZTU4Q2ZBbkhxME9TTy1OY1B2NW9ZOA?oc=5","date":1757261272,"author":"","guid":897,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"トレーディングカードゲームが株式市場で放つ存在感 ― ブシロード・カバー・タカラトミーのTCG成長戦略","url":"https://note.com/karuta54/n/n839a4bf1ec7a","date":1757219433,"author":"","guid":892,"unread":true,"content":"<p name=\"b2f2e1ce-c63c-46e5-a231-0a86b6e999d3\">　トレーディングカードゲームと聞くと、2023年に注目を浴びたポケモンカードゲームの価格高騰を筆者は想起する。希少性の高いカードを求めて投機的な取引が活発になると、レアリティの高いカードには数千万円もの価格が付き「ポケカ投資」という言葉が広がった。</p><a href=\"https://note.com/karuta54/n/n839a4bf1ec7a\">続きをみる</a>","contentLength":379,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shaping the Future of COVER: Inside Our New Graduate Training Program","url":"https://coveredge.cover-corp.com/en/list/2876","date":1756954800,"author":"cover_hirata","guid":862,"unread":true,"content":"<h2>New Graduate Training: An Effort Backed by the Entire Company</h2><p>At COVER, the New Graduate Training Program is led by the Human Resources Planning team, which is responsible for designing and managing its concept and framework. But bringing the program to life requires the support of many others – dedicated employees at the core of each department, as well as executive offices, division heads, and even our CEO, Motoaki Tanigo.</p><p>It is a company-wide effort that transcends departments and job titles, reflecting the importance we place on nurturing the new graduates.</p><h3><strong>Inside COVER’s New Graduate Training</strong></h3><p>The business skills our program aims to develop fall into two main areas. The first covers the fundamental abilities every professional needs, regardless of role. The second focuses on the technical skills required for specific job functions.</p><p>From their very first day on April 1, new graduates take part in an intensive six-day program designed to build the fundamental abilities every professional needs.</p><p>This year, the training period ran from April 1 through April 8, including the weekend. After training is complete, follow-up sessions will continue every two months until the end of graduates’ second year, with a focus on strengthening logical thinking skills.</p><h3><strong>Six-Day Training Period in April</strong></h3><p>This program is designed to help new graduates make the transition from student life to the professional world. The goal is to update values and ways of thinking formed during their school years, and to build the mindset needed to succeed as a working professional.&nbsp;</p><p><strong>・Understanding the Company</strong>Regarded as the most important part of the program, this training is built on three pillars: understanding the organization, understanding the business, and understanding the flow of commerce. (See the interview with Mr. Hayamizu below for more details on the program itself)</p><p>In this program, members of our back-office teams walk new graduates through the rules, procedures, and systems employees need to know, from administrative paperwork to workplace guidelines. It also serves as an important part of building a deeper understanding of the company.</p><p>As part of this framework, a component called Skill Development is built in to help new graduates acquire the core business skills needed in any role. This program is further divided into two areas:</p><p>This program covers the basics every professional should know – from how to handle phone calls and writing emails to understanding seating etiquette. While chances to learn these skills have become less common in recent years, they can be needed at any time, so by providing this foundation, we help new graduates feel confident and prepared to navigate any situation as working professionals.&nbsp;</p><p>This program introduces the fundamental approaches needed to succeed in any organization, including practices like reporting, communication, and consultation, as well as the PDCA cycle. Delivered mainly through lecture-style learning, it is designed to give new graduates the framework they need to think strategically and achieve results in their work.&nbsp;</p><h2>Starting with the Essential Skills Everyone Needs, No Matter the Role</h2><h3>―For this feature, we spoke with Mr. Hayamizu, who is closely involved in onboarding new employees after they join the company.&nbsp;To start off, Mr. Hayamizu, could you tell us about the work you’re responsible for?</h3><div><div><p>The Human Resources Planning team is responsible for a wide range of human resources initiatives – from designing evaluation systems and onboarding new hires to running employee satisfaction surveys. We’re also in charge of company-wide events, including the annual All-Employee Meeting.<p>Within the Human Resources team, I focus on designing and carrying out training and development programs, including the New Graduate Training Program. When creating these plans, I look at them from a two- to three-year perspective, focusing on how to support employees during the first few years of working life, from the time they first join as new graduates.&nbsp;</p></p></div></div><h3>―It appears that training at COVER covers quite a wide variety of topics, doesn’t it?</h3><div><div><p>That’s right. I also design custom programs aligned with each department’s development goals, as well as various business training sessions for existing employees. COVER first started out in the streaming and content business, but as our scope has expanded, we’ve come to work with people from many different industries,so along with that growth, the skills required have also evolved, and we develop training programs that keep up with changes within the company.&nbsp;</p></div></div><h3>―To jump right in, what was your impression of the new graduates who joined in 2025?</h3><div><div><p>This year we welcomed 13 new graduates, with an even split between men and women. The roles are also evenly balanced – half in creator/engineering positions and half in business – so it feels like a well-rounded group overall.<p>What’s most striking is how bright, connected and proactive they are. During the training sessions, many were the first to raise their hands, sharing their own opinions with confidence while keeping the atmosphere lively and collaborative.&nbsp;</p></p></div></div><h3>―So the April training is designed to give new graduates a solid footing regarding the fundamental skills needed to thrive as professionals, is that right?</h3><div><div><p>That’s right. I think many aspects of basic business etiquette are either seen as unnecessary today or simply not taught anymore. For example, many students these days do almost everything on their smartphones, so some have limited experience working on a computer and have hardly emailed anyone at all, for instance.&nbsp;<p>However, being able to use a computer is still often essential in the business world, and knowing how to properly email others can make a real difference when it counts. Personally, it’s important for new graduates to build these fundamental skills early on, as they’ll become the foundation for leveling up later. I see our graduate training program as a way to raise the market value of our new graduates, and that’s something I keep in mind when designing it.&nbsp;</p></p></div></div><h2>Understanding Stakeholders</h2><h3>―Are there any training programs unique to COVER?</h3><div><div><p>This year, we placed particular focus on the “Understanding the Company” section of the training that I briefly touched on earlier. As COVER’s business model continues to grow and become more complex, we want new graduates to really think about questions such as: <em>Who are our customers? What are we paying for? Who are the stakeholders behind each business? </em>Developing this awareness is something we see as essential.&nbsp;<p>At COVER, our business is built on four main business models: Streaming/Content, Live/Event, Merchandising, and Licensing. For this year’s training, we wanted new graduates to understand each of these areas. To achieve that, we worked with the Corporate Planning Office, which has a cross-sectional view of all businesses, as well as with the heads of the Production Business-related Divisions to help new graduates explore a more fundamental question: What is the VTuber business built on, and what is it ultimately striving for?&nbsp;</p><p>We also asked each of our executive officers to share insights into their respective areas of responsibility – explaining how their organizations are structured and the role each one plays within the company.&nbsp;</p></p></div></div><h3>―So, the Human Resources Planning Team doesn’t just create the program on its own, but collaborates with different departments and divisions to devise training programs.</h3><div><div><p>That’s right. Another area we particularly focused on was “Understanding the Business.” As part of this, we held a “Business Understanding Talk Session,” where senior employees shared stories from projects carried out in 2024. The goal was to help new graduates understand what kind of skills we want them to develop through projects and the mindset we hope they’ll bring to their work. Rather than simply presenting the projects, the speakers talked about how they engaged with stakeholders and what factors ultimately led those projects to succeed.<p>For example, the Creative Production Department, which handles live streaming, gave a lecture on what goes on behind the scenes of YouTube live broadcasts. At hololive production, we stream around 100 live events on YouTube each year, including birthday concerts and generation-wide performances. Initially, our Human Resources Planning team considered framing the session to be about “developing technologies to deliver better streams,” but the Creative Production Department went down a slightly different path: they wanted new graduates to understand the streaming process itself first, which is what their team values most.</p><p>There was also a session that focused solely on the “Shishiro Hai” project. Shishiro Hai is a fighting video game tournament hosted by hololive production talent Shishiro Botan. The project originally began when one of COVER’s sales representatives heard about Shishiro Botan’s desire to host an event of her own, leading them to work together to make it a reality. </p><p>But, of course, a salesperson’s mission is primarily to boost sales figures, so making Shishiro Hai a reality was a gradual process to ensure it would be the best version of itself, needing the approval from managers and alignment with other stakeholders, overcoming one obstacle after another. As a department, we continually have to ask ourselves how we can best turn our talents’ ideas into fully-fledged projects, which is the kind of mindset we hope our new graduates will develop as well.&nbsp;</p></p></div></div><h3>―It sounds like a fascinating program.</h3><div><div><p>It really is. We also had a session on Hoshimachi Suisei’s “Bibideba,” which has surpassed 100 million views, where the team shared how they created strategies to generate hype. Even I, from the business side of things, found myself getting genuinely excited hearing what they had to say. I never want to design a program that feels dull, so I’m always making sure that the content is genuinely enjoyable for all involved.&nbsp;</p></div></div><div><a href=\"https://coveredge.cover-corp.com/en/list/2555\" target=\"_blank\"><div><div><p><img decoding=\"async\" src=\"https://www.google.com/s2/favicons?domain=https://coveredge.cover-corp.com/en/list/2555\">https://coveredge.cover-corp.com/en/list/2555</p><div><h3>An Interview with Shishiro Botan &amp; Project Leader – The Passion and Creative Collaboration Behind Shishiro Hai | COVERedge</h3></div><p>Shishiro Hai, the esports event led by hololive production’s Shishiro Botan, returned for the third time even bigger and better. In this second installment of the COVERedge Shishiro Hai special feature series, we look at what makes the tournament so distinctive, and sit down with Shishiro Botan herself and S, a COVER employee who supported the event, to discuss their shared passion for organizing these kinds of tournaments, what collaboration there was and reflect on the impact the event has had on the business side of things. | COVERedge</p></div></div></a></div><h2>Core Principles: What Defines the VTuber Business?</h2><h3>―Aside from making it enjoyable, what else did you prioritize when designing the training program?</h3><div><div><p>Our new graduate training program took on its current form in 2024. At that time, we discussed its content with management and set a clear goal: to develop new hires into future managers. While also looking 10 to 20 years down the track, we mapped out the skills and knowledge employees should acquire in their second and third years, and then worked backward to define what needed to be covered during their first year. This approach became the backbone of the program.&nbsp;<p>At COVER, employees in their second and third years are expected to step up as project owners – driving initiatives on their own. And it’s not just about taking over existing projects. They’re required to develop the ability to create and execute entirely new ideas from scratch. That, of course, is not an easy task.&nbsp;</p><p>For example, even the most carefully planned project schedule can fall apart when uncontrollable and unpredictable factors come into play. That’s why it’s essential to break down what is required at the very start – clarifying what’s needed in advance if you’re going to take something on, and identifying potential risks. And when you ask other departments for support, you need to clearly communicate what needs to be done, to what extent, and by when.&nbsp;</p><p>When you connect the dots, it becomes clear that managing projects in one’s second year first requires solid foundations from one’s first year, developing skills in defining what’s required and mastering thought frameworks needed to support it. That’s why the first year focuses on developing logical thinking skills, while the second year shifts to a Project Management Training Program designed to equip graduate employees with the ability to see a project through to completion.</p></p></div></div><h3>―It sounds like the training program is designed with the future in mind. How has this year’s program evolved compared to last year?</h3><div><div><p>Last year, the program ran for five days, but this year it was extended to six. The biggest addition was the “Understanding the Company” session, included for the very first time.<p>I imagine many companies include programs to help new graduates understand their business, but at COVER, that kind of content hadn’t been part of our training – and to be honest, I didn’t initially think it was essential either. However, when it came time to design the 2025 program, I realized how important it was for new graduates to gain a clear understanding of the business model because, without understanding the foundation of COVER’s business model, there may be misunderstandings or even a breakdown in trust.&nbsp;</p><p>For instance, every VTuber talent brings their own individuality and creativity, but if employees were to see them merely as character IPs and mistakenly think that talents are only there to help realize their own project ideas, there is a huge risk of losing the trust of not only the talents themselves but also the fans who support them.&nbsp;</p><p>What COVER employees need to be doing is using their professional expertise to take the individuality and creativity of our talents and shape their ideas into something even better for the ultimate fan experience: a mindset every employee at COVER must have. Since new graduate training is about establishing such standards, we felt it was essential to clearly define “the mindset of a COVER employee” and include the “Understanding the Company” session.&nbsp;</p><p>We’re now taking steps to ensure that the standards instilled into this year’s new graduates are upheld by our existing employees as well.</p></p></div></div><h3>―So the new graduate training program has also become a starting point for programs aimed at existing employees, is that correct?</h3><div><div><p>Absolutely. I believe that hiring and developing new graduates is also a way of shaping the culture of our company. With each cycle of recruitment and training, a mindset of passing the fundamentals one was taught to the next generation begins to become ingrained into the fabric of the company. That’s how culture takes root and grows.&nbsp;<p>CEO Motoaki Tanigo has set a goal of making VTuber a part of everyday life worldwide by 2030. To make that vision a reality, it’s vital that we continue to build and strengthen the values and culture that define COVER.</p></p></div></div><h3>―What kind of results have you seen from the new hires after training?</h3><div><div><p>We conducted surveys after the program, and the feedback has been overwhelmingly positive. One new hire shared how, after having a proposal turned down, they broke it down using a logic tree to identify what exactly needed improvement. By doing so, s/he was able to receive more constructive feedback.&nbsp;<p>Managers have also shared positive feedback, including that “they’ve really mastered the basics of business etiquette,” and one new hire even proudly reported that they “handled an issue by recalling what [they had] learned in training!” It’s clear that the program is already making a positive impact.&nbsp;</p></p></div></div><h3>―Looking ahead, what kinds of training programs would you like to implement in the future?</h3><div><div><p>I have two main directions. The first is continuing to build the foundation of our company culture through training and the second being expanding opportunities for skill development. At COVER, we already have a system that supports employees who are eager to learn, but I’d like to raise awareness of it and use it to boost motivation for growth.&nbsp;<p>As for new graduate training, my hope is to eventually incorporate programs where they can work together to create projects. While that may still be a challenge at the moment, expanding hands-on learning is one of my key goals. At the same time, I want to deliver elements of the new graduate training to existing employees as well, so we can further strengthen COVER’s standards across the company.&nbsp;</p></p></div></div><h2>The Fusion of Talent Individuality and Professional Expertise</h2><h3>―If you had to describe what COVER means to you, what would you say?</h3><div><div><p>Hmm, that’s a tough one, but for me, COVER is the fusion of our talents’ creativity and individuality with the professionalism of our employees. In fact, I’m borrowing this expression from Atsuo Nakayama, who has written extensively on the VTuber business.&nbsp;<p>During onboarding for mid-career hires, I always tell them it’s the individuality and creativity of our talents, combined with the professionalism of COVER employees and the support of our many stakeholders, that allows us to provide fans with truly moving experiences. That’s why I believe it’s essential for everyone at COVER to uphold that sense of professionalism at all times.&nbsp;</p></p></div></div><p><sup>Source: Atsuo Nakayama, Creator Wonderland: The Entertainment Revolution in the Land of Wonder and the Dynamic Identity of Generation Z, Nikkei BP, February 26, 2024, p. 211.</sup></p><h3>―Lastly, do you have a message for students currently job hunting, or those who will be in the future?</h3><div><div><p>To those in the middle of job hunting or students, I’d say keep an open mind and stay curious. Some people join us without much knowledge of VTubers, entertainment, or anime, but to create great content as a team, it’s important to make a conscious effort to understand the content you are producing.&nbsp;<p>No matter the industry, having the curiosity to explore different things – regardless of whether you truly like them or not so much – and continuing to learn and absorb new things is an essential quality to thriving in the workforce. I encourage everyone to stay curious and keep having new experiences every day.</p></p></div></div><h3>―Although the Human Resource Planning Team takes the lead, new graduate training is truly a company-wide initiative, with everyone working together to support and invest in the growth of each new hire: a shared commitment that will hold COVER in good stead for years to come.&nbsp;</h3>","contentLength":18674,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Born From Co-Creation: Shishiro Hai and Unrivaled Loyalty","url":"https://coveredge.cover-corp.com/en/list/2777","date":1756350000,"author":"cover_hirata","guid":818,"unread":true,"content":"<h2>Sponsorship Born From Shared Sentiment – Building Excitement for Shishiro Hai Together</h2><p>Shishiro Hai generates excitement that transcends location and dimension by involving both participants and fans alike and this would not be possible without collaborators lending Shishiro Botan a hand. Beyond mere sponsorship, it is a relationship that is not just strictly business but one between Shishiro Hai and each company who share a vision of building excitement for the event together and ensuring viewers are having the most fun possible.&nbsp;</p><p>Introducing sponsors’ products and initiatives needs to be in a form that is entertaining taking into account viewer psychology and context in order for it to have a positive impression and be informative. Shishiro Botan and S both expressed the importance of such designs aimed at consumers for both the sponsors and for viewers.&nbsp;</p><p>Here are some examples of initiatives that have featured during a Shishiro Hai:</p><ul><li>Gift and discount campaigns that are worthwhile for viewers</li><li>Providing stories from even before the event starts to generate festival-like hype</li><li>Special segments that incorporate entertainment elements to keep viewers engaged</li><li>Public viewing locations to experience all the action of Shishiro Hai with others offline</li><li>Creative offerings from current vocational school students</li></ul><p>In fact, through pre-tournament sponsor announcements and PR during the event, there has been no major drop-off in viewer numbers: rather, we have been able to maintain a festival-like atmosphere with continual comments being posted that mention company and brand names. Next, we will go into more detail about some of these initiatives.</p><h2>Event Initiatives and the Hype They Generate</h2><p>VAXEE produced mousepads that featured key visuals from the 1st to the 3rd event, which were reposted about 19,000 times through follow and repost initiatives on X, and posts from appearing players and coaches delighted to receive mousepads of their own amassed a total of 853,000 impressions.</p><p>With HP, the major sponsor of the 3rd Shishiro Hai, we had more correspondence on X from the announcement of their sponsorship right up until the event, including Shishiro Botan posting about her visit to HP headquarters, and also a “(Discount) Challenge Stream” that viewers could participate in, which kept fans engaged right up until the tournament started.</p><p>There are also companies instantly recognizable by fans whose relationship with Shishiro Botan and hololive themselves also became a storyline: for example, Red Bull Japan, of which Shishiro herself is a virtual ambassador. When they were announced as a sponsor of the 1st tournament, we received comments such as “Thank you always” and “(The lion that gives me wings), and after the 3rd event, the convenience store chain Lawson held a campaign offering limited-edition stickers with Red Bull purchases across Japan.</p><p>Shishiro Hai’s first special segment is now always a taste test stream in collaboration with a food/beverage company. Frozen meal delivery service provider nosh has collaborated for all three events, including Dietary Guidance with Shishiro (the 1st Shishiro Hai) and Telepathic Food Reviews! (the 2nd and 3rd events). The comment section was ecstatic to see appearances not normally witnessed, with about 160,000 viewers across all streams, including mirror streams, for the segment during the 1st tournament.&nbsp;Tournament participants also tried the&nbsp; “あえて、®” () range of frozen meals from Ajinomoto, who have recently expanded into the esports industry. For a tournament that can be full of tension at times, these are the perfect segments to unwind and have a good time.</p><p>Public viewings held at esports Challenger’s Park (QTnet) for the 2nd edition of the tournament, and HUB for the 3rd event, with a limited-time drinks selection and bonus coasters available at HUB, gave fans a space to not only watch the tournament unfold live, but also hang out before and after the events.</p><p>Students from the Tokyo Design Technology Center have produced a range of assets and material used for Shishiro Hai including subtitles for participants and interviews, as well as slides shown on stream during the tournament. As well as it being rare and novel for a school to collaborate for a VTuber event as a sponsor, it garnered positive reactions from those in awe of the creative skills current school students have.</p><h2>How Much Students Gained From Shishiro Hai: Tokyo Design Technology Center</h2><h3>――Tell us about what led to starting this initiative with Shishiro Hai, anything in particular that has left an impression and any challenges that have been taken on through this collaboration.</h3><p>What led to working with Shishiro Hai was the visit from hololive talents as guests to our campus open day. We saw the incredible response and interest from high schoolers and students currently attending our school, and strongly felt that collaborations with VTubers can be rather effective for the younger generation in providing new learnings for our students and generating PR for our school.</p><p>What particularly left an impression was how flexibly sponsorship conditions, which were originally meant for businesses, were changed to suit a school like us. This was never just purely a sponsorship arrangement but was structured so that we could be involved with the production of actual material as a practical learning experience for the students who could see the meaning of a school being a sponsor and get true educational value out of the experience. There are also not many cases of a school being a sponsor so it was a truly meaningful experience and one we are grateful to have been a part of.</p><h3>――What learnings, opportunities, and skills have students gained from being involved with an event like Shishiro Hai? Tell us about the response from students and any instances that left an impression.</h3><p>There were so many things students gained from being involved with Shishiro Hai. One of the major things was being able to experience an actual production workflow and the technical level required in the workplace through this project. This is different to other schoolwork in the fact that students were able to develop a real sense of responsibility that their work will actually be used and learnt more practical skills.</p><p>In particular, students gave a lot of positive feedback from working in an environment directly related to an industry that they are aiming to get into, saying that they had a clearer picture of what career path they want to take, which was a huge motivation for them.</p><p><strong>▼Creative works that students produced</strong>(In the red box)</p><h3>――What was the response from viewers and users like? In particular, were there any comments on X or livestream in response to the students’ work that really stood out?</h3><p>We received a lot of kind comments and support in response to students’ work that was actually displayed on stream, which have been a huge source of encouragement for both students and faculty members. The more times we do it as well, we have started to see comments that really feel like viewers are acknowledging our continual efforts, which is really pleasing to see.</p><p>There have also been comments like, “I didn’t know that sponsors could also be educational facilities,” with interest coming from not only viewers but companies in other industries as well. We have recently had more inquiries about other projects connected to student learning and development, and we can receive more meaningful project proposals now that there is more of a prior understanding about the educational goals and intentions that we have.</p><h3>――What do you think about the future potential of educational programs linked with actual entertainment content like Shishiro Hai? What do you as a school expect from or what challenge would you like to take on with respect to Shishiro Hai or similar projects?</h3><p>We feel like the learning potential for educational programs in conjunction with actual entertainment content like Shishiro Hai will really expand. Experiences where you can receive direct feedback from industry professionals and viewers are extremely practical for students and can increase their understanding of what is to come in the future. Through these kinds of initiatives, we hope that it can develop into a system where students can forge a career path in the industry.</p><p>Also, in addition to submissions of design production works, we hope that there are more opportunities to provide similar practical experiences from a project, management and data analysis perspective and we would like to independently create more as well.</p><h2>「A Unique Growth in Loyalty: Shishiro Hai from the Perspective of Shuhei Matsumoto, Producer of Street Fighter 6.</h2><h3>―― What expectations do you have as a publisher after collaborating on VTuber Shishiro Botan’s event Shishiro Hai?</h3><p>There have already been 3 reiterations of Shishiro Hai, but I always feel there is a willingness to try and keep growing the event with the changes made each time. It is evident that this attitude is one of the big reasons that the more times the event is held, the more loyalty from viewers and participants increases. We are extremely grateful that such growth in loyalty has had a positive effect on Street Fighter 6.</p><p>Shishiro Hai is an esports event with a slightly different atmosphere to the more “serious” tournaments that we host such as CAPCOM Pro Tour and STREET FIGHTER LEAGUE. I always think that esports can take any form and wonder what Shishiro Hai has in store for us each time.。</p><h3>――How have you dealt with the ripple effect and response that has come from co-creation projects with Shishiro Botan such as Shishiro Hai?</h3><p>Shishiro Botan has hosted other events featuring Street Fighter 6 besides Shishiro Hai, and each one has been accepted by the fighting game community. As you just mentioned, there has been a huge ripple effect on Street Fighter 6, with a remarkable amount of comments from people who have seen Shishiro’s events and wanted to give the game a go.&nbsp;</p><p>This effect has led to us proposing a collaboration for the release of the AI character  generated from data collected from Shishiro Botan gameplay. This allows players to be able to play against Shishiro, and the already high levels of user loyalty for her have led to an amazing amount of player engagement.&nbsp;</p><h3>――How does CAPCOM, one of the leading fighting game developers for many years now, feel about the potential and value of entertainment such as esports tournaments and gaming streams hosted by VTubers?</h3><p>There is so much potential and huge value in these sorts of events. This is just my personal view, but VTubers continuing to enjoy playing our games only increases their value. Fans want to see their favorite VTuber, or their , having fun playing video games and if they like it and continuing playing so much that they end up hosting gaming events, then they will want to support even more.&nbsp;</p><p>The intentions behind the concept and game modes of Street Fighter 6 are already well-known, and by having VTubers also understand this will contribute to the lasting success of such events rather than them just being a passing trend and make it easier for VTubers to pitch new project ideas. This is when it turns from a mere collaboration into co-creation together with VTubers which I feel holds real value in unlocking new potential for the game.&nbsp;</p><p>What did you think about this three-part special feature on the appeal of and behind the scenes of Shishiro Hai? We have tried to take you behind the scenes at how the event was born and the potential it has created in terms of both business and entertainment.This tournament, which started from Shishiro Botan’s passion for Street Fighter, has led to the creation of a new form of entertainment that pushes the boundaries of esports events through co-creation with many businesses, talents, creators, and, of course, fans.</p><p>We will be bringing you more content on COVER projects and behind-the-scenes looks at other examples of co-creation and the value they bring here on COVERedge, so please stay tuned.</p><p><sup>©CAPCOM* All company names, product names, and service names mentioned on this page are trademarks or registered trademarks of their respective companies.</sup></p>","contentLength":12275,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"VTuber Suisei Hoshimachi Makes Cover of Forbes Japan 30 Under 30 - Anime News Network","url":"https://news.google.com/rss/articles/CBMiwwFBVV95cUxOWkhTU0FmUi1DYTZqcGV6ZHhLSE4yMTN3QXkxYmlBS1VMLVN6b1NJeVRLdWVKS3RhNnQ0Mm9Jb0F6czVNUy1fRk9CcVRydXhMZ3VoNkdXRVNlbkE3SGFJYlVXYTFFUDk0TlhhTThWS3VBa2puVUpKTWJRRHR6OGhOUXFaU2lZTDFNQVE2QTBQMU91eDl0blBVQzNIRnItdTFyYkdLUmZVeVYtUHdaQ28yRFR5ZFR2N0tjV3ZJYXhuTVMwNjg?oc=5","date":1756191600,"author":"","guid":921,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hololive Vtuber Hoshimachi Suisei Makes Forbes Japan 30 Under 30 - Siliconera","url":"https://news.google.com/rss/articles/CBMilwFBVV95cUxPLWNtV3pVMTdvaHlDWmp0QV9OQ25OREZSdmIwejhMQXkyWWZ0Z2ZJRWlERG9EOHVZOGJTV0NVT3JzRTlnaXk1Z2R1RDdyQ0ZxdU9ZaVYtWDQ5TzZ0LXdROW1lLWhaQ2R3by1zTWJCX09SNEtod0MwYU80UXBFeVMxc0NHZ0loYlA2V1JkR0hCOFFiZFRrNFNJ?oc=5","date":1756130400,"author":"","guid":799,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Delivering Experiences – An Interview with COVER’s Deputy Head of Production Planning on Enriching Oshi Culture","url":"https://coveredge.cover-corp.com/en/list/2719","date":1755745200,"author":"cover_hirata","guid":765,"unread":true,"content":"<p>When I think about production planning, I often look to Dr. Clayton Christensen’s “Jobs To Be Done” theory. The idea is that when people buy something, they’re not just seeking the product’s function itself, but something beyond that. A well-known example is the milkshake. People don’t necessarily order a milkshake simply because they’re thirsty. They might buy it to make a long drive less boring, or because they want to be seen as a kind parent who treats their children. In other words, there’s ultimately a state or experience they want to achieve through a particular product – in this case, the milkshake.<p>When we apply this way of thinking to our merchandise, the same holds true. Take acrylic stands, for example. Fans aren’t simply buying them for the sake of owning one – they’re looking for the experiences and value that come after. The same goes for can badges. It’s not just about having the badge itself, but about creating an </p> to show their , posting photos on X and getting likes, or even sparking conversations with new fellow fans. In that sense, the true goal of merchandise is not the item itself, but the experiences and relationships it helps to create.&nbsp;<p>Fans of hololive have a culture of connecting with one another – coming together to cheer on their favorite talents. At events, for example, it’s common to see fans reaching out to each other, gathering and taking photos together. In those moments, merchandise serves as a tool that helps fans connect, which is why, in the end, I see the role of merchandise as providing an experience. It’s not simply about offering merchandise, but about creating moments – feeling closer to your </p>, or sharing a sense of community with fellow fans. Through merchandise, we want to deliver that kind of experiential value.</p>","contentLength":1821,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive Indonesia 5th Anniversary LIVE Chromatic Future: The First-Ever Offline Concert Hits the Stage November 15! | COVER Corp. - カバー株式会社","url":"https://news.google.com/rss/articles/CBMiXkFVX3lxTFA1S3VfSk10UHoxNkxsT3hiX3poM2hoX1AzdHlJSUpjY0EtV0hPOHFhazAyX2R6amJSSF9hdVhYN0dBX0wtODlUVlpKRkVEWkFZQjFGakRZMmlrRUI0MVE?oc=5","date":1755447607,"author":"","guid":738,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Partying with Hololive vtubers is finally possible with an app that is basically VRChat for fans of anime girl streamers - Yahoo! Tech","url":"https://news.google.com/rss/articles/CBMimwFBVV95cUxQRVNUdFZwRmtyX2k5cXlvNVdHOEZCMWRZQ1lISXRnMzhQYlRKY2dNSmNjeTMwbEZLRjRxNFE4ODVQME1HemtOaF9jNVJ4Mk96Q19IbjhMakV1ZVU0QUZzb2hIcXlGaXJyb2pGRXVQVUFTcjRkQkNzMjlXd0Z1WS1VZjVMMmhLNVBkQXhpbkFHa0V4bW9TZXhYR2oyRQ?oc=5","date":1755298041,"author":"","guid":725,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Achieving Creators’ Dreams and Creating a Challenge-Oriented Organization: An Interview with the Head of the Administration Department","url":"https://coveredge.cover-corp.com/en/list/2670","date":1755097200,"author":"平松梨沙","guid":695,"unread":true,"content":"<p>In recent years within the entertainment industry, anime in particular has seen a significant increase in the demand for proper compliance. This isn’t just demanded of us as a publicly listed company, but as the result of a structural shift within the industry as a whole.&nbsp;In fact, the anime market has grown two-fold over the last 10 years to be currently worth over 3 trillion yen, and of this, 1.6 trillion yen is in the Japanese market alone. It is now to the point where anime has lost the ‘Cool Japan’ tag and is now considered to be a major industry on the global stage. However, for a while there, admittedly, our creators were handling excessive workloads, but a report from the United Nations Commission of Inquiry in October 2023 shedding light on labor conditions within the anime industry has garnered international attention on the issue (with discussions reaching the point of whether or not to release details on Netflix, etc.) causing the industry to rethink and apply global standards to traditional working methods that have propped up the anime industry up until now.&nbsp;<p>We are fully aware of these issues having received our own recommendations with regards to the Subcontractor Act in Japan. For our hard-working creators, we need to adopt measures that may be seen as rather strict regulations at times, but this is a necessary path we have to take for the betterment of the industry as a whole.</p>To address this, we are implementing measures such as improvements to workflows and eliminating excessive working hours by working with the Corporate Planning Office in particular to come up with fundamental ways to resolve such structural issues. We also feel like we are coming together as an industry through collaborations with other companies in the industry and media mix projects.<p>As a company at the forefront of the industry, here at COVER we are not content with just simply addressing compliance issues, but rather proactively providing information and making efforts to ensure the steady development of the industry as a whole. This is absolutely necessary to continue to develop Japanese anime and VTubing as an entertainment industry we can be proud of, which includes improving our efforts in ensuring that talents and creators can thrive under sustainable working conditions.</p></p>","contentLength":2313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The virtual idols taking over the internet — and the company betting big on them - AOL.com","url":"https://news.google.com/rss/articles/CBMieEFVX3lxTE1lcWttWjhlQXdoT2pVbDFDeTdwd0o2V1NTckl4OGIwTmJWM21NM2VJbGZNVWNVcWYxMHlLejh2cnlqN3h4dGR1Rk5sNkEyaVZKS1lPSTZLVXpOUG1JVlhDRGt1NHlpUGRBWWF6cXQ3cjloWDVUdnktZA?oc=5","date":1755068400,"author":"","guid":844,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社（5253） 2026/Q1決算分析 先行投資実施もTCG事業好調により増収増益の着地［2025.8.12］","url":"https://note.com/karuta54/n/nf77295fc1541","date":1755013523,"author":"","guid":689,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"カバー株式会社 2026年/Q1決算展望 成長投資が利益水準に与える影響は［2025.8.11］","url":"https://note.com/karuta54/n/n7c6fd92041ed","date":1754901309,"author":"","guid":683,"unread":true,"content":"<p name=\"166e7d98-a8e8-4672-b802-263b5150d8ce\">　2025年8月12日にVTuberグループ・ホロライブプロダクションを運営するカバー株式会社（証券コード：5253）2026/Q1決算発表が予定されております。　当記事ではプレスリリースやIR情報などの公開情報を基に、決算における注目ポイントの事前整理や今後の動向を考察していきたいと思います。</p><a href=\"https://note.com/karuta54/n/n7c6fd92041ed\">続きをみる</a>","contentLength":407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"hololive production and RHINOSHIELD are expanding their collaboration with the new “holonatsu Paradise” collection, starting August 8! | COVER Corp. - カバー株式会社","url":"https://news.google.com/rss/articles/CBMiXkFVX3lxTFB4VllUTWN6ZVF6Ui1PMENVM01mUnFCVjFaMGRBbGhkN2JvMm44UlBOX0otRWVrdHR4NmhCVEtjWVNCeDVJOWF4Mlc4RU54OENzaDF6cDVwY0ZWdXJreWc?oc=5","date":1754652796,"author":"","guid":663,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}