{"id":"8bTEcWm","title":"COVER","displayTitle":"COVER","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"hololive SUPER EXPO 2025 Report [Part 1]: A Festival of VTuber Culture Enjoyed With All Five Senses","url":"https://coveredge.cover-corp.com/en/list/1631","date":1747191845,"author":"cover_yamaguchi","guid":316,"unread":true,"content":"<h2>An Immersive Experience Like No Other at the hololive ARCADE</h2><p>This year’s hololive SUPER EXPO (hereinafter ‘EXPO’) was the fourth time the event has been held. It spanned Makuhari Messe International Exhibition Halls 1 to 6, making it the biggest one to date with about 35,000 people in attendance over the two days.</p><p>The theme for EXPO 2025 was ‘hololive ARCADE.’ It was packed with content, allowing attendees to play, cooperate with, and compete against hololive production members, including at the hololive Amusement Arcade. The EXPO area was split into two: COVER’s booths and the food court located in Halls 1 to 3 and sponsor booths in Halls 4 and 5, which showcased new items, collaboration merchandise, and booths offering a range of experiences.</p><p>Upon entering the event, attendees were welcomed by an entrance that resembled a claw machine, giving the impression of entering an arcade. Once past the gates, fans were met with a vast arcade center and amusement park-like area, where they could immerse themselves in the EXPO world.</p><p>In addition to the booths, the EXPO STAGE offered a full day’s worth of fun. Food was packed with the charisma of the talents, and fans could interact with talents during stage shows through a variety of games, creating a lively atmosphere.</p><h2>Treasuring Unity and Memories: A Diversity of Booths Creating a True Arcade Experience</h2><p>When visiting each unique booth, one could not miss the autographs and messages written by talents and creators. They gave a sense that your oshi was there in person, with queues snaking around the venue and fans eagerly waiting to capture these inscriptions.</p><p>Each booth had an ‘amusement-like experience with hololive members’ concept, providing experience-based content like exhibits where fans could take photos, games, and attractions where fans could enjoy hololive and HOLOSTARS with all of their senses. We dove a little deeper and got a bit of an insight from some of those who were stationed at these booths.</p><p>The OFFICIAL GOODS SHOWCASE was an eye-catching exhibit featuring existing and new merchandise in the style of a series of claw machines. The surrounding speakers played specially recorded messages from talents, making it a place for fans to stop and listen while they observed the unique displays.</p><h4>Q. There were various exhibits at the EXPO, but the new merchandise created a lot of buzz on social media. How did you feel when you saw attendees’ reactions online?</h4><p>When we announced on X that there may be information on new merchandise, I was worried that we might not get the kind of excitement we were hoping for, so I was honestly relieved when I saw the number of reactions we received. I didn’t really expect a queue for our booth, so I was astonished! Many people seemed to enjoy the exclusive voice recordings from the talents, so all the preparation we did felt worth it in the end.</p><h4>Q. Please tell us your thoughts about the exhibits and the difficulties you had to overcome.</h4><p>To tell you the truth, claw machines are not suited for merchandise displays. We had to coordinate with many people to put merchandise that was not claw machine prizes into these machines……! However, I was thrilled that many fans were discussing the new merchandise online along with photos of our booth. It felt like we could work with fans to hype up expectations and excitement.</p><p>Together with the merchandise we showcased, we work hard on developments to keep up with our fanbase, which has grown exponentially over the years. We want to continue using the data we have collected up until now to create merchandise that truly appeals to our fans.</p><h3>②holo Indie &amp; hololive Official Game</h3><p>At holo Indie &amp; hololive Official Game, hololive-related games were exhibited in two sections. The holo Indie section featured numerous fan-made PC games, where visitors could try out popular titles like Treasure Mountain, which has been played by talents on stream. The Official Title Section featured titles jointly developed with commercial game developers, promotional videos were played, and special edition game merchandise was on display.</p><h4>Q. What kind of reactions did fans have?</h4><p>Although we expected many people to visit our booth and prepared accordingly, I was overwhelmed at how long the lines were for the sticker giveaway and play testing, which made me really happy. I also came across a couple of social media posts where people said they had the most fun at the holo Indie booth. To get such high praise despite there being so many wonderful exhibitions and experiences to be had made all the time and effort we spent on this booth even more worth it.</p><h4>Q. Which game was particularly popular? We’d love to hear what the response from creators was like.</h4><p>The playtesting of games played by talents on stream, such as Treasure Mountain, holo8, and holoRun was especially popular. Many people also tried out yet-to-be-released titles, like MYRIAD DEATH and Chrono Gear: Warden of Time. It was also a fantastic opportunity for people who do not play computer games much to learn more about holo Indie games.</p><p>Creators have also expressed their gratitude for being given this excellent opportunity for fans of hololive to try out their games. holo Indie is supported by the innovative work of these creators, so I hope that we can generate more interest in our games among attendees through events like these.</p><p>The booth for the media-mix project HOLOLIVE ALTERNATIVE was an immersive space featuring a series of stunning pieces of artwork. One of the main attractions was the live drawing exhibition from the manga artists* for <a href=\"https://holoearth.com/en/alt/holonometria/manga/yamatokasoukaiitan/ep0/\" data-type=\"link\" data-id=\"https://holoearth.com/en/alt/holonometria/manga/yamatokasoukaiitan/ep0/\">Yamato Phantasia</a>, <a href=\"https://holoearth.com/en/alt/holonometria/manga/soreyukemakaigakko/ep0/\" data-type=\"link\" data-id=\"https://holoearth.com/en/alt/holonometria/manga/soreyukemakaigakko/ep0/\">Underworld Academy Overload!!</a>, and <a href=\"https://holoearth.com/en/alt/holonometria/manga/vestadecooking/ep0/\" data-type=\"link\" data-id=\"https://holoearth.com/en/alt/holonometria/manga/vestadecooking/ep0/\">Vesta de Cooking</a>. Many fans witnessed some amazing illustrations being brought to life in front of their eyes!</p><h4>Q. Please tell us more about the booth’s concept and themes, and any incidents or plans that left an impression on you.</h4><p>We wanted to create a fresh way for people to learn about HOLOLIVE ALTERNATIVE, so we built a booth with an immersive atmosphere. The live drawings from the manga artists were perfected over time, making it something that people could enjoy no matter how often they returned to check on the progress, so I would consider that a success.</p><p>“Even though it was all a first for me, I think I was able to draw a great piece of artwork without any major slip-ups, thanks to the passion of the holoListeners (viewers of hololive) pulling me through. I had so much fun and am thankful for the opportunity to attend EXPO and be a part of such a wonderful experience,” said Kurose Kousuke, author of Yamato Phantasia.</p><h4>Q. Please tell us more about any future developments.</h4><p>In the manga, Underworld Academy Overload!!, a new chapter has started with the appearance of Hakoz Baelz, and Volume 3 of Yamato Phantasia and Volume 1 of Vesta de Cooking were released on May 7th! Additionally, the 2D pixel art action game <a href=\"https://store.steampowered.com/app/3446990/FUBUKI_zero_in_on_Holoearth_HOLOLIVE_ALTERNATIVE/\" data-type=\"link\" data-id=\"https://store.steampowered.com/app/3446990/FUBUKI_zero_in_on_Holoearth_HOLOLIVE_ALTERNATIVE/\">FUBUKI 〜zero in on Holoearth〜 HOLOLIVE ALTERNATIVE</a> is now out on Steam, and we have even more content coming soon, so we hope everyone is looking forward to what’s to come.</p><h3>④hololive Amusement Arcade</h3><p>The hololive Amusement Arcade was a collection of game booths designed to suit the theme of EXPO, where fans could play actual games for the first time at EXPO, posing a new challenge for those in booth development. Fans could challenge themselves to try and get a higher score than what the talents recorded, in games like Hammer Free Fall and holoWars.</p><h4>Q. Please give us an insight into the effort that went into making these games, and what difficulties you encountered.</h4><p>We paid extra attention to making the talents’ presence as realistic as possible to provide an experience where players were essentially “playing with the talents.” This became the booth at this EXPO that had the most input from talents because we had to meticulously create videos and voice recordings for it. Talents also put their ideas into the games and had fun testing them before the event.</p><p>The most challenging part was the safety measures. As games required the swinging of hammers and shooting balls in the pachinko game, we had to consider the safety of those playing and the people around them. We prepared hammers of three different weights, placed safety nets around the booths, and stationed staff all around the booths to ensure proper surveillance. I was really relieved that everyone had fun without any accidents.</p><h4>Q. Was there anything that left an impression on you?</h4><p>As the day wore on, people waiting in line started to cheer on those playing the games and applaud them when they did well. Those heartwarming interactions among fans left a rather deep impression on me. It was truly a sight to see how battered the pedestals used for the games became from everyone putting in their all (lol). I believe that fans were able to create some really fond memories and have so much fun that they left their mark on the pedestals.</p><p>The concept of HOLOSTARS Battle Street was based on watching a fight in a back alley, with a street art-style design inspired by fighting games. Shows started as early as 10 AM, with each show being broadcast live and featuring the talents of HOLOSTARS singing and gaming. Enthusiastic fans were spotted grabbing the best spots in the middle at the front of the viewing area just 10 minutes after doors opened.</p><h4>Q. Please tell us about any incidents or fans that left an impression on you.</h4><p>It would be hard to go past the fans who came to our booth first thing in the morning, eagerly anticipating the shows, some with their handmade happis to support their oshis. Cosplayers visited the booth in all versions of their favorite talents, coming in not just their regular outfits, but exclusive outfits that only featured in seasonal voice packs and events, the latest Starry outfit, and even EXPO2025 outfits. There were even cosplayers with outfits from voice packs that were only announced just weeks prior!It was also amazing to see the interaction between overseas and Japanese HOLOSTARS fans, who were exchanging illustrations and confectionery.</p><h4>Q. &nbsp;Please tell us what you had to pay the most attention to for this EXPO.</h4><p>We made sure that the talents appearing throughout the program did something game battle-related to suit the name of the booth! They not only hosted games among themselves but also got the help of fans using the camera to complete a game together for instance, so that viewers could truly play a part in the games. We put extra effort into making content that made it easy for people who did not know HOLOSTARS to remember the traits of each member.</p><h3>⑥Magical Girl holoWitches!</h3><p>At the Magical Girl holoWitches! booth, a range of mirror maze-style exhibits, and voice recordings from talents made for an extra magical experience. Life-sized standees of talents and photo areas that brought backgrounds from the 3D animated performance “Magical Girl holoWitches! THE STAGE” to life glamorized the booth and the special sticker booths, where one could take photos with their favorite talents, were a highlight among fans.</p><h4>Q. Please tell us about any incidents or visitors that left an impression on you.</h4><p>Many fans came decked out in merchandise and cosplay based on the series, their passion clearly on show, while others carried bags decorated neatly with the badges (called itabags) of their oshi holoWitches, which they lined up for taking photos for social media. There were also those who took the opportunity to get holoWitches cosplayers together: the booth serving as a positive space for the community to interact, which was so rewarding to see.</p><h4>Q. Why did you want to use printed stickers for the booth? Please share any stories related to this project if you can.</h4><p>We had the idea of printed stickers as we thought that they could become a piece of memorabilia that visitors could take home from the experience. In the festival-like atmosphere of the EXPO, there were so many fans who put so much effort into their outfits and brought along their own merchandise, so it was the perfect souvenir for fans to take home as a reminder of their wonderful time spent at the photo booth.</p><p>We put a lot of effort into designing the holoWitches-themed printed stickers, and used scripts that were recorded specially by the talents for the photo booth. Everything was carefully configured and designed just for EXPO2025.</p><h4>Continue reading Part 2 here</h4>","contentLength":12381,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Future of VTubers: Shigeaki Hayashi SVP on the Creative Production Department’s Pursuit of Innovation","url":"https://coveredge.cover-corp.com/en/list/1537","date":1746068400,"author":"cover_hirata","guid":279,"unread":true,"content":"<p>First, the Illustration Production Division is made up of around 20 young staff members who are responsible for designing costumes and creating key visuals. In their personal time, many of them are actively engaged in creative activities, such as sharing their artwork on social media and participating in UGC culture.<p>The Computer Graphic Production Division consists of 3D character and background designers and technical artists, along with creators with strong craftsmanship skills. Many of the team members have experience in game development, and the team features a wide range of experience levels from young professionals to veterans.</p><p>The Production Promotion Division is responsible for project management and livestream operations. The team is made up of diverse members from various backgrounds – including former YouTubers and global talent – who work together to drive the project forward.&nbsp;</p><p>The Livestream Technology Division is responsible for technical supervision, filming, sound, application management, and motion capture. The division is made up of many members who approach studio maintenance, equipment management, and recording with the utmost dedication and care.&nbsp;</p><p>The Livestream Planning Division handles production planning, the creation of variety shows and music live events, and the production of streaming assets. The team includes many specialists in online streaming, particularly on platforms like YouTube, and is made up of youthful, energetic members who are actively driving projects forward.</p><p>The Technology Development Division is made up of developers, quality control specialists, and art engineers. While many of the members come from the gaming industry, the team also includes members with extensive knowledge in AR and VR technologies. Their work covers a wide range of areas, including developing and maintaining apps for talents and studio operations, enhancing the functionality of studio apps, and creating special effects and features used in livestreams.</p></p>","contentLength":2003,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"COVER by Numbers","url":"https://coveredge.cover-corp.com/en/list/1495","date":1746023400,"author":"cover_hirata","guid":298,"unread":true,"content":"<p><img decoding=\"async\" src=\"https://www.google.com/s2/favicons?domain=https://cover-corp.com/en/recruit\">https://cover-corp.com/en/recruit</p><p>COVER Corporation is a next-generation entertainment enterprise that shares content that is uniquely Japanese with the rest of the world—principally through hololive production.</p>","contentLength":212,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"“Creating the Next Generation of Fan Experiences”: The Division Manager of the Platform Division’s Future Strategy Envisioned through Data Analysis","url":"https://coveredge.cover-corp.com/en/list/1428","date":1745463600,"author":"平松梨沙","guid":249,"unread":true,"content":"<p>I joined what is now PwC as a new graduate, where I started in system development for major Japanese companies in the management accounting field, followed by supporting corporate management in organizational transformation, subsidiary acquisitions, and other projects. After that, I decided that I wanted to work in an industry I was keen on, so I moved to a social game company in the entertainment industry.<p>Around 2015, I launched a startup focused on the video business with 1 million yen in funding provided by an investor. At the time, the idea that video content would become mainstream on smartphones was beginning to spread in the startup industry, but only a few investors believed that video would replace television. In that climate at the time, I started by hiring employees, securing early-round funding, and establishing joint ventures with talent management and video production companies.</p><p>After that, when the company grew to 100 employees and Series C funding and building out back-office operations had settled down, I felt a strong desire to take on a business role, so I returned to a consulting firm in a new business strategy role. After joining Mercari, I was involved in business development, marketing, and forming strategic alliances with other platform companies.</p></p>","contentLength":1290,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"From Newcomer to Manager of 100 Million Yen-Level Live Events: What is the Appeal of Arena-Level Project Management?","url":"https://coveredge.cover-corp.com/en/list/1367","date":1744254000,"author":"cover_yamaguchi","guid":184,"unread":true,"content":"<p>Well, I am in a position where I can lead arena-scale live events and projects worth hundreds of millions of yen. I don’t think there are many opportunities to be so deeply involved in projects of this scale in your 20s. Because COVER and this business are still in a growing phase, everyone’s responsibilities are not fixed, allowing those with ambition to gain experience in a wide range of fields.<p>It’s a bit of a cliche, but the sense of accomplishment is also one of its appeals. Live event productions span long periods and involve many challenges. Still, when the event day arrives, and I see the fans’ enthusiasm, I sincerely appreciate the hard work I have put in when I see their smiles. When I spy fans who are happy to be holding merch from a live event that I was involved in, I want to tell them, “I made those!” (lol)</p><p>In addition to making proposals for live productions, another key role of a Live Events PM is to make decisions on the details to move the event forward, so I also find it rewarding to be able to manage projects with a certain degree of decision-making authority.</p></p>","contentLength":1106,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["COVER"]}