{"id":"BRWJ2YmdUFozprkKz1ZEKUaA7rsvNpb43dpSivrpocJ7GMKt","title":"ホロライブ通信","displayTitle":"hololive tsuushin fan blog (JP)","url":"https://hololive-tsuushin.com/feed/","feedLink":"https://hololive-tsuushin.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":50,"items":[{"title":"【速報】戌神ころね、ホンダのeスポーツ大会アンバサダーに2年連続で就任！→本人も「よろしくお願いします」と意気込み「世界の戌神」「今年もきた！」","url":"https://hololive-tsuushin.com/holonews/korone-22/","date":1787929200,"author":"ホロミ","guid":815,"unread":true,"content":"<p>人気VTuberグループ「ホロライブ」所属の戌神ころねさんが、本田技研工業（Honda）が主催するeモータースポーツのグローバル大会「Honda Racing eMS 2025」の公式アンバサダーに、昨年に引き続き就任したことが発表されました。</p><p>このニュースに、ファンからは「2年連続はすごすぎる！」「今年も応援します！」といった声が相次いでいます。</p><p>「Honda Racing eMS」は、世界3地区（アジア・オセアニア、米州、欧州・中東・アフリカ）のトップドライバーたちが地域最速の座をかけて競い合う、本格的なeモータースポーツのグローバル大会です。</p><p>戌神さんは「Honda Racing eMS 2024」でもアンバサダーを務めており、今回で2年連続という大役を担うことになります。</p><p>ゲーム実況で人気を誇る戌神ころねと、世界のHondaとのコラボが再び実現しました。</p><p>2025年8月26日、Honda Racing eMSの公式X（旧Twitter）アカウントが「━ Honda Racing eMS 2025 開催 ━ 昨年に続き『戌神ころね』が公式アンバサダーに！」とポストし、戌神さんのアンバサダー就任を正式に発表。</p><p>あわせて、されるという大会スケジュールも公開しました。</p><p>この公式発表に対し、戌神さん本人も自身のXアカウントで「今年もアンバサダーを務めさせていただきます！よろしくお願いします」と引用ポストし、就任への意気込みを表明しました。</p><p>この就任のニュースに、ファンからは「世界のHondaに認められた女、戌神ころね」「ころさんの影響力すごい！」「これを機にレースゲームに挑戦してみようかな」など、驚きと喜びのコメントがありました。</p>","contentLength":1872,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ】AZKi、ぴあアリーナMMでソロライブ決定！11月19日開催、チケット争奪戦は必至か！？","url":"https://hololive-tsuushin.com/schedule/azki-16/","date":1763478000,"author":"ホロミ","guid":831,"unread":true,"content":"<p>女性VTuberグループ「ホロライブ」から、ファン待望のビッグニュースが飛び込んできました！</p><p>ホロライブ0期生ののソロライブ「AZKi SOLO LiVE 2025 “Departure”」「ぴあアリーナMM」で開催されることが決定しました！</p><p>「ぴあアリーナMM」は、最大で1万人以上を収容できる巨大な会場です。</p><p><strong>【AZKi SOLO LiVE 2025 “Departure” 概要】</strong></p><ul><li>&nbsp;AZKi SOLO LiVE 2025 “Departure”</li><li>&nbsp;2025年11月19日（水） 開場 17:00 / 開演 18:30</li></ul><h3>AZKiの夢と”Departure”に込められた想い</h3><p>AZKiさんは、2018年から活動を続けるホロライブの先輩メンバー。元々は音楽特化のレーベル「イノナカミュージック」に所属していましたが、2022年にホロライブ本隊に移籍し、0期生として活動の幅を広げてきました。</p><p>AZKiさんの魅力は、と、音楽に対するひたむきな姿勢です。これまで数々の楽曲をリリースし、ファン（開拓者と呼ばれています）と共に音楽の地図を広げてきました。</p><p>今回のライブタイトルは“Departure”、つまり「出発」を意味します。これは、AZKiさんがこれまでの活動を経て、さらに大きな未来へと一歩を踏み出す、そんな決意表明なのかもしれませんね。</p><p>「AZKiのソロライブがついに！しかもぴあアリ！？」 「絶対行くしかない！」 「嬉しすぎて涙が出てきた…！」</p><p>といったコメントで溢れかえり、公式ハッシュタグ「#AZKiと未来へ」がトレンドを駆け上がりました。</p><p>現地で熱気を体感したい人はこちら！チケットは抽選販売からスタートします。</p><ul></ul><ul><li>&nbsp;8月29日（金）20:00 ～ 9月14日（日）23:59</li><li>&nbsp;9月25日（木）21:00 ～ 10月5日（日）23:59</li><li>&nbsp;10月19日（日）12:00 ～</li></ul><p>まずは1次先行に申し込むのがおすすめです！期間内に忘れずにローチケのサイトから申し込みましょう。</p><p>「会場には行けないけど絶対見たい！」という人は、配信チケットがおすすめです。</p><ul><li>&nbsp;2025年12月19日（金）20:00まで</li><li>&nbsp;2025年12月19日（金）23:59まで視聴可能！</li></ul><p>アーカイブ（録画）期間が長いので、ライブの後も繰り返し感動に浸れるのが嬉しいポイントですね。</p>","contentLength":2368,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】ハロウィン新企画「魔法少女ホロウィッチ！」が10/31に無料公開決定！豪華声優2名の参加も発表！","url":"https://hololive-tsuushin.com/schedule/witch-4/","date":1761836400,"author":"ホロミ","guid":839,"unread":true,"content":"<p>2025年のハロウィン大型企画「魔法少女ホロウィッチ！THE STAGE」10月31日(金)にホロライブ公式YouTubeチャンネルで無料公開することを発表しました！</p><p>なんと、物語とアニメ、そして歌のライブが一体となった、全く新しいエンターテイメントになるとのこと。さらに、出演メンバーに加えて、の参加も決定しています。</p><p>今回発表された「魔法少女ホロウィッチ！THE STAGE」のポイントは、大きく分けて3つあります。</p><ol start=\"1\"><li><ul></ul></li><li> 今回の企画には、期生の垣根を越えた6名のホロライブメンバーが集結しました！（0期生）（1期生）（3期生）（4期生）（4期生）（5期生）さらに、物語を彩るキャラクターの声優として、プロの声優である（アエル役）と（ラグ役）の参加が決定！ 高橋李依さんは『【推しの子】』のアイ役、悠木碧さんは『魔法少女まどか☆マギカ』の鹿目まどか役などで知られる声優さんです。</li><li> なんと、これだけのメンバーに加えて「Special Guests」がいることも示唆されています</li></ol><p>このサプライズ発表を受けて、SNSではファンから 「メンツが豪華すぎる！」 「無料で見れるなんて信じられない！」 「高橋李依さんと悠木碧さんまで！？」 といった、驚きと喜びの声が上がりました。</p>","contentLength":1456,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ甲子園2025】ついに開催決定！ドラフト会議は8月31日！気になるルールを解説！","url":"https://hololive-tsuushin.com/schedule/holokou/","date":1761404400,"author":"ホロミ","guid":838,"unread":true,"content":"<p>「ホロライブ」の夏の超大型企画、「ホロライブ甲子園2025」の開催が、秘密結社holoX（6期生）の博衣こよりさんの配信でついに発表されました！</p><p>まずは、みんなが一番知りたいスケジュールから見ていきましょう！</p><ul><li> 2025年8月31日(日) 19:00～</li><li> 2025年9月1日(月) ～ 10月22日(水)</li></ul><p>ドラフト会議で各チームのメンバーが決まり、約2ヶ月間の育成期間を経て、10月末に本戦が行われる流れですね。</p><p>そして、今年の大会を占う上で非常に重要になる「ドラフト」「育成」「大会」の3つのルールが発表されました。一つずつ詳しく見ていきましょう！</p><p>今年のドラフトは、戦略と運が大きく絡み合いそうです。</p><ul><li><ul><li>現在活動しているホロライブメンバー（JP/EN/ID/DEV_IS）が対象です。世界中のホロライブメンバーが選手になる可能性があるということですね！</li></ul></li><li><ul><li>1巡目から4巡目までは「入札制」。欲しい選手が他の監督と被ったら、くじ引きで決めます。</li><li>5巡目以降はなんと「ルーレット」で決定！誰がどのチームに行くのか、最後まで分からない展開になりそうです。</li></ul></li><li><ul><li>監督自身や、監督のファンネームを付けた選手でチームを補います。（監督自身は3年目からしか試合に出られません）</li></ul></li></ul><p>選手が決まったら、いよいよ育成スタートです！人気野球ゲーム「パワフルプロ野球」の「栄冠ナイン」というモードで選手を育てていきます。</p><ul><li><ul><li>ゲーム内の時間で「3年間」。2025年にスタートして、2027年の夏大会が終わるまでが育成期間となります。</li></ul></li><li><ul><li>育成をやり直せる「リセット」は20回まで。ただし、20回目で「転生選手」（プロ野球で活躍したOB選手が高校生として登場する強力なキャラクター）が一人もいなかった場合は、出るまでリセットが可能です。</li></ul></li><li><ul><li>ゲームを有利に進めるための特別なアイテムは使えません。ただし、ゲーム内で自然に手に入るアイテムはOK。純粋な育成の手腕が問われます。</li></ul></li></ul><ul><li><ul><li>「勝ち点」で順位を決めます（勝ち:3点、引き分け:1点、負け:0点）。もし勝ち点が同じ場合は、得点と失点の差である「得失点差」で、それも同じなら「総得点」で順位が決まります。</li></ul></li><li><ul><li>9回まで試合を行い、延長は12回まで。コールドゲーム（点差が開きすぎた場合に試合を途中で終了すること）はありません。最後まで逆転の可能性がある、ハラハラする試合展開が期待できますね！</li></ul></li></ul><p>「ホロライブ甲子園」は、ホロライブのメンバーが監督となり、それぞれがドラフトで選んだメンバーでチームを作成。人気野球ゲーム「パワフルプロ野球」シリーズの「栄冠ナイン」モードで選手を育成し、優勝を争う超大型企画です。</p><p>毎年、育成期間中の個々の配信でのドラマや、本戦での予想外の試合展開に多くのファンが熱狂し、夏の風物詩として定着しています。</p>","contentLength":3257,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"天音かなたに会える！10月18日開催のスペシャルトークイベント応募方法を徹底解説【Amazon限定】","url":"https://hololive-tsuushin.com/schedule/kanata-25/","date":1760713200,"author":"ホロミ","guid":832,"unread":true,"content":"<p>大人気VTuberグループ「ホロライブ」4期生の天音かなたさん（愛称：かなたん）のスペシャルトークイベントが、2025年10月18日（土）に開催されることが発表され、話題になっています！</p><p>これは、かなたんのアルバム『Trigger』の発売を記念した特別なイベント。この記事では、「イベントに参加したいけど、どうすればいいの？」「応募方法がよくわからない…」というあなたのために、詳しく解説していきます！</p><p>まずは、気になるイベントの基本情報をチェックしましょう。</p><ul><li><ul></ul></li><li>&nbsp;都内某所<ul><li>※詳しい場所は、当選した人だけにメールで知らされます。</li></ul></li></ul><p>なんと、イベントは2部制！どちらか好きな方に申し込むことができます。そして、なんと言っても最大のポイントは、かなたんにであることです。</p><p>このイベントの発表を受けて、SNSではファンから喜びの声が溢れています。</p><p>「かなたんにリアルで会えるとか夢みたい！」 「絶対に応募する！当たりますように…！」 「このためにCD買う価値がある！」</p><p>など、かなたんとの対面を心待ちにする声が多く見られ、イベントへの期待の高さがうかがえます。</p><p>「もうCD買っちゃったよ…」という人も、「これから買いたい！」という人も、心配は無用です。応募方法と今後のスケジュールをしっかり確認していきましょう！</p><p>まずは、Amazon.co.jpでイベントの応募券が付いた対象商品を購入します。</p><ul><li><strong>【Amazon.co.jp限定】Trigger 通常盤A(イベント抽選応募権付)</strong></li><li><strong>【Amazon.co.jp限定】Trigger 通常盤B(イベント抽選応募権付)</strong></li></ul><p>&nbsp;既に完売している「クリアトレカ付」の通常盤A・BをAmazonで購入した人も、今回のイベントのになります！</p><p>商品を購入したら、に応募フォームから申し込みます。</p><ul><li>&nbsp;Amazon.co.jpで商品を購入した際の</li></ul><p>注文番号は、Amazonの購入履歴から確認できます。この番号がないと応募できないので、必ず控えておきましょう。</p><ul></ul><p>当選者にはメールで連絡が届きます。当落の結果と、会場の詳細が記載されているはずなので、見逃さないように注意してくださいね。</p>","contentLength":2408,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・星街すいせいが10月開催「Coca-Cola X Fes 2025」出演","url":"https://hololive-tsuushin.com/schedule/suisei-42/","date":1760108400,"author":"ホロミ","guid":778,"unread":true,"content":"<p>VTuberグループ「ホロライブ」に所属する0期生の星街すいせいさんが、コカ・コーラ主催の大型音楽フェス「Coca-Cola X Fes 2025」のオープニングアクトを務めることが発表されました！</p><p>XGやCreepy Nutsといった今をときめく超豪華アーティストたちが集結するこのフェスで、すいせいさんがトップバッターを飾るとのこと。</p><ul><li> Coca-Cola X Fes 2025</li><li> 2025年10月11日（土）、12日（日）</li><li> XG, Creepy Nuts, &amp;TEAM, Camilo, ano, なとり 他</li></ul><p>オープニングアクトとは、ライブやフェスの開幕を告げる、とっても重要な役割のこと。</p><p>YouTubeチャンネル「THE FIRST TAKE」にも出演しているすいせいさんが、この大役をどう務めるのか、今から楽しみでなりません！</p><p>また、コカ・コーラはこれまでもホロライブとのコラボキャンペーンを積極的に行ってきました。</p><p>戌神ころねさん（ゲーマーズ）、さくらみこさん（0期生）、白上フブキさん（1期生）、そして秘密結社holoXの総帥であるラプラス・ダークネスさんなど、多くの人気メンバーがコラボしていました。</p><p>発表直後、Xでは「#星街すいせい」「#コカコーラフェス」といった関連ワードがトレンドを駆け上がりました。</p><ul><li>「すいちゃんがオープニングアクト！？すごすぎて鳥肌たった！」</li><li>「リアルアーティストの中に混ざるすいちゃん、カッコよすぎる！」</li><li>「これはVTuberの歴史が変わる瞬間だ…絶対見届ける！」</li><li>「他のアーティストのファンにも、すいちゃんの歌声が届くのが嬉しい！」</li></ul>","contentLength":1738,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"「マイクラ肝試し2025」にふぶみこめっと、HoloX含む総勢15名が大集結！","url":"https://hololive-tsuushin.com/schedule/holodamesi/","date":1758985200,"author":"ホロミ","guid":785,"unread":true,"content":"<p>今年も夏の終わりを告げる大型ホラーイベント「マイクラ肝試し2025 Book of Märchen」の出演者が続々と発表されています。</p><p>中でも9月28日（日）は、人気VTuberグループ「ホロライブプロダクション」から総勢15名が一日を通して出演することが明らかになりました。</p><p>「マイクラ肝試し」は、クリエイターのクー（Coo）氏が主催する、サンドボックスゲーム『Minecraft』内で開催される招待制の大型配信企画です。</p><p>参加者であるVTuberやゲーム実況者たちは、数ヶ月かけて作り込まれた広大で精巧な和風ホラーマップを探検します。</p><p>参加者はチームを組み、MAPに仕掛けられたストーリーを追体験しながら、様々なギミックや突然の恐怖演出に立ち向かいます。</p><p>毎年多くの参加者が見せるリアルな絶叫や、仲間との協力（あるいは裏切り）が大きな見どころとなっており、夏の終わりの風物詩として絶大な人気を誇るイベントです。</p><p>発表によると、9月28日は13時から深夜24時まで4つの時間帯に分かれ、それぞれ異なるホロライブのチームが恐怖のマップに挑戦します。</p><p><strong>【1枠目 13時～15時】ホロライブEnglishチーム</strong>トップバッターは、さん、さん、さん、さんの4名。ホロライブEnglishの混合チームが、メルヘンの世界でどのようなリアクションを見せるのか注目です。</p><p><strong>【2枠目 16時～18時】JP＆ReGLOSS混合チーム</strong>続いては、さん、さん、さん、さんの4名が登場。ホロライブJPの先輩と、音楽アーティストグループ「ReGLOSS」の後輩という組み合わせが、どのような化学反応を起こすのか期待が高まります。</p><p><strong>【3枠目 19時～21時】秘密結社HoloXチーム</strong>夜の部には、総帥を筆頭に、さん、さん、さんによる秘密結社「HoloX」が集合。ユニットならではの息の合った絶叫が聞けるかもしれません。</p><p><strong>【4枠目 22時～24時】0期生＆1期生チーム（ふぶみこめっと）</strong>この日のトリを務めるのは、さん、さん、さんの3名。昨年も参加した人気ユニットが、再び肝試しに挑戦します。ベテランの彼女たちがどのような配信を見せてくれるのか、ファンからの期待は絶大です。</p><h3>「マイクラ肝試し2025」9月28日 ホロライブ出演者一覧</h3><ul></ul>","contentLength":2534,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・星街すいせい、Kizuna AIの復活コンサート「Homecoming」に出演決定！","url":"https://hololive-tsuushin.com/schedule/suisei-40/","date":1758380400,"author":"ホロミ","guid":718,"unread":true,"content":"<p>2025年9月21日にZepp Shinjuku (TOKYO)にて開催される、Kizuna AIさんのカムバックコンサート「KizunaAI Comeback Concert “Homecoming”」のDay2 “new world”に、ホロライブプロダクション所属のVTuber、星街すいせいさんが出演することが発表されました。</p><p>Kizuna AIさんの復活を記念して開催される本コンサートで、星街すいせいさんとの共演します。</p><p>イベントの開催日時は9月21日で、16:00に開場、17:00に開演が予定されています。</p><p>会場は東京・新宿の「Zepp Shinjuku」です。</p><p>現地でライブを体験できる会場チケットは、8月16日の正午12時より先着順で一般販売が開始されます。</p><p>また、当日の様子はオンラインでも配信され、ABEMAにて配信チケットが販売されています。</p>Kizuna AIさんの復活を記念して開催される本コンサートで、星街すいせいさんとの共演が実現します。\nイベントの開催日時は9月21日で、16:00に開場、17:00に開演が予定されています。会場は東京・新宿の「Zepp Shinjuku」です。\n現地でライブを体験できる会場チケットは、8月16日の正午12時より先着順で一般販売が開始されます。また、当日の様子はオンラインでも配信され、ABEMAにて配信チケットが販売されています。\n","contentLength":1419,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【VTuber】常闇トワ主催！ストリートファイター6の3on3大会「#常闇祭」が開催決定！ランク不問で誰でも参加可能！","url":"https://hololive-tsuushin.com/schedule/towa-12/","date":1758294000,"author":"ホロミ","guid":860,"unread":true,"content":"<p>人気VTuberグループ「ホロライブ」所属の常闇トワさんが、自身が主催する大人気対戦格闘ゲーム『ストリートファイター6』の3on3形式オープントーナメント「」の開催を発表しました。</p><p>本イベントはランク制限なしの誰でも参加可能なオープントーナメントとなっており、格闘ゲームファンにとって見逃せないお祭りとなること間違いなしです。</p><ul><li> 2025年9月20日(土) 14:00 ～ 21:30（予定）</li><li> 3on3 チーム戦 / シングルエリミネーショントーナメント</li></ul><p>本大会は、3人1組のチームで戦うシングルエリミネーショントーナメントです。試合は1試合先取の勝ち残り戦形式で行われ、チームの戦略や個々の実力が試される熱い戦いが期待されます。</p><p>我こそはという猛者から、お祭りを楽しみたい初心者まで、参加資格に制限はありません。仲間を募って、ぜひエントリーしてみてはいかがでしょうか。</p><p>※エントリーに関する注意事項や詳細は、上記エントリーフォームをご確認ください。</p><p>2ndアルバムのリリースとソロライブの開催も決定し、アーティストとしても精力的に活動する常闇トワさんが贈る格闘ゲームの祭典「常闇祭」。プレイヤーとして参加するもよし、視聴者として熱い戦いを見届けるもよし。ぜひこの機会をお見逃しなく！</p>","contentLength":1510,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"大空スバル、宅配業者と思いきや犯罪者…？続く偽警察官の訪問に戦慄→マネージャーの冷静な一言に「確かに」「ゾッとした」","url":"https://hololive-tsuushin.com/holonews/subaru-50/","date":1756912698,"author":"ホロミ","guid":861,"unread":true,"content":"<p>ホロライブ所属の大空スバルさんが9月3日の配信で、過去に住んでいたマンションで体験したという恐怖体験を語りました。</p><p>宅配業者を名乗る人物が関わる事件と、その後に自宅を訪れた偽物の警察官との緊迫したやり取りを生々しく明かし、ファンからは「ガチのホラーじゃん…」「スバルの対応が冷静ですごい」といった驚きの声が相次いでいます。</p><p>ある日、スバルさんが宅配の荷物を受け取った後、しばらくして警察を名乗る人物が自宅を訪ねてきたとのこと。</p><p>その人物は「さっきの宅配業者は実は犯人だった」と告げ、「事情聴取をしたいので玄関に入れてもらっていいですか？」と家の中に入ることを要求してきたそうです。</p><p>しかし、スバルさんは「」と、刑事ドラマの知識からその要求を冷静に分析。</p><p>警察官が一人で行動していること、服装が私服で派手な靴を履いていたことなど、数々の不審な点に気づき、家に入れることを毅然と拒否。</p><p>男が去った後、あまりの恐怖にスバルさんはすぐに担当マネージャーに連絡。</p><p>するとマネージャーからは「それ本物ですか？」と、核心を突く冷静な一言が返ってきたといいます。</p><p>その言葉にスバルさん自身も偽物の警察官であったことを確信。恐怖が倍増したと語りました。</p><p>その後、マネージャーが警察などに連絡を取って対応してくれたそうで、この一連の出来事はファンに大きな衝撃を与えました。</p><p>配信のコメントでは「スバルの機転が命を救った」「話聞いてるだけで鳥肌立った」といった声が殺到していました。</p>","contentLength":1856,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ百鬼あやめ、7周年配信で感極まり涙。卒業した同期に想いを馳せ「当たり前じゃない」にファンから「もらい泣きした」「ずっと応援する」と感動の声","url":"https://hololive-tsuushin.com/holonews/ayamer/","date":1756874991,"author":"ホロミ","guid":856,"unread":true,"content":"<p>「ホロライブ」所属の2期生・百鬼あやめさんが、2025年9月2日に行った自身のデビュー7周年記念配信にて、ファンへの感謝を語る中で感極まり、涙を流す一幕がありました。</p><p>同期の卒業にも触れ、「ここにいることが当たり前じゃない」と語った彼女の真摯な姿に、ファンからは「7周年おめでとう！」「涙腺崩壊した」といった温かい声が相次ぎました。</p><p>百鬼さんは「わーい！7周年！」と明るくスタートし、ファンからの無数のお祝いコメントに「ありがとうございます！」と笑顔で応えていました。</p><p>しかし、感謝の言葉を重ねるうち、「なんか思ったより嬉しい…ぐっと来てしまった」と次第に声が震え始めます。</p><p>「」と、こらえきれずに涙。突然のことに本人も驚きつつ、「みんなにお祝いしてもらえるのめっちゃ嬉しい」と、涙ながらにファンへの感謝を伝えました。</p><p>涙の理由について、百鬼さんは「同期2人いない。確かにそうだね」と、現在は卒業してしまった同期メンバーの不在に言及。</p><p>ホロライブ2期生はデビュー当時、複数人で活動していましたが、時を経てメンバーが欠けてしまった現状があります。</p><p>百鬼さんは、「（自分たちの）期はかけないんだろうなみたいな。って思ってたけど」「でもさ、それがかけちゃってね」と、デビュー当時に抱いていた想いと現実とのギャップを吐露。</p><p>（百鬼あやめさんが所属する2期生からは湊あくあさんと紫咲シオンさんが卒業しています。）</p><p>「」と、一言一言を噛みしめるように語りました。</p><p>この涙ながらの告白に、チャット欄では「お嬢の涙につられて泣いちゃった」「7年間続けてくれて本当にありがとう！」「これからもずっと応援してる！」といった、もらい泣きするファンや、改めて感謝と応援を誓うコメントが見られました。</p><p>また、「デビュー当時は5年ぐらいかなって思ってた」という赤裸々な告白もありましたが、見事7周年を迎え、ファンと共に未来を見据える彼女の姿に、「8年目も、その先もついていくよ！」という声が多く見られました。</p>","contentLength":2453,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"角巻わため、ねんどろいど再販決定！→ファンからの「唯一のフィギュア」発言に「ぐさっ」「矢が飛んできたw」","url":"https://hololive-tsuushin.com/holonews/watame-25/","date":1756827617,"author":"ホロミ","guid":853,"unread":true,"content":"<p>ホロライブ4期生の角巻わため（つのまき わため）さんが、自身の配信にて、デフォルメフィギュアシリーズ「ねんどろいど 角巻わため」の再販が決定したことを発表しました。</p><p>待望のニュースにファンと喜びを分かち合う中、ファンからの愛ある”一言”に思わずたじろぐ場面があり、ファンから「おめでとう！」「ぐさっと刺さってて草」などの声が相次ぎました。</p><p>「ねんどろいど」は、グッドスマイルカンパニーが展開する大人気の手のひらサイズのデフォルメフィギュアシリーズです。</p><p>角巻わためさんのねんどろいどは以前発売された際、そのクオリティの高さから大きな人気を博し、一時は中古市場でプレミア価格が付くほど入手が困難な状況となっていました。</p><p>今回の再販は、前回手に入れることができなかったファンや、新たに関心を持った人々にとって、まさに待望の発表と言えるでしょう。</p><h3>「早々たるメンツの中に…」人気キャラと並んでの再販に喜び爆発！</h3><p>今回再販が決定したのは、フィギュアメーカーのグッドスマイルカンパニーが企画した「商品化＆再販希望アンケート」の結果を受けてのこと。このアンケートは総応募数が53,900件にも上る大規模なもので、数多くの人気キャラクターが候補に挙がっていました。</p><p>しかし、喜びの報告も束の間、コメント欄に流れた「わため唯一のフィギュア」というファンからの的確すぎる指摘が。これには、わためさんも「ぐさっ。あれなんか矢が飛んできた」「唯一のフィギュアだから。これしかないから」と、苦笑いを浮かべながら反応。ファンからの手厳しいながらも愛情のこもったイジりに、見事に一本取られてしまう形となりました。</p><p>ファンからの痛いところを突く一撃に動揺しつつも、最後は「」と笑顔で締めくくり、改めて再販の喜びをファンに伝えました。</p><p>この一連の流れに、ファンからは 「再販おめでとう！プレミアついてたから本当に嬉しい！」 「唯一のフィギュアは草w」 「ぐさっと的確な矢が飛んできてて笑った」 「ファンとの距離が近くてええなぁ」 といった祝福と笑いのコメントが見られました。</p>","contentLength":2556,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】百鬼あやめ、待望の新衣装3Dお披露目！9月3日の7周年記念ライブ！","url":"https://hololive-tsuushin.com/schedule/ayame-16/","date":1756825200,"author":"ホロミ","guid":793,"unread":true,"content":"<p>VTuberグループ「ホロライブ」に所属する2期生の百鬼あやめさんが、<strong>活動7周年を記念した3Dライブの開催と、待望の「新衣装」を3Dでお披露目する</strong>ことが決定しました！</p><p>記念すべき配信はとのこと。</p><p>今回発表された内容のポイントは、なんといっても「7周年記念ライブ」と「新衣装3Dお披露目」という2つの大きなイベントが同時に行われる点です。</p><p>この発表を受けて、XなどのSNSではファンから喜びのコメントが溢れかえりました。</p><ul><li>「7周年おめでとう！新衣装もライブも本当に楽しみ！」</li><li>「3Dで動く新しいあやめちゃんが見られるなんて…絶対リアタイする！」</li><li>「どんな衣装なんだろう？和風かな？それともクールな感じかな？」</li></ul><p>など、祝福の言葉と共に、新衣装のデザインを予想する声も数多く見られます。</p><p>9月3日の記念ライブでは、新衣装のお披露目はもちろん、7年の活動を振り返るような感動的なパフォーマンスや、記念の歌などが披露されることが期待されます。もしかしたら、仲の良いホロライブメンバーがゲストとして登場するサプライズもあるかもしれません。</p>","contentLength":1313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ角巻わため、大型企画「7Days」最終回を振り返り号泣→ファンからの温かい声に「ホロライブ入れて良かった…」「また泣いてるw」「こっちも泣いちゃう」","url":"https://hololive-tsuushin.com/holonews/watame-22/","date":1756823557,"author":"ホロミ","guid":852,"unread":true,"content":"<p>ホロライブ4期生の角巻わためさんが、自身の配信で、先日最終回を迎えた大型ゲーム企画「7Days to Die」を振り返り、感極まって号泣していました。</p><p>ファンからの温かいコメントに涙腺が崩壊し、これまでの活動での葛藤や成長、そして仲間への感謝を涙ながらに語る姿に、ファンから「嬉し泣きだね」「もらい泣きした」といった声が多数寄せられています。</p><h4>多数のホロメンが参加した大型企画「7Days to Die」</h4><p>今回話題となったのは、ホロライブプロダクション所属のVTuberが多数参加した、ゾンビサバイバルゲーム「7Days to Die」（通称：7大豆）の長期企画。サーバー内でメンバーたちが交流し、協力しながらゾンビと戦うこの企画は、連日大きな盛り上がりを見せていました。</p><p>角巻さんも中心メンバーの一人として参加。「わため＝ハンマー」とみんなから思われるプレイスタイルや、仲間を鼓舞する持ち前の明るさで、企画の盛り上がりに大きく貢献していました。</p><p>そんな企画の最終回を終えた直後の感想配信での出来事でした。</p><p>配信終盤、角巻さんはファンから寄せられた「7DaysでのWatameだけの唯一無二が生まれたんだなって、なんだかすごい嬉しくなっちゃった」「めっちゃ楽しませてもらったよ。参加してくれてありがとう」といった温かいスーパーチャットを読み上げると、次第に言葉を詰まらせ、ついに「」と涙。</p><p>「これは嬉し泣きなんだ」と前置きしつつ、過去のコラボ配信では「」と、これまでの活動での葛藤を正直に吐露しました。</p><p>しかし、今回の企画を通じて「徐々に、みんなと打ち解けてきて、積極的に話せるようになった」と自身の成長を実感したと語り、「まあ、それが出来るようになったのも、優しくしてくれる、ホロメンのおかげで。ホロライブ入れて良かった…」と、涙ながらに仲間やファンへの感謝を伝えました。</p><h4>涙の羊にファンから温かいツッコミ「また泣いてるw」</h4><p>突然の号泣に、チャット欄は「いま来た人びっくりするよw」「切り抜かれちゃう」と盛り上がり。角巻さん自身も「”角巻わため深夜に号泣”」「”7大豆最終回を思い出して号泣”って切り抜かれちゃう」と、照れながらも的確に未来を予測し、笑いを誘いました。</p><p>普段から努力家として知られる彼女が見せた嬉し涙と、それを見守るファンの温かい関係性だからこそ生まれた、感動的な一幕でした。</p>","contentLength":2842,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ甲子園2025へ、さくらみこが監督就任でファンに逆“覚悟”要求！→「指示するなよ！」「絶対熱くなるw」","url":"https://hololive-tsuushin.com/holonews/miko-35/","date":1756740950,"author":"ホロミ","guid":850,"unread":true,"content":"<p>ホロライブ0期生のエリート巫女、さくらみこさんが、毎年恒例の大型企画「ホロライブ甲子園2025」への監督就任に際し、自身の配信でファン（35P）との向き合い方について言及。</p><p>コメント欄が白熱することを見越した上で「」と語りかけ、ファンからは「すでに会合が控えてる」「これは熱い夏になる」などの期待の声が相次ぎました。</p><h4>◆今年もやってくる！白熱必至の「ホロライブ甲子園」</h4><p>「ホロライブ甲子園」とは、大手VTuber事務所「ホロライブ」の所属メンバーが、大人気野球ゲーム「eBASEBALLパワフルプロ野球」シリーズの「栄冠ナイン」モードでオリジナルチームを育成し、頂点を目指す夏の一大イベントです。</p><p>その一方で、育成方法に絶対の正解がない「諸説ゲー」であることから、配信のコメント欄ではファンからの様々なアドバイスや指示が飛び交い、と表現されることもしばしば。今回のさくらみこさんの配信は、開幕を前に、監督としての所信表明のような場となりました。</p><h4>◆「荒れることは十々承知済み」みこち流の“覚悟”とは</h4><p>配信冒頭、さくらみこさんは監督就任について「」と堂々と宣言。長年の配信経験から、ファンの熱いコメントは織り込み済みであると語りました。</p><p>さらに、「逆にみんなも覚悟しててほしいね」とファンに“挑戦状”を叩きつけます。</p><p>自身が配信中に、なぜか少数派の突飛なコメント、通称「ワザップ」を拾ってしまう癖があることも認めていた。</p>","contentLength":1757,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ兎田ぺこら、6周年LIVEの”涙”に一部ファンが「卒業か？」と憶測→配信で「想像が豊かすぎる」と一蹴","url":"https://hololive-tsuushin.com/holonews/pekora-49/","date":1756735660,"author":"ホロミ","guid":849,"unread":true,"content":"<p>ホロライブ所属の3期生VTuber「兎田ぺこら」さんが、自身の活動6周年を記念したライブの翌日に行った配信にて、一部のファンの間で囁かれていた”卒業説”に言及。</p><p>ライブの演出を巡る憶測を一蹴し、ファンを安心させました。この一連の流れに、ファンからは「さすがすぎるw」「はっきり言ってくれて助かる」などの声が相次いでいます。</p><p>事の発端となったのは、先日大盛況のうちに幕を閉じた兎田ぺこらさんの6周年記念3Dライブ。</p><p>豪華なセットやゲスト、そして「パチスロ」をテーマにした奇抜な演出でファンを魅了し、X（旧Twitter）でも関連ワードがトレンドを席巻しました。</p><p>しかし、その中で一部のファンが、ライブのオープニング映像でぺこらのキャラクターが一筋の涙を流すシーンに過剰に反応。「この涙は卒業を意味しているのではないか？」という憶測が、SNS上で飛び交ってしまったのです。</p><p>こうした一部のファンの心配に対し、ぺこらさんは配信で問題のシーンを映し出すと、開口一番「『この涙は卒業を意味してるんちゃう？』…するわけねえだろ！」と一刀両断。</p><p>ぺこらさんによると、オープニング映像は専門のクリエイターに「いい感じにしてください」と、ほぼ”おまかせ”で制作を依頼しているとのこと。</p><p>「この一粒の涙で『もしや卒業を意味しているのでは』っていうね、想像力がすごい豊かな方が…」と苦笑しつつ、「ぺこらは匂わせとかしてないって。したこともないんで、ご安心ください」とキッパリと卒業説を否定しました。</p><p>最後には「安心してください。まだ活動させてください！」「むしろ何、引退させたいの？」とユーモアたっぷりにファンへ呼びかけ、心配していたファンを完全に安心させました。</p><p>この配信を受け、ファンからは 「杞憂民が光の速さで成仏してて草」 「想像力豊かすぎる野うさぎ好きw」 「はっきり否定してくれるぺこーらは信頼できる」といった安堵と爆笑のコメントが殺到。</p>","contentLength":2361,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"大空スバル、NY渡航中止の大ピンチ！常闇トワが語った「パスポート紛失事件」と「ホテル秒速締め出し」の衝撃的な真相","url":"https://hololive-tsuushin.com/holonews/towa-11/","date":1756720655,"author":"風歌","guid":846,"unread":true,"content":"<p>ホロライブ所属の常闇トワさんが自身の配信で、大空スバルさんと共に訪れたニューヨークでの衝撃的なハプニングの数々を明かしました。なんと、大空さんがニューヨーク出発の前夜にパスポートを紛失しかけるという大事件が発生。さらに、ホテル到着後わずか5分で部屋から閉め出されるという、まるでコントのような出来事も起こったとのことでした。</p><p>ニューヨークへの出発を翌日に控えた日の夜、常闇さんのもとに大空さんから焦った様子の電話がかかってきました。その内容は、耳を疑うようなものでした。</p><div><div><div><div><p>急に電話かかってきて『やばい。パスポートがない』とか言い出してさ。</p></div></div></div></div><p>海外渡航に絶対不可欠なパスポートがないという、まさに絶体絶命のピンチ。この一報に、常闇さんも「」と、最悪の事態が頭をよぎったと語っています。さらに、ハプニングはこれだけでは終わりませんでした。無事にニューヨークのホテルに到着した後、今度は信じられないほどの速さで新たな事件が起こります。常闇さんが</p><div><div><div><div><p>オートロックだからルームキーを部屋に置いたまま出ちゃダメだよって言ったら、『ねえねえトワ、何これどうしたらいいの』って呼んできてさ。</p><p>パッて扉出たらすばるちゃんがガチャってもう閉めてたわ。</p></div></div></div></div><p>に、大空さんは見事なまでにフラグを回収。「閉めちゃった」と、に、常闇さんも思わず「フラグ回収早すぎるだろう」と笑ってしまったそうです。</p><p>そもそも、なぜ出発直前にパスポートがないという事態に陥ってしまったのでしょうか。</p><p>常闇さんの話によると、今回の渡航は仕事のため、特別な許可証であるワークビザの取得が必要でした。その手続きで、一度パスポートを業者に預けており、だったのです。しかし、大空さんはとのこと。幸い、翌朝一番で郵便局に直接受け取りに行くことで飛行機には間に合ったそうですが、郵便局でのことが明かされました。一方の「ホテル締め出し事件」にも大空さんは、自身のやらかしを予見していたのか、</p><div><div><div><div><p>いや、多分スバルやらかすと思うからこれ渡しときます</p></div></div></div></div><p>と、のです。この用意周到さのおかげで、大事には至らずに済んだようです。</p><p>一連のハプニングに対する、周囲の反応も様々でした。常闇さんと常闇さんのマネージャーは、「大丈夫かスバル…」とそう。しかし、大空さんのマネージャーは「ああ、やりましたか」と、まるでと言います。大空さん自身も、</p><div><div><div><div><p>マネージャーがいる事によって、委ねてもいいという気持ちになってしまうからいけないわ。</p></div></div></div></div><p>とことを語りました。このハプニング満載の渡航に対し、常闇さんは</p>","contentLength":3112,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"大神ミオ、オリコン1位の快挙に「こっぱずかしい」！？ソロライブを前に照れながらファンへ感謝","url":"https://hololive-tsuushin.com/holonews/mio-42/","date":1756719797,"author":"風歌","guid":848,"unread":true,"content":"<p>ホロライブ所属の大神ミオさんが、自身の朝配信で自身のセカンドアルバム『My Sparkle』が、オリコン週間ランキング1位を獲得するという快挙を成し遂げたことを報告しました。この吉報にファンが沸き立つ中、大神さん本人はソロライブを直前に控え、自身の話題が続くことに「こっぱずかしい」と照れ笑いし、謙虚な姿をみせました。</p><p>大神ミオさんは自身のセカンドアルバム『』が、ことを報告しました。</p><div><div><div><div><p>なんとですね、アルバムの週間ランキングで1位を獲得いたしましてどうもありがとうございます。</p></div></div></div></div><p>と、少し照れた様子で報告を始めた大神さん。さらに、であることも報告。「」と呼びかけました。</p><p>現在、大神さんは自身のソロライブを間近に控えており、そんな中でのビッグニュースに</p><div><div><div><div><p>ソロライブも近くて色んなニュースもある中、自分のニュースもあるっていうのは、</p></div></div></div></div><p>と、を見せました。ランキング1位という結果について、リリースのタイミングが良かったのかもしれないと謙遜しつつも、</p><div><div><div><div><p>皆さんのおかげで週間ランキングオリコン1位を獲得することができ、もう本当に嬉しいです。</p></div></div></div></div>","contentLength":1346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"風真いろは、星街すいせいへの”ガチ推しムーブ”をマネージャーに完全暴露され大赤面！「めっちゃ恥ずかしい…」","url":"https://hololive-tsuushin.com/holonews/iroha-13/","date":1756714521,"author":"風歌","guid":847,"unread":true,"content":"<p>秘密結社holoXの用心棒、風真いろはさんが、自身の配信でマネージャーからまさかのリーク情報を突きつけられ、大いに照れる様子が見受けられました。リークされたのは、彼女が敬愛する先輩、星街すいせいさんに対する熱烈な推し活の様子。本人の前では平静を装いつつも、裏では完全にファンそのものな行動が明らかになりました。</p><p>ことの発端は、風真さんの配信中のコーナーでの出来事。マネージャーから寄せられたタレコミ情報が読み上げられました。それは、ホロライブのイベント「ホロ謎ミュージアム」にメンバーで訪れた際の風真さんの行動に関するものでした。</p><div><p>ご本人が書いたサインの写真をこっそり撮ったり、ご本人にバレないように謎解き後グッズを買ったり。</p><p>すいせいさんが来るとちょっと恥ずかしそうにできるだけ平然を装っていたところが可愛かったです。</p></div><p>なんと、推しである星街さんがいない隙を狙ってサインの写真を撮り、本人が来ると何事もなかったかのように振る舞うという、まさに”推し活”の鑑のような行動を暴露されてしまったのです。これには風真さんも</p><p>と大慌て。まさかそこまで見られているとは思わなかったようで、恥ずかしさのあまり動揺が隠せない様子でした。</p><p>風真さんは、このリーク情報を受けて、当日の裏話を語り始めました。イベント会場には閉店後、メンバー数名でお邪魔し、サインなどを書かせてもらったとのこと。その際、だと熱弁。星街さんはたくさんの場所にサインを書いてくれていたそうで、その一つ一つを、ことを白状しました。</p><div><div><div><div><p>それをそんなにマネちゃんに見られてるとかは思わなくて、こんなガチなリーク情報が来ると思いませんでした。</p></div></div></div></div><p>と、驚きを隠せない様子を語りました。さらに、星街さんが到着する前には、急いで会場に入り、星街さんのとのこと。その必死な姿が、マネージャーさんの目には微笑ましく映っていたようです。また、この日は会場にマスコットキャラクターの。</p><div><div><div><div><p>すごい喜んでいるすいせい先輩を間近で見ることができて、個人的にとてもとても幸せでした</p></div></div></div></div><p>と、嬉しそうに語る風真さんの姿は、完全に一人のファンそのものでした。</p><p>この推し活はグッズ購入にも表れていました。風真さんはそうですが、ある理由から断念。それは、自身のチャンネルの企画で、いつか星街さんとさくらみこさんのコンビ「みこめっと」がから、というものでした。万が一家に遊びに来た時に、大きな推しグッズがあったら恥ずかしい…という、風真さんならではの深い悩みを吐露。最終的に、集めているアクリルスタンドとマグネットを購入したことを明かしました。</p>","contentLength":3185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【結果速報】ホロライブ甲子園ドラフトで個性派4チームが誕生しファン「今年も来たか」「推しを全力応援！」","url":"https://hololive-tsuushin.com/holonews/horokou/","date":1756656107,"author":"ホロミ","guid":845,"unread":true,"content":"<p>2025年8月31日、VTuber事務所「ホロライブ」の夏の大型企画「ホロライブ甲子園2025」のドラフト会議が開催されました。</p><p>監督を務めるさくらみこさん、宝鐘マリンさん、博衣こよりさん、一条莉々華さんが、運命の選手指名を実施。</p><p>あみだくじによる展開の末、各監督のチームが誕生し、ファンからは「俺たちの夏が始まる！」「推しチームを全力で応援する！」といった期待の声が高まっています。</p><ul></ul><p>ドラフト会議は、各監督が同時に選手を指名し、重複した場合はあみだくじで所属チームを決定する方式で進行。2巡目、さくらみこ監督が指名した白上フブキさんを宝鐘マリン監督も指名。くじ引きの結果マリン監督が勝利し高笑いを上げる一方、みこ監督は悔しさをにじませます。</p><p>しかし続く3巡目、みこ監督は秘密結社holoXの総帥、ラプラス・ダークネスさんを指名。すると、holoXの頭脳である博衣こより監督もまさかの指名重複。再びくじ引きとなり緊張が走りますが、今度はみこ監督が見事勝利しました。</p><p>「ホロライブ甲子園」は、コナミデジタルエンタテインメントの人気野球ゲーム「eBASEBALLパワフルプロ野球」シリーズを使用して行われる、ホロライブタレントによる一大イベントです。監督を務めるメンバーがドラフト会議で所属タレントを指名してチームを結成。その後、約1ヶ月にわたる育成期間を経て、本戦トーナメントで優勝を目指します。</p>","contentLength":1698,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"大空スバル、NYで社長YAGOOの前に割り込み！→ホテルではトワに注意された直後に鍵締め出しで「伝説のPON」「面白すぎる」","url":"https://hololive-tsuushin.com/holonews/subaru-49/","date":1756629137,"author":"ホロミ","guid":841,"unread":true,"content":"<p>先日、ニューヨーク（NY）渡航前のパスポート紛失騒動を明かしファンを笑わせたホロライブ所属のVTuber、大空スバルさん。</p><a href=\"https://hololive-tsuushin.com/holonews/suba-2/\"></a><p>しかし、彼女の“ド珍旅”はそれだけでは終わりませんでした。</p><p>渡航先でもエレベーターで社長のYAGOO（谷郷元昭氏）に無礼講を働いたり、ホテル到着直後に部屋から締め出されたりと、立て続けに“PON”エピソードを披露。</p><p>そのあまりのポンコツっぷりにファンからは「期待を裏切らない」「面白すぎる」といった声が殺到しています。</p><p>前回、パスポートの一件で危うくNYに行けなくなる危機を乗り越えた大空さんでしたが、現地でもその天然ぶりは健在でした。</p><p>まず一行がエレベーターで移動する際、Wi-Fiの接続に手こずっていた大空さんは他のメンバーから少し遅れて乗り込みます。</p><p>異様に真ん中だけスペースが空いていることを不思議に思いつつも、「なんだ全然開いてんじゃん」と乗り込んだところ、周囲が爆笑。</p><p>なんと、大空さんが立った場所のすぐ後ろには、社長のYAGOOが立っていたのです。</p><p>EN（英語圏）のメンバーたちが社長に気を遣い、敬意を払って空けていたスペースに、何も知らない大空さんが飛び込んでしまったという構図でした。</p><p>YAGOOの印象について、大空さんは社長と長い付き合いだからこそ「近所のおじちゃん」のイメージと語っており、ENメンバーとの認識のギャップにファンからは「社長相手に強すぎるw」と笑いが起こりました。</p><p>ホテルに到着してからも“ド珍事”は続きます。常闇トワさんに「ここオートロックだから気をつけてね」と注意された、まさにその直後。</p><p>大空さんは鍵を部屋の中に置いたままドアを閉めてしまい、即座に締め出される事態に。隣の部屋のトワさんに「ガチャ……鍵中なんですけど」と助けを求める羽目になったと明かし、見事なまでの“フラグ回収”をやってのけました。</p><p>極めつけは、ホテル備え付けのスリッパを無料だと思い込み、値段が書かれたタグを「バジって切って」から、それが14ドル（当時のレートで約2,000円）の有料品だと気づいたエピソードも明かされました。</p><p>この怒涛のポンエピソードの連続に、ファンからは「スバルのPONは国境を超える」「ここまで来ると芸術の域」「トワ様の優しさに泣ける」といったコメントが殺到していました。</p>","contentLength":2763,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"大空スバル、NY旅でパスポート紛失のド珍事！→常闇トワに「行けねえかも」と涙の電話に「完全にみこち」「笑えないw」","url":"https://hololive-tsuushin.com/holonews/suba-2/","date":1756628697,"author":"ホロミ","guid":840,"unread":true,"content":"<p>ホロライブ所属のVTuber、大空スバルさんが、先日行われたニューヨーク渡航の直前にパスポートを紛失したと勘違いし、顔面蒼白になるほどのドタバタ珍道中に見舞われたことを自身の配信で明かしました。</p><p>出発前からクライマックスを迎えた一連の“ド珍事件”に、ファンからは「みこちのこと笑えない」「ドタバタ珍道中すぎる」などの声が相次ぎました。</p><p>事の発端は、ニューヨークでの仕事へ出発する前日のこと。</p><p>大空さんは、仕事で海外へ渡航する際に必要となるビザの申請手続きを行なっていました。</p><p>無事に手続きを終えたものの、その後、いつも保管しているはずの場所にパスポートがないことに気づき、パニックに陥ってしまったと語ります。これが、後に本人が語る「ド珍旅」の幕開けでした。</p><p>大空さんは「」と当時の心境を吐露。</p><p>原因は、ビザ申請のために大使館へ預けたパスポートが、後日郵送で返却されるという仕組みを知らなかったことでした。</p><p>血の気が引いた大空さんは、常闇トワさんにも「ごめんスバル明日行けねえかも」と震えながら電話をかけたことを告白。</p><p>「みこちのこと笑えません」と、同じく“PON”なエピソードで知られるさくらみこさんの名前を挙げ、自嘲気味に語りました。</p><p>幸いにも、マネージャーに相談し、出発当日の朝一で郵便局へ向かったことでギリギリパスポートを受け取ることができ、事なきを得たとのこと。</p><p>この一連に、配信のコメント欄やSNSでは「最初からクライマックスすぎるw」「スバルも大概みこちだよ」「トワ様に泣きつくのてぇてぇ」といったツッコミや感想が殺到。</p><p>普段の元気で快活なイメージとのギャップが垣間見えた、あまりにも人間味あふれる失敗談に、多くのファンが和んだようです。</p><a href=\"https://hololive-tsuushin.com/holonews/subaru-49/\"></a>","contentLength":2116,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【VTuber】「それでも！」兎田ぺこらの不屈の魂！延期を乗り越えた6周年記念LIVEが8月31日に開催決定！","url":"https://hololive-tsuushin.com/schedule/pekora-47/","date":1756566000,"author":"ホロミ","guid":798,"unread":true,"content":"<p>「ホロライブ」の3期生、兎田ぺこらさんが、自身の6周年を記念した特別LIVEの開催をXで発表しました！</p><p>一度は延期となってしまいましたが、ついに開催日が決定。しかも、あの伝説の企画「パチスロLIVE」の第2弾だということ。</p><p>今回発表された兎田ぺこらさんの配信で、明らかになった情報は以下の通りです。</p><ul><li> 延期となっていた「パチスロLIVE」の第2弾</li></ul><p>「それでも！！！！！！！！！！！」という（ガンダムUCの名言）力強い一言から始まるメッセージ。</p><ul><li>「延期は残念だったけど、パワーアップしてると信じてる！」</li></ul><p>など、ファンからの喜びと祝福のコメントで溢れかえり、「#兎田ぺこら6周年記念LIVE」というハッシュタグは、あっという間にトレンドに躍り出ました。</p>","contentLength":902,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブさくらみこ、自宅が“事故物件”疑惑で引っ越し検討→愛犬の“見えない何か”への威嚇に「帰れ」と一喝！","url":"https://hololive-tsuushin.com/holonews/miko-34/","date":1756557387,"author":"ホロミ","guid":835,"unread":true,"content":"<p>VTuberグループ「ホロライブ」に所属するさくらみこさんが自身の配信で、現在住んでいる家が“事故物件”である可能性を告白。</p><p>その衝撃的な内容と、さくらみこさんならではの豪快な対応が配信で明かされました。ファンからは「幽霊に勝つエリート巫女」「肝が据わりすぎw」などの声が相次ぎました。</p><p>さくらみこさんは以前から、引っ越しを検討していることを示唆していました。</p><p>そんな中、今回の配信で「めちゃくちゃでかいきっかけじゃないんだけど」と前置きしつつ、引っ越しを決意するに至った、ある“”について語り始めました。</p><p>その現象の核心は、さくらみこさんの愛犬「いぬち」の謎の行動でした。</p><p>さくらみこさんによると、いぬちは「」とのこと。</p><p>散歩中などでは他の犬や人に全く吠えないにもかかわらず、家の中の何もない一点に向かって、来客があった時と全く同じような警戒心の強い吠え方をするというのです。</p><p>「」と語り、いぬちが“見えない何か”の存在を感知しているのではないか、との推測を明かしました。</p><p>当初はこの現象に恐怖を感じていたというさくらみこさん。</p><p>しかし、あまりにも頻繁に起こるためか、最近ではその対応にも変化が。「」と、なんと“見えない何か”を一喝していることを告白しました。</p><p>このホラーな出来事を笑いに変えるさくらみこさんの強心臓っぷりに、ファンからは「さすがエリート巫女、悪霊退散！」「いぬち、みこちを守っててえらい」といったコメントが見られました。</p>","contentLength":1816,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・さくらみこ、デパート店員へのうっかり口癖「ばっばいですね」を言ってしまう！ファンからは「もう溶け込んじゃってるやん」「痛い人になるぞw」の声","url":"https://hololive-tsuushin.com/holonews/miko-33/","date":1756480176,"author":"ホロミ","guid":833,"unread":true,"content":"<p>ホロライブ所属のVTuberさくらみこさんが、先日行った配信の中で、お母様との買い物中に、デパートの店員に対して自身の口癖である「ばっばい」を普段の配信と全く同じテンションで使ってしまったとリスナーに伝えました。</p><p>このハプニングに、ファンからは「身バレするぞ」「気持ちはわかる」といった共感やツッコミのコメントが相次ぎました。</p><p>事の発端は、さくらみこさんがお母様とデパートへ買い物に出かけた際のエピソード。</p><p>歩き疲れない機能的な靴を探していたというさくらみこさん。</p><p>配信で「いらない」といった意味合いで「ばっばい」という独特な言葉を頻繁に使うことで知られており、これが口癖の一つとなっています。</p><p>このお馴染みの言葉が、まさかプライベートで飛び出してしまうことになるとは、本人も予想していなかったようです。</p><p>具体的には靴屋で気に入ったデザインの商品を見つけ、店員に機能性を尋ねたさくらみこさん。</p><p>しかし、残念ながらその靴はみこさんが求めていた「疲れにくい機能」が付いているモデルではなかったとのこと。</p><p>すると店員からの説明に対し、みこさんは普段の外面用の丁寧な声色のまま、無意識にこう返してしまったのです。</p><p>言った直後に「やばいやばいやばい！出ちゃった！」と我に返り、内心で大いに焦ったと語りました。</p><p>この赤面エピソードに対し、配信を見ていたファンからは「もう溶け込んじゃってるやん」「痛い人になるぞw」といった愛のあるツッコミが殺到。</p><p>さらに、さくらみこさんは「ばっばい」だけでなく、「草」や、VTuberファンの間でお馴染みの「てぇてぇ」といった言葉も、可愛い犬や仲の良い動物を見かけた際にプライベートで口にしてしまうことがあると告白しました。</p><p>配信で生まれた口癖が日常に溶け込んでしまうという、配信者ならではの”職業病”ともいえるハプニング。身バレには気をつけたいですね。</p>","contentLength":2302,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"天音かなた、卒業した湊あくあのボイスが途切れ途切れに→30回連打で復活させ「涙が止まらない」「電池切れ定期w」とファン感涙","url":"https://hololive-tsuushin.com/holonews/kanata-24/","date":1756394543,"author":"ホロミ","guid":825,"unread":true,"content":"<p>ホロライブ所属のVTuber・天音かなたさんが、先輩である湊あくあさんの卒業1周年にあたる日、ボイスキーホルダーに起きた”出来事”を自身のサブアカウントで報告しました。</p><p>天音さんといえば、同じホロライブの先輩である湊あくあさんの熱狂的なファン（あくあクルー）であることで知られています。</p><p>過去には湊さんのグッズで埋め尽くされた「祭壇」のイラストを自ら描いて本人に見せるなど、その深い愛情表現はファンの間でも有名でした。</p><p>今回の出来事は、そんな天音かなたさんが湊さんの卒業からちょうど1年という節目に投稿したものでした。</p><p>天音さんは自身のサブアカウント「さぶたそちゃん（@subtasochan）」にて、「推しが卒業して今日でもう一年 久々にボイスキーホルダーのスイッチを押してみた」と、湊さんの6周年記念グッズであるボイスキーホルダーを手に取ったことを報告。</p><p>しかし、「ボイスが途切れ途切れになっていて」とのこと、それでも諦めきれなかったのか、「30回くらい押したらちゃんとこんあくあした」と、連打の末に湊さんの元気な挨拶ボイスが復活したという結末を綴りました。</p><p>この推しへの愛が起こしたかのような奇跡の報告に、ファンは即座に反応。「俺も押した…」「卒業してもこうして想ってくれる後輩がいるの、泣ける」「なんてエモい話なんだ」といった感動の声が殺到。</p><p>一方で、「普通に電池が切れかかってただけなの草」「30連打で叩き起こされるあくたんw」など、感動的な状況に思わずツッコミを入れるコメントも多く見られました。</p>","contentLength":1887,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブからReGLOSSとあずミオトワが出演！YouTubeの音楽祭典『Music Weekend 10.0』が8月末に開催","url":"https://hololive-tsuushin.com/schedule/music/","date":1756393200,"author":"ホロミ","guid":713,"unread":true,"content":"<p>2025年8月29日から31日の3日間にわたり、YouTube上で開催される大規模オンライン音楽イベント「YouTube Music Weekend 10.0 supported by PlayStation®」に、ホロライブプロダクションからVTuberグループ「ReGLOSS」と、メンバーのAZKiさん、大神ミオさん、常闇トワさんによるユニットが出演することが決定しました。</p><p>「YouTube Music Weekend」は、今回で記念すべき10回目を迎える人気音楽企画です。</p><p>期間中は、アニメやインターネットカルチャーシーンで活躍する総勢122組のアーティストによる、本イベントのために撮り下ろされたライブ映像などが各公式チャンネルで連続してプレミア公開されます。</p><p>ホロライブプロダクションからは2組の出演が発表されました。</p><p>まず、が登場します。</p><p>そして。この日のヘッドライナーの一組として、イベントのクライマックスを盛り上げます。</p><p>本イベントの模様は、YouTube Japan公式チャンネルに作成される再生リスト、または各アーティストの公式YouTubeチャンネルから誰でも無料で視聴できます。</p>","contentLength":1226,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"綺々羅々ヴィヴィ、誕生日配信に兎田ぺこらがサプライズ登場！後輩のために用意したプレゼントに「愛を感じました」「てぇてぇが過ぎる」","url":"https://hololive-tsuushin.com/holonews/pekora-48/","date":1756371803,"author":"ホロミ","guid":823,"unread":true,"content":"<p>ホロライブ所属のVTuber・綺々羅々ヴィヴィさんの誕生日記念配信の終盤、先輩である兎田ぺこらさんがサプライズで登場し、大きな話題を呼んでいます。</p><p>心のこもったプレゼントと、二人の軽快なトークに、ファンからは「最高の誕生日プレゼント」「二人の関係性てぇてぇ」などの声が相次ぎました。</p><p>綺々羅々ヴィヴィさんは自身の誕生日を記念した配信を実施。</p><p>多くのファンからお祝いのメッセージが寄せられる中、配信も終盤に差し掛かった頃、スタッフから「ぺこらさんからプレゼントが届きました」と告げられます。</p><p>ヴィヴィさんが驚いていると、なんと兎田ぺこらさん本人が配信に登場し、直接お祝いの言葉を伝えました。</p><p>今回のサプライズの核心は、ぺこらさんが用意した心のこもったプレゼント。</p><p>ハリー・ポッターやジブリといった、ヴィヴィさんの好きなもので固められたプレゼントの数々に、ヴィヴィさんは「」と大興奮。</p><p>しかし、そのプレゼント選びの経緯について、ぺこらさんは「」とまさかの裏話を暴露。</p><p>これにはヴィヴィさんも思わず「2人の会話から覚えてたんちゃうんかい！」とツッコミを入れ、スタジオは笑いに包まれました。</p><p>ぺこらさんからの愛あるプレゼントに、ヴィヴィさんは「無理すぎるよ。ありがとうございます」「嬉しい。愛をめっちゃ感じました。」と、何度も感謝の言葉を口にしました。</p><p>この一連の流れに、コメント欄は「最高のサプライズ！」「ぺこらのツンな愛が可愛い」「二人のやり取り面白すぎる」といったファンの声で溢れかえりました。</p><p>普段から「ぺこらが企画する」配信（ぺこマリ体操など）に皆勤賞で参加するなど、仲の良さで知られる2人だからこそ成立する暖かさが感じられました。</p>","contentLength":2102,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】さくらみこが異世界転移！？新作3Dアドベンチャー『Holo ADV』が2025年発売決定！仲間を探す旅が今、始まる。","url":"https://hololive-tsuushin.com/holonews/miko-32/","date":1756345440,"author":"ホロミ","guid":820,"unread":true,"content":"<p>新しい3Dアドベンチャーゲーム『<strong>Holo ADV: SakuraSingularity.exe</strong>』が、2025年内に発売されることが発表されました！</p><p>このゲームは、ホロライブの二次創作（ファンが作る作品）を応援する「holo Indie」という公式ブランドから発表された期待の新作です。まずは、気になるストーリーとゲームの特徴を見ていきましょう！</p><blockquote><p>ある日突然、「さくらみこ」と仲間たちは「別の未来の世界線」へ転移してしまいました。 そこで彼女たちを待っていたのは、謎に満ちた世界での新たな出会いと混乱の数々。元の世界に戻るため、みこは仲間たちと再会しながら、ワープ先の世界の「真実」と向き合っていく――。</p></blockquote><p>なんと、みこちとホロメンたちが、別の未来の世界に飛ばされてしまうという壮大なストーリー！プレイヤーは主人公の「さくらみこ」になって、バラバラになってしまった仲間たちを探し出し、世界の謎に挑むことになります。</p><ul><li>: 冒険の途中、他のホロライブメンバーと出会い、会話をしたり選択肢を選んだりすることで「好感度」が上がります。仲良くなることで、特別なストーリーが解放され、世界の謎に近づいていくようです。</li><li>: マップに落ちている「話題アイテム」を見つけて特定のメンバーに話しかけると、特別な会話イベントが発生！推しのホロメンとの面白いやり取りが見られるかもしれませんね。</li><li>: ただ話すだけじゃない！美しい3Dで描かれた世界を探索し、謎を解きながら物語を進めていく、本格的なアドベンチャーゲームです。</li></ul><p>今回の発表を受けて、SNSではすでに大きな話題になっています。</p><ul><li>「みこちが主人公のゲームとか、絶対に買うしかない！」</li><li>「他のホロメンは誰が登場するんだろう？わくわくする！」</li><li>「公式の3Dモデルが使われるなんて、クオリティが楽しみすぎる！」</li></ul><p>といった、期待と喜びの声がたくさん上がっています。</p><p>『Holo ADV: SakuraSingularity.exe』は、2025年内にPCゲームプラットフォームの「Steam」で発売予定です。価格はと、手が届きやすいのも嬉しいポイントですね。</p><p>まだ具体的な発売日や、さくらみこ以外にどのホロライブメンバーが登場するかなど、謎に包まれた部分も多くありますが、それもまた楽しみの一つ。</p><p>気になる人は、今すぐSteamで「ウィッシュリスト」に追加して、最新情報を見逃さないようにしましょう！</p>","contentLength":2775,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"兎田ぺこら、Yahoo!カーナビに降臨！→先輩AZKiとの「特別掛け合いボイス」実装にファン歓喜「2人に挟まれるとか最高か？」「安全運転できないw」","url":"https://hololive-tsuushin.com/holonews/nabi/","date":1756325460,"author":"ホロミ","guid":821,"unread":true,"content":"<p>ヤフー株式会社が提供するスマートフォン向けカーナビアプリ「Yahoo!カーナビ」にて、大人気VTuber事務所「ホロライブ」所属のAZKiさんと兎田ぺこらさんが音声ナビを務める新企画が発表されました。</p><p>既存の「AZKiナビ」がリニューアルされると共に、新たに「兎田ぺこらナビ」が期間限定で登場。</p><p>さらに、2つのナビを同時購入すると聞ける特別な「掛け合いボイス」の存在も明らかになり、ファンから「これは買うしかない！」「耳が幸せすぎる」などの声が相次ぎました。</p><p>今回のコラボは、Yahoo!カーナビの人気機能「推しと一緒にドライブ（推しドラ）」の一環として行われるものです。</p><p>以前から提供され好評を博していたホロライブ所属の歌姫・AZKiさんのナビが、この度ボイスを録り下ろしでリニューアル。</p><p>それに加え、同事務所の超人気VTuberである兎田ぺこらさんが、満を持して期間限定で仲間入りすることが発表されました。</p><p>今回の発表で特にファンの心を鷲掴みにしたのが、AZKiナビとぺこらナビを両方購入することで解放される「特別な掛け合いボイス」機能です。</p><p>Yahoo!カーナビの公式X（旧Twitter）は、「2人に挟まれちゃうここだけの体験を是非お楽しみください」という魅力的なコメントと共にサンプルボイスを投稿。</p><p>まるで先輩のAZKiさんと後輩の兎田ぺこらさんが、助手席と後部座席で会話しているかのような、ファンにとっては夢のようなドライブが体験できる仕様となっています。</p><p>この豪華すぎるサプライズに、SNS上では「え、なにこれ最高か？」「2人に挟まれながら運転とか、安全運転できる自信ないw」「これは革命だろ…」「高速乗ったらぺこちゃんが褒めてくれるのかな？」といった歓喜と期待のコメントが殺到していました。</p>","contentLength":2102,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ABEMA特番】宝鐘マリン、ラプラス・ダークネスも参戦！VTuber＆声優18名による『真夏のゲームパーティー』が豪華すぎる！","url":"https://hololive-tsuushin.com/schedule/horogoe/","date":1756305119,"author":"ホロミ","guid":817,"unread":true,"content":"<p>VTuberグループ「ホロライブプロダクション」のメンバーと、声優さんたちが集まってゲームで盛り上がる『ホロごえっ！真夏のゲームパーティー』が開催されることが決定しました！</p><p>ABEMAの発表によると、この特別番組はされます。</p><p>今回の『ホロごえっ！真夏のゲームパーティー』は、なんと3部構成！それぞれ出演者もプレイするゲームも違うとのこと。</p><ul><li><ul></ul></li><li> 『スーパー マリオパーティ ジャンボリー Nintendo Switch 2 Edition ＋ ジャンボリーTV』</li></ul><ul><li><ul></ul></li></ul><ul><li><ul></ul></li></ul><p>『ホロごえっ！』は、VTuberの「ホロライブプロダクション」と豪華な声優さんたちが一緒にいろんな企画に挑戦するABEMAのオリジナル番組です。月に1回、90分の生放送で、いつもはMCの10名が番組を盛り上げています。</p><p>今回の『真夏のゲームパーティー』は、その夏休み特別バージョン！レギュラーMCだけでなく、たくさんのゲストを招いて、いつも以上にパワーアップした内容になっているんです。</p><p>もし当日見逃してしまっても大丈夫！放送後1週間は、ABEMAでで視聴することができます。</p>","contentLength":1244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・AZKi、「重大告知の告知」にファン騒然！大神ミオとの”共通点”からソロライブ開催説が浮上「完全に一致」「伏線か！？」","url":"https://hololive-tsuushin.com/holonews/azki-15/","date":1756218699,"author":"ホロミ","guid":813,"unread":true,"content":"<p>ホロライブ所属のVTuber、AZKiさんが自身の配信で「重大告知の告知」を行いました。</p><p>告知内容そのものよりも、その発表の”シチュエーション”が先輩・大神ミオさんのソロライブ発表時と酷似しているとの指摘が相次ぎ、「これはソロライブのフラグでは？」といった期待の声が殺到しました。</p><p>数々の平成の名曲を歌い上げた配信の終盤、予告されていた「重大告知」が発表されました。</p><p>しかし、その内容は「8月29日19時に、改めて重大告知を行う」というもの。いわゆる”告知の告知”という少し肩透かしな内容に、チャット欄は笑いと期待の入り混じったコメントで溢れました。</p><p>この発表を受け、AZKiさん自身も配信後にX（旧Twitter）を更新。「予想外の重大告知の重大告知でした！？！？ 8月29日19時・・・お見逃しなく！！！！！ 」とポストしました。</p><p>すると、あるファンから「」という考察が投稿され、瞬く間に拡散。</p><p>大神ミオさんがソロライブを発表した際と、今回のAZKiさんの告知配信のゲスト人数や形式が同じであるという”共通点”が指摘されたのです。</p><p>この鋭い考察に、ファンからは「うわ、本当だ！」「ミオしゃの時と完全に一致してる…」「これはソロライブ期待していいやつ！？」「運営さんの粋な伏線か！」と、期待の声が。</p><p>AZKiさん本人はこの説に直接言及していませんが、同じホロライブの先輩の成功例と重ね合わせるファンの考察は発表への期待感を高めています。</p>","contentLength":1749,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"轟はじめ、人生初のファーストクラスに搭乗！CAのVIP待遇に戸惑い「勝手がわかりません！」","url":"https://hololive-tsuushin.com/holonews/hajime-8/","date":1756206498,"author":"風歌","guid":812,"unread":true,"content":"<p>ホロライブのReGLOSSに所属する轟はじめさんが、人生初のファーストクラスに乗った際のエピソードを明かしました急な仕事のため飛行機のチケットを探したところ、お盆の時期と重なり空席が見つからず、やむを得ず人生で初めてファーストクラスを利用することになった轟さん。しかし、慣れない高級な空間に戸惑いの連続だったようです。</p><p>轟さんが配信で語ったファーストクラス体験は、驚きと戸惑いに満ちていました。ファーストクラスの座席は、隣の席と顔が見えないよう区切られており、広々として快適。まず驚いたのは、でした。しかし、ため、出てきた豪華な料理は「食べれんかな…いらんかな…」と、ほとんど食べられなかったとのこと。また、CAさんが「いつもファーストクラスご利用いただきありがとうございます」と挨拶に来ると、轟さんは思わず</p><div><div><div><div><p>って思いながらVIP対応されて</p></div></div></div></div><p>と、心の中でツッコミを入れ、VIP待遇に慣れていない様子を語りました。</p><p>ご親族の都合で、実家である北海道に帰省中だった轟さんが急に飛行機に乗ることになったのは、大事な収録に間に合わせるためでした。しかし、。一般の乗客も多いため、。そこで、当初の予定を変更して急いで戻る必要があった轟さんは、ファーストクラスのチケットを購入する決断をしました。</p><p>慣れないファーストクラスで、轟さんはどうしていいかわからず、そうです。隣の席の慣れた様子の乗客が、スリッパに履き替えたり、次々と注文したりする様子を見て、「こうやって楽しむもんかな？」と思ったものの、と語りました。</p><div><div><div><div><p>ずっとおとなしくして『オレンジください』って言ってもうオレンジ1杯だけ飲みました。</p></div></div></div></div><p>と、結局とのこと。しかし、</p><p>と、ファーストクラスの利用を満喫できず、後悔している様子も見られました。</p>","contentLength":2173,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・天音かなた、「恋愛に興味ない」と断言→リスナーからの「もし付き合ったら？」という質問に独特すぎる回答「80年後なら」「プロ意識の塊」","url":"https://hololive-tsuushin.com/holonews/kanata-23/","date":1756192459,"author":"ホロミ","guid":810,"unread":true,"content":"<p>ホロライブ所属のVTuber・天音かなたさんが自身の配信で恋愛観について言及。「恋愛に無縁の人生で、あまり興味もない」と語り、もし恋人ができた場合の独特なシミュレーションを披露しました。</p><p>リスナーから恋愛に関する話題を振られた天音さんは、「恋愛エアプ（恋愛経験がない人）ですけど、アドバイスはしますよ」と宣言。</p><p>高校時代の友人の恋愛相談に乗っていた経験や、少女漫画から得た知識を元にアドバイスをしていると明かしました。</p><p>配信が盛り上がる中、あるリスナーから「天界に好きな子がいるんだけどどうやったら打破できる？」と、明らかに天音さんを指すような質問が寄せられました。</p><p>これに対し天音さんは、一度は「」と優等生的な回答を試みるも、「かなたそは別に（そういう王道タイプでは）ないからね」と即座にセルフツッコミ。</p><p>そして、「ここまでの生涯で興味なかったことにいきなり興味を持つことは、まずないですね」とキッパリ。続けて「80年後ならね。結婚も辞さない」「アイドルをやめたからといって、恋愛感情が宿るかはわからない」と、ファンからのアプローチに対して冗談を交えつつも、極めて冷静な見解を示しました。</p><p>さらに話は「もし天音かなたに恋人ができたら？」という妄想に発展。天音さんは「みんなの思う彼女と違うが大丈夫？」と前置きしつつ、「全然昼過ぎまで寝て、『今から配信の準備するわ』って言ってDiscord返して…ミーティングして…」と、プライベートでも配信準備を最優先するであろう自身の姿を赤裸々に語りました。</p><p>最終的に「普通に配信第一ですよ」と断言した天音さん。この徹底した活動スタイルと、それを包み隠さず語る姿に、ファンからは「ここまで言われると清々しいw」「プロ意識の塊で好き」「80年後まで気長に待つか…」「あまりにもリアルなムーブで草」といったコメントが見られました。</p>","contentLength":2289,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ、「#うちのホロフレ」写真コンテストをドン・キホーテと開催！審査委員長は博衣こより","url":"https://hololive-tsuushin.com/schedule/hure/","date":1756190645,"author":"ホロミ","guid":809,"unread":true,"content":"<p>2025年8月26日、カバー株式会社が運営するVTuber事務所「ホロライブプロダクション」は、公式ぬいぐるみ（通称：ホロフレ）を使用した写真コンテストを、大手ディスカウントストア「ドン・キホーテ」とのコラボレーションで開催することを発表しました。</p><p>■ 応募期間2025年9月1日（月）10:00 ～ 9月30日（火）23:59</p><p>■ 結果発表2025年10月予定</p><p>審査委員長にはホロライブ所属の博衣こよりさんが就任することが明かされました。</p><p>今回のコンテストの主役となる「ホロライブ-Relax time-」ぬいぐるみシリーズ、通称「ホロフレ」は、多くのファンが、入手した「ホロフレ」を「うちの子」と呼び、旅行先やカフェなど様々な場所に連れ出しては、愛情のこもった写真を撮影してSNSに投稿する文化が自然発生的に生まれていました。</p><p>コンテストの発表はホロライブプロダクションの公式X（旧Twitter）で告知されました。</p><p>さらに、渋谷、秋葉原、梅田、宮崎橘通といった主要都市のドン・キホーテ店外サイネージでPR動画の放映も開始されるとのことで、コラボレーションの規模の大きさが伺えます。</p><p>この嬉しいサプライズ発表に、SNSは大きな盛り上がりを見せています。ファンからは「うちの子を全力で可愛く撮る時が来た！」「こよが審査委員長なら、写真をしっかり見てくれそう」「ドンキのサイネージ巡礼しなきゃ！」といった熱意あふれるコメントが続々と投稿されました。</p>","contentLength":1711,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・さくらみこ、配信中に謎の画面崩壊→博衣こよりが原因を「”悪魔の数字”に触れたから…」と指摘し話題に「ガチホラーで草」「運営に消されるぞw」","url":"https://hololive-tsuushin.com/holonews/miko-31/","date":1756189331,"author":"ホロミ","guid":808,"unread":true,"content":"<p>ホロライブ所属のVTuber・さくらみこさんのゲーム配信中に、突如画面全体が激しく乱れるという怪現象が発生。</p><p>後日、この現象について同じくホロライブ所属の博衣こよりさんが<a href=\"https://www.youtube.com/live/MfikD3pdSwI\" data-type=\"link\" data-id=\"https://www.youtube.com/live/MfikD3pdSwI\">自身の配信（朝こよ）</a>で取り上げ、「触れてはいけない話題に言及したせいでは？」と示唆しました。</p><p>ファンからは「タイミングが神がかってる」「本当に呪われてるみたい」などの声が相次ぎました。</p><p>事の発端は、先日行われたさくらみこさんのゲーム配信での出来事。さくらみこさんは、ポケットモンスターシリーズに登場する「コイキング」を釣りながらファンとの雑談を楽しむという、和やかな雰囲気で配信を行っていました。（本当は金のコイキングで殿堂入りする企画）</p><p>しかし配信の途中、ゲーム画面やさくらみこさん自身のアバター（Live2Dモデル）を含む画面全体に、まるでノイズが走ったかのように表示が激しく乱れるという現象が発生。</p><p>機材トラブルかと思われましたが、配信枠を改めて取り直したところ現象は収まったため、原因不明の怪奇現象としてファンの間で注目を集めていました。</p><p>このミステリアスな現象に、博衣こよりさんは、「とある話題をしていたらなんかガビガビするようになった」というリスナーからのコメントに着目。</p><p>こよりさんが言及した「とある話題」とは、先日ホロライブの夏の大型企画「ホロナツパラダイス」のグッズ販売において、一部商品が「66種類ランダム」で販売されると発表され、SNS上で大きな物議を醸した一件を指しているとみられます。</p><p>さくらみこさんがこの話題を出してからガビガビになってしまったという。</p><p>この偶然にしては出来すぎたタイミングに、ファンも騒然となりました。</p><p>この一連の流れに対し、ファンからは「マジで禁句になってて草」「運営からの警告メッセージか？w」「タイミングが良すぎてガチのホラー現象に見える」といったコメントが殺到。</p><p>また、「アーカイブでもバリバリしてた」という報告もあり、リアルタイムで起きた怪現象の爪痕が今も確認できる状態となっています。</p>","contentLength":2499,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ・大神ミオ、TOKYO FMの朝番組『ONE MORNING』に出演！2ndアルバムを語る","url":"https://hololive-tsuushin.com/schedule/mio-39/","date":1756134000,"author":"ホロミ","guid":751,"unread":true,"content":"<p>人気VTuberグループ「ホロライブ」に所属する大神ミオさんが、から、TOKYO FM/JFNのラジオ番組『ONE MORNING』にコメント出演します。</p><p>番組では、自身の2nd Album『My Sparkle』について語る予定です。</p><p>今回の出演では、大神ミオさんが2nd Album『My Sparkle』の魅力や制作秘話などを明かします。</p><p>さらに、アルバム収録曲の中から楽曲もオンエアされる予定です。</p><p>「ホロライブゲーマーズ」のメンバーとして、ゲーム配信を中心に活躍する大神ミオさん。</p><p>朝の人気番組で彼女のトークと音楽を楽しめる貴重な機会となりそうです。</p>","contentLength":691,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【衝撃】なぜVTuberが選ばれた？星街すいせい、Forbes「世界を変える30人」選出の理由と本人の想い","url":"https://hololive-tsuushin.com/holonews/suisei-43/","date":1756128222,"author":"ホロミ","guid":797,"unread":true,"content":"<p>VTuberグループ「ホロライブ」の0期生である星街すいせいさんが、なんと世界的に有名なビジネス雑誌「Forbes JAPAN」が選ぶ「世界を変える30歳未満の30人（Forbes JAPAN 30 UNDER 30）」の一人に選出されたのです。</p><p>これは、VTuberという文化が、エンターテイメントの世界で大きな影響力を持つ存在として認められた証ともいえる、歴史的な出来事となります。</p><p>今回のニュースのすごいところを、まずはおさらいしましょう。</p><ul><li><strong>「Forbes JAPAN 30 UNDER 30 2025」に選出</strong><ul><li>各分野で活躍する、未来を創る30歳未満の若き才能に贈られる、とても名誉ある賞です。</li></ul></li><li><strong>「Forbes JAPAN 2025年10月号」の表紙に登場</strong><ul><li>選出されるだけでなく、なんと雑誌の顔である「表紙」を飾っています。これは異例の大抜擢と言えるでしょう。</li></ul></li><li><ul><li>星街すいせいさんのこれまでの歩みや、活動にかける想いがじっくりと語られています。</li></ul></li></ul><p>一人のアーティストとして、星街すいせいさんの活躍が社会的に高く評価されたということです。</p><p>「でも、どうしてVTuberが？」と不思議に思う人もいるかもしれません。星街すいせいさんが選ばれたのには、納得する理由がありました。</p><p>星街すいせいさんは、彗星のごとく現れたスターの原石…ではなく、努力で道を切り拓いてきた実力派アーティストです。個人で活動を始めた後、ホロライブに加入したという経歴を持っています。</p><ul><li><strong>楽曲「ビビデバ」がVTuber史上最速で1億回再生突破（2024年）</strong><ul><li>一度聴いたら忘れられないキャッチーなメロディーと、MVは社会現象に。</li></ul></li><li><strong>自身初の日本武道館での単独ライブを成功（2025年）</strong><ul><li>多くのアーティストが目標とする夢の舞台で、満員の観客に。</li></ul></li></ul><p>これらの目覚ましい活躍は、もはやVTuberという枠を超え、日本の音楽シーン全体に大きな影響を与えています。</p><p>この歴史的なニュースを受けて、星街すいせいさん本人も自身の想いを語っています。</p><p>この言葉からは、「VTuber」という姿を通して、自身のパフォーマンスや歌、そして魂でファンを魅了しているんだという、彼女の強いプライドとメッセージが伝わってきますね。</p><p>「30歳未満」という選出理由に対して、永遠の18歳（と主張している）らしい、ユーモアあふれる反応に、ファンからは「すいちゃんらしい！」「おめでとう！」といった祝福のコメントが殺到。</p><p>星街すいせいさんの「Forbes JAPAN 30 UNDER 30」選出は、一人の成功によるものではありません。</p><p>これは、VTuberという存在が、単なるネット上のキャラクターではなく、世の中に感動や影響を与えることができる「アーティスト」として、社会的に認められたことを示す大きな一歩になったのではないでしょうか。</p>","contentLength":3145,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【悲報】天音かなた、室温29度の地獄…！猛暑の最中にエアコン故障でファン騒然","url":"https://hololive-tsuushin.com/holonews/kanata-22/","date":1756085100,"author":"ホロミ","guid":796,"unread":true,"content":"<p>「ホロライブ」4期生の天音かなたさんが、2025年8月24日、猛暑のさなかに自宅リビングのエアコンが故障したことを自身のSNSで報告しました。</p><p>事の発端は、8月24日の夜に投稿された天音かなたさんのポストでした。</p><p>夏の最も暑い時期に起きた悲劇に、リプライ欄は心配の声で溢れました。</p><p>さらに、その数時間後にはサブアカウントで具体的な状況を報告。</p><p>リビングの室温が29度であることが明かされ、事態の深刻さが改めて浮き彫りになりました。かなたさんは翌日に業者へ連絡するとしていますが、一刻も早い復旧が待たれます。</p><p>実は、天音かなたさんが不運に見舞われたのはこれが初めてではありません。つい先日には、鍵を忘れて外出し、オートロックによって家から締め出されてしまうという出来事があったばかり。</p><p>ファンからは「最近災難続きでは？」と、立て続けに起こるトラブルを心配する声も上がっています。</p><p>一年で最もエアコンが活躍するこの時期の故障という、あまりにもタイミングの悪い出来事に、同情の声が集まっている状況です。</p><p>この一連の報告を受け、ファンからはかなたさんの体調や、一緒に暮らしているペット（うさぎ）を気遣うコメントが多数寄せられています。</p><p>「この時期に壊れるのはキツイ」「エアコン業者はこの時期どこも忙しいからな ワンチャン当日は捕まらない可能性あるよな」「この暑さで冷房無しはウサちゃんもヤバイ」</p><p>また、「リビング以外にもエアコンはあるはずだから、そちらで避難してほしい」といった安堵の声や、「修理業者は今、一番忙しい時期だから早めの連絡を！」といった具体的なアドバイスも多く見られました。</p><p>天音かなたさんは「明日連絡ちます」と投稿しており、25日以降に修理業者へ連絡を取るものと見られます。</p><p>しかし、ファンが指摘するように、夏場のエアコン修理は依頼が殺到し、業者の到着まで数日かかるケースも少なくありません。</p><p>まずは熱中症などに十分気を付けて、無事にこの夏を乗り越えてほしいですね。今後の続報を待ちたいと思います。</p>","contentLength":2482,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【取材レポ】ホロライブ好きの新たな憩いの場！神田「cafe pon」が温かすぎた。","url":"https://hololive-tsuushin.com/holonews/cafe-pon/","date":1756081208,"author":"ホロミ","guid":794,"unread":true,"content":"<p>今回訪れたのは、神田駅から徒歩5分、秋葉原からも徒歩圏内という好立地にある「cafe pon」。</p><p>ここは、ただの喫茶店ではありません。人気VTuberグループ「ホロライブ」のファンが集う、憩いの場となっているのです。</p><h3>「おかえリ！」店長の温かい声が出迎えるアットホームな空間</h3><p>店内に入ると、店長が「おかえり！」と優しい笑顔で出迎えてくれます。その一言で、初めて訪れた緊張がふっと和らぎました。</p><p>壁や棚には、所狭しとホロライブのグッズが飾られています。</p><p>驚くことに、店長が持参したのはテーブル上の公式ぬいぐるみだけで、その他ほとんどのグッズはお客さんから寄贈されたものだそう。</p><p>ファンに愛され、共に作り上げられている空間であることが伝わってきます。</p><p>店長のこんちさんですが、元々ラーメン店を営んでいたそうで、「何か新しいことを」と一念発起し、2024年10月にオープンしたこのカフェ。</p><p>当初は一般的なカフェとして営業していましたが、「」と考えたことが転機となりました。</p><p>その想いは見事に形となり、今では多くのファンが訪れ、初対面の客同士がホロライブという共通の話題で語り合う、アットホームな光景が日常になっています。</p><p>「cafe pon」の魅力は、その温かい雰囲気だけではありません。提供される食事やドリンクも絶品です。</p><p>イチオシは、<strong></strong>と、店主が研究を重ねたこだわりの。</p><p>今回、私は「チーズカレー」とコーヒーを注文しました。 </p><p>運ばれてきたカレーは、スパイスの香りが食欲をそそります。</p><p>一口食べると、家庭ではなかなか出せない、旨味が凝縮された濃厚な味わいが口いっぱいに広がりました。</p><p>苦味や酸味の角がなく、驚くほどマイルドな口当たり。カレーの風味を邪魔することなく、後味をすっきりとさせてくれます。気づけば飲み干してしまっているほど、心地よい一杯でした。</p><p>常連さんを飽きさせないようにと、限定メニューも提供しているそうです。</p><p>訪れるたびに新しい味に出会えるのも楽しみの一つですね。</p><p>「cafe pon」は、ファン同士の交流の場としてだけでなく、一人の時間を過ごしたい人にも優しいお店です。</p><p>されており、PC作業やスマートフォンの充電にも困りません。</p><p>大好きな雰囲気の中で、仕事や勉強に集中するのにも最適です。</p><p>さらに、店舗の貸し切りにも対応しているそうなので、オフ会などのイベント利用にもぴったりです。</p><p>「cafe pon」は、ホロライブファンはもちろん、美味しいカレーやコーヒーを味わいたい人にもおすすめしたい、心温まる隠れ家のようなカフェでした。</p><p>神田や秋葉原にお越しの際は、ぜひ一度訪れてみてはいかがでしょうか。</p><ul></ul>","contentLength":3156,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"MJ麻雀が姫森ルーナ一色に！限定グッズや録り下ろしボイス満載のコラボ祭りが8/25開幕！","url":"https://hololive-tsuushin.com/schedule/ru-na-2/","date":1756047600,"author":"ホロミ","guid":784,"unread":true,"content":"<p>「ホロライブ」の4期生、”ルーナ姫”こと姫森ルーナさんと、大人気オンライン対戦麻雀ゲーム「セガNET麻雀 MJ」（以下、MJ）の超豪華コラボイベントが、2025年8月25日（月）から開催されることが発表されました！</p><p>今回のコラボイベントは、大きく分けて4つの目玉企画があります。</p><ul><li><strong>① 可愛い「プチプロ」が大量追加！ボイスは新規録り下ろし！</strong>対局を盛り上げてくれるアバター「プチプロ」に、様々な衣装のルーナ姫が新登場！ボイスは全てこのコラボのために録り下ろした特別仕様です。</li><li>ゲーム内でガチャを引くと貰えるポイント（MP）で、豪華なオリジナルグッズが当たるキャンペーンに応募できます。</li><li>「麻雀はルールが難しくて…」という人も大丈夫！誰でも簡単に遊べるミニゲーム「ぷちじゃン！」がコラボ仕様で登場します。</li><li>対局やミニゲームをプレイして「ぷちじゃンコイン」を集めると、卓背景やアバターパーツなど、コラボ限定のアイテムと交換できます。</li></ul><p>では、具体的にどうすればイベントを最大限楽しめるのでしょうか？やるべきことを分かりやすくまとめました！</p><p>イベントの目玉は、なんといっても可愛いルーナ姫のプチプロです。特におすすめなのが「姫森ルーナコラボステップアップ10連招来（ガチャ）」！</p><p>このガチャは、引けば引くほどSRランクの姫森ルーナが手に入るチャンスがアップします。</p><h4>Step2：対局やミニゲームで「ぷちじゃンコイン」を集めよう！</h4><p>ゲームをプレイすると、「ぷちじゃンコイン(姫森ルーナ)」という専用コインが手に入ります。このコインは、コラボ限定アイテムと交換できる重要なアイテムです。</p><ul><li> 「ホロライブコラボCPU対局」や「ランク戦」でどんどん対局しよう！毎日最初の1局はコインが貰える宝箱が多く出現するので、毎日ログインするのがおすすめです。</li><li> ミニゲーム「ぷちじゃン！～姫森ルーナコラボ～」をプレイ！クリアすれば報酬でコインが貰えます。</li></ul><p>集めたコインは、卓背景「姫森ルーナ ver.水着」などの豪華アイテムと交換できます。</p><p>対象のガチャを引くと「MP」というポイントが貯まります。このMPを使って、ここでしか手に入らない超レアなオリジナルグッズの抽選に応募できます。</p><p>MP獲得期間:8/25(月)10:00 ～ 9/29(月)5:00 応募期間:8/25(月)10:00 ～ 10/1(水)15:00</p><p>応募期間はイベント終了後すぐなので、忘れずに応募しましょう！</p><p>姫森ルーナファンも、麻雀ファンも、みんなが楽しめる今回の超大型コラボ。まずはアプリをダウンロードして、8月25日（月）のイベント開始に備えましょう！</p>","contentLength":3047,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"兎田ぺこらが白銀ノエルに振る舞った「大バズりレシピ3選」が絶品すぎる！団長の感動コメントも紹介","url":"https://hololive-tsuushin.com/holonews/pekora-46/","date":1756042553,"author":"風歌","guid":792,"unread":true,"content":"<p>ホロライブ3期生の兎田ぺこらさんと白銀ノエルさんが、オフコラボ配信で以前の七夕企画での対決で敗北した兎田さんが、そのご褒美として白銀さんに手料理を振る舞うという企画を実施しました。今回の配信では、SNSで「大バズりした」という3つのレシピを披露。そのプロ顔負けの手際の良さと、出来上がった料理の衝撃的な美味しさに、白銀さんは終始感動しっぱなしでした。</p><p>今回のコラボは、2025年の七夕に配信された対決企画がきっかけでした。白熱した対決の結果、惜しくも敗れた兎田さんが、罰ゲームとして白銀さんに手料理を振る舞うことに。しかし、兎田さんはこれを罰ゲームではなく、白銀さんへのご褒美と位置づけ、本気の料理配信を準備しました。料理のテーマは、。さらに、兎田さんが掲げたコンセプトは！ 健康的なイメージがある兎田さんとは真逆の、に、企画を聞いた白銀さんも期待を隠せない様子でした。</p><p>今回の配信で兎田さんが披露したのは、以下の3つのレシピです。</p><p>まず1品目に作られたのは、という画期的なレシピ。 「え、嘘？大変じゃないんですか？」と驚く白銀さんをよそに、兎田さんは手際よくトルティーヤとひき肉をフライパンに乗せ、あっという間に焼き上げていきます。普段ビッグマックを食べない白銀さんは、</p><p>と、に感動した様子。出来上がった料理を一口食べると、白銀さんは目を見開いて叫びました。</p><p>その再現度と美味しさには、を見せていました。</p><p><strong>2. やみつきになること間違いなし！「バリバリソーセージ」</strong></p><p>2品目は、ワンタンの皮でソーセージを巻いて揚げる「バリバリソーセージ」。 兎田さんは白銀さんがピンと来てない様子に</p><p>と、ツッコミを炸裂。 も登場し、見事な手つきでソーセージを揚げていきます。カリッとしたワンタンの皮とジューシーなソーセージの組み合わせに、白銀さんは思わず</p><p>とコメント。に、白銀さんの箸が止まらない様子でした。</p><p>そして最後の3品目は、前回の企画で失敗に終わった。 兎田さんは失敗の原因をしっかり分析し、今回は冷凍した小さなバターを使うという完璧な作戦を立てていました。ホットケーキミックスを牛乳の代わりに豆乳で溶いた生地に、冷たいバターをくぐらせて揚げていきます。ジュワッと美味しそうな音と共に、黄金色に揚がったバターに白銀さんのテンションも最高潮に。一口食べると、白銀さんは言葉を失い、幸福そうな表情に。</p><p>と、感動のコメントを連発。兎田さんが作る揚げバターのリベンジは見事に成功し、今回のご褒美コラボを締めくくりました。</p>","contentLength":3081,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"鷹嶺ルイ、初体験の滝行で大神ミオに異変を感じる！「滝が大神ミオを避けてる…？」","url":"https://hololive-tsuushin.com/holonews/rui-6/","date":1756026149,"author":"風歌","guid":790,"unread":true,"content":"<p>ホロライブ所属の鷹嶺ルイさんが自身の配信で、大神ミオさんのお誕生日企画として体験した滝行について語りました。当初は「滝を見に行く」と聞いていたにもかかわらず、まさかの「滝に打たれに行く」という過酷な内容。しかし、その滝行中に、なんと大神ミオさんの身に不思議な現象が起きたように見えたことを明かしました。</p><p>今回の滝行は、大神ミオさんが鷹嶺ルイさんを「おもてなし」するために計画されたサプライズ企画でした。鷹嶺さんは事前に「」と聞かされており、まさかそうです。山道を登り、ついに滝に到着した鷹嶺さんは、インストラクターから「」と厳しい注意点を聞かされました。「注意事項が怖すぎ…！」と恐怖に震えながらも、鷹嶺さんは意を決して滝の中へ。鷹嶺さんは、</p><div><div><div><div><p>確かに姿勢一瞬でも悪くしたら体勢がおかしくなって首やられるくらいの水圧だった。</p><p>あと、本当にビックリしたのが、マジで声を出さないとキツイ</p></div></div></div></div><p>と、滝行での経験を吐露。という、非常に不思議な体験したことも明かしました。しかし、滝行を終えた後は、になり整ったと語りました。鷹嶺さんの滝行が終わった後、次は大神さんの番に。すると、鷹嶺さんは目を疑うような光景を目にしたと言います。なんと、汚れを落とすという2回目のというのです。</p><div><div><div><div><p>なんかね、見てたらそもそもみたいな。</p></div></div></div></div><p>この不思議な現象は、鷹嶺さんだけでなく、同行していたマネージャーさんも同じように感じたと語りました。</p><h4>滝行後の手厚いおもてなし「滝行やらせた奴らとは思えない。」</h4><p>滝行を終えた後、鷹嶺さんは冷え切った体を温めるために、大神さんが用意してくれたバスローブやバスタオルで温かく包み込まれます。</p><div><div><div><div><p>もう私が出てきた瞬間にさ、すぐバスローブと何やら全部温かいものにくるまれる私。手厚い。</p></div></div></div></div><p>この手厚いおもてなしに、鷹嶺さんは「」と語りました。最終的に鷹嶺さんは、帰り道にインストラクターさんと滝トークで大盛り上がり。その様子を見た大神さんが「ルイはね、本当に滝が好きなんだね」と微笑ましく語っていたことを告白しました。</p>","contentLength":2527,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【食レポ】さくらみこが一蘭の”塩卵”を大絶賛！ラーメンより美味しかった理由とは？","url":"https://hololive-tsuushin.com/holonews/mico/","date":1756006211,"author":"ホロミ","guid":789,"unread":true,"content":"<p>「ホロライブ」の0期生、さくらみこさんが、白上フブキさん（1期生/ゲーマーズ）と猫又おかゆさん（ゲーマーズ）と共に、人生で初めてラーメン店「一蘭」を訪れました。</p><p>もちろんお目当ては絶品の豚骨ラーメン…のはずが、みこさんは配信で「ラーメンも美味しかったけど…」とまで言わしめた、衝撃的なメニューに出会ってしまったとのこと。</p><p>みこさんがラーメン以上に心を奪われたメニュー、その正体は…ずばり、サイドメニューのでした！</p><p>配信の中で、みこさんはその時の感動を次のように語っています。</p><div><div><div><div><p>でも1番美味しいなって思ったのが卵がめっちゃ美味しかった。</p></div></div></div></div><p>そのおいしさは、絶妙な塩加減と、みこさんが「すごいしっとりしてるタイプ」と表現した、完璧な半熟具合にあるようです。</p><p>この感動には、同行していた猫又おかゆさんも「これ美味しいよね。」と深く共感。ホロライブメンバー2人が揃って認める、間違いないおいしさのようですね。</p><p>もちろん、主役のラーメンも「めっちゃもちろん美味しい」と、みこさんはしっかり堪能した様子。初めてということで、麺の硬さや味の濃さなどは全て「デフォルト（基本）」で注文したそうです。</p><p>また、隣の席と仕切られた「味集中カウンター」や、声を出さずに札で注文できるユニークなシステムにも「おもろ！」と興味津々。特に、人目を気にせず食事に集中できる環境は「VTuber向けやん！」と、とても気に入った様子でした。</p><p>みこさんが「塩卵」を絶賛すると、コメント欄のリスナーからは「あれマジでうまいよな」「わかる！」といった共感の声が多く寄せられました。</p><p>さらに、「半分食べて残りはラーメンに入れる」といったファンならではの”通”な食べ方が紹介されると、みこさんは「そうなんだ！？」と驚きの反応。</p><p>みこさん自身は「あったかくしたいからラーメンにぶち込んでる」と語り、一つの卵をきっかけに、様々な食べ方談義で盛り上がりを見せました。</p><p>もし次に一蘭を訪れる機会があれば、ラーメンと一緒に、この「半熟塩ゆでたまご」を注文してみてはいかがでしょうか？</p>","contentLength":2528,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】星街すいせい、ホラゲが怖すぎてさくらみこを招集→本当に”リア凸”される神展開が話題に！","url":"https://hololive-tsuushin.com/holonews/micomet-6/","date":1756005269,"author":"ホロミ","guid":788,"unread":true,"content":"<p>大人気VTuberグループ「ホロライブ」の0期生、さくらみこさんと星街すいせいさん。ビジネスパートナー「miComet（みこめっと）」として知られる二人の仲の良さは多くのファンが知るところですが、先日その絆が形になりました。</p><p>事の発端は、みこさんがすいせいさんに最近流行っているホラーゲームを勧めたことでした。</p><p>当初「」と伝えていたみこさんでしたが、すいせいさんは一人でゲーム実況の収録を開始します。</p><p>しかし、ゲームの恐怖は想像以上だったようで、すいせいさんからみこさんへ助けを求めるLINEが。ただ、そこは素直になれないすいせいさん。</p><div><div><div><div><p>「うちのお母さんのご飯あるよ。」「ご飯食べたいよね。」</p></div></div></div></div><p>「お母さんのご飯」と「みこさんの定休日」を必死にアピールし、遠回しに助けを求めるすいせいさん。このやり取りだけでもファンの間では「可愛すぎる」と話題になっていましたが、話はここで終わりませんでした。</p><p>後日行われたすいせいさんのホラーゲーム配信開始から約13分後、ゲームに絶叫するすいせいさんの部屋に「まじやばいから」とさくらみこさん声が。</p><p>この一連の流れ、特に伝説となった”リア凸”シーンには、リアルタイムで見ていたファンから、</p><ul></ul><p>さくらみこさんと星街すいせいさんは、ホロライブ0期生としてデビューした同期のような関係であり、プライベートでも非常に仲が良いことで知られています。</p><p>今回のリア凸は、そんな二人の強い信頼関係があるからこそ実現したサプライズと言えるでしょう。母街（すいせいさんのお母さん）とみこさんが仲が良く、家族ぐるみの温かい付き合いが、今回のエピソードに繋がっています。</p><p>怖いものは苦手ながらも、みこさんの助けを借りてホラーゲームに挑戦したすいせいさん。そして、パートナーのSOSにリアルで応えたみこさん。</p><p>今回の出来事は、二人の絆の強さを改めて感じられる瞬間でした。</p>","contentLength":2283,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"兎田ぺこら、マミーのために食事制限中に奔走！「ヘルシーごはん」を探す親孝行な一面が明らかに","url":"https://hololive-tsuushin.com/holonews/pekora-45/","date":1755961367,"author":"風歌","guid":786,"unread":true,"content":"<p>ホロライブ所属の兎田ぺこらさんが、自身の配信でぺこらマミーとの食事の約束のために、ヘルシーで美味しいお店を一生懸命探している親孝行な一面が明らかになりました。また、現在ジムに通いストイックな食事制限も行っている兎田さんが誘惑に苦しむ一面も現れました。</p><p>ことの発端は、ぺこらマミーからの「またお茶したい」というお誘いでした。兎田さんは快諾したものの、マミーの反応から、ただお茶をするだけでなく「」という気持ちを察したそうです。</p><div><div><div><div><p>マミーにさ、『お茶しよう』って言われた時にさ、そのいつでも家行くからねって言ったら『あ、うん』ていう反応だった。</p></div></div></div></div><p>しかし、現在兎田さんはため、厳しい食事制限を行っていました。ため、一緒に行けるお店は限られてしまいます。それでもマミーの願いを叶えたい兎田さんは、「ヘルシーでいい感じの飯屋ないか」と、お店探しに意欲を見せました。</p><p>普段、という兎田さん。「」と語り、アイスクリームでさえ週に1度ほどで我慢していると言います。しかし、リスナーから「パンケーキを食べに行こう」とコメントされると、</p><div><div><div><div><p>食べて～！あのふわふわパンケーキ。クリームべっちょりつけて。</p><p>カロリーボム。本当だよ。それ食べた瞬間にさ、やばいと思うわ。</p></div></div></div></div><p>と、カロリー爆弾となるスイーツに対する強い誘惑に苦しむ場面も見られました。また、トレーナーに食事制限を気にせず好きなものを食べて良い日である「チートデーを作っては？」とリスナーから提案されても、</p><div><div><div><div><p>絶対ダメだ。『兎田さん何言ってるんですか？』て絶対言われる</p></div></div></div></div>","contentLength":1915,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【百鬼あやめ】「めっちゃくっついてる…」映画館でやらかした服がポップコーンだらけになった失敗談","url":"https://hololive-tsuushin.com/holonews/ayame-15/","date":1755929347,"author":"ホロミ","guid":783,"unread":true,"content":"<p>VTuberグループ「ホロライブ」の2期生、百鬼あやめさん。普段は「お嬢」の愛称で親しまれ、その可愛らしい話し方と清楚な雰囲気で多くのファンから慕われています。</p><p>しかし、そんなあやめさんが先日、自身の配信で<strong>「映画に集中してたら服がポップコーンでベタベタだった」</strong>を告白し、「可愛すぎる」「おっちょこちょいな所も好き」とコメントがありました。</p><p>事の発端は、あやめさんが映画を鑑賞していた時のこと。</p><p>物語にすっかり夢中になっていたあやめさんは、キャラメルポップコーンを手に、スクリーンに釘付けになっていました。</p><p>暗い館内で無心でポップコーンを食べていたあやめさん。しかし、映画が終わり、トイレの鏡で自分の姿を見て愕然とします。</p><p>なんと、</p><div><div><div><div><p>キャラメルってちょっとペタッとしてるじゃん。 それが服にめっちゃ食べカスくっついてた。</p></div></div></div></div><p>映画に集中するあまり、ポップコーンが服にこぼれていることに全く気づかなかったようです。</p><p>慌ててトイレで払い落としたそうですが、その時の恥ずかしさを赤裸々に語ってくれました。</p><p>このあやめさんの告白に、配信のコメント欄やSNSではファンから喜びの声が殺到しました。</p><ul><li>「お嬢がポップコーンまみれになってるの想像したら可愛すぎた」</li></ul><p>百鬼あやめさんといえば、ホロライブの中でも特に「清楚」や「お嬢様」といったイメージが強いメンバーの一人です。</p><p>しかし、今回のエピソードのように、時折見せるも魅力の一つだと感じました。</p>","contentLength":1781,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ドンキコラボ】推しと一緒にお出かけ！ドンキで買えるホロぬいぐるみが8月23日発売！","url":"https://hololive-tsuushin.com/schedule/donki-2/","date":1755874800,"author":"ホロミ","guid":779,"unread":true,"content":"<p>大人気ホロライブタレントたちの新作ぬいぐるみ<strong>「hololive friends with u」と「hololive friends to Go」</strong>が、2025年8月23日（土）から全国のドン・キホーテとアピタの対象店舗で発売されることが決定しました！</p><p>今回のグッズは、いつでもどこでも推しと一緒にいられる夢のようなアイテムというコンセプトです。</p><p>今回登場するのは、コンセプトが違う2種類のぬいぐるみ。あなたの推し活スタイルに合わせて選べます！</p><h4>ちょこんと可愛いおすわりタイプ「hololive friends with u」</h4><p>お部屋に飾るのにぴったりな、ふわふわ素材のおすわりぬいぐるみです。机の上やベッドサイドにちょこんと座らせれば、いつでも推しがあなたを見守ってくれます。</p><ul><li> デフォルメされたデザインが超キュート！キャラクターによってサイズが違うのもポイントです。</li></ul><h4>一緒にお出かけ！マスコットタイプ「hololive friends to Go」</h4><p>カバンにつけて持ち歩くのに最適なマスコットぬいぐるみ。一緒にお出かけして、色々な場所で「ぬい撮り（ぬいぐるみと写真を撮ること）」を楽しめちゃいます！</p><ul><li> 持ち歩きやすいコンパクトなサイズ感。いつでもどこでも推しと一緒です！</li></ul><p>今回のコラボは、ただぬいぐるみを発売するだけではありません。</p><p>なんと、対象商品をに、限定の描き下ろしポストカード（全5種）がランダムで1枚もらえます！</p><p>このために描き下ろされた特別なイラストなので、ファンなら絶対にゲットしたいところ。ランダム配布なので、どのタレントが出るかドキドキ感も楽しめます。 ※なくなり次第終了なので、早めにお店に行くのがおすすめです。</p><p>さらに、キャンペーン期間中は、ホロライブEN（イングリッシュ）で活躍するによる、録り下ろしの店内ナレーションが流れます！</p><p>ドン・キホーテの店内でベールズさんの声が聞けるなんて、まさにスペシャルな体験！お買い物がもっと楽しくなること間違いなしです。</p><p>最後に、当日スムーズに買い物ができるように、大事なポイントを3つにまとめました。行く前にもう一度チェックしてくださいね！</p><ol start=\"1\"><li><ul><li>お店の状況によっては、があります。開店時間より少し早めにお店の情報を確認すると安心です。</li></ul></li><li><ul><li>たくさんの人が買えるように、というルールがあります。同じキャラクターのぬいぐるみを複数買うことはできないので注意してください。</li><li>違うキャラクターなら、それぞれ1個ずつ買うことができます。</li></ul></li><li><ul><li> 公式サイトで公開されている「商品取扱店舗一覧」を必ず確認してからお家を出ましょう！</li></ul></li></ol>","contentLength":2979,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】大神ミオ直伝！百鬼あやめが「うまい！」と絶賛した本格麻婆豆腐レシピを完全公開！","url":"https://hololive-tsuushin.com/holonews/mio-40/","date":1755871176,"author":"ホロミ","guid":780,"unread":true,"content":"<p>ホロライブゲーマーズ所属の「大神ミオ」さんが、2025年の誕生日記念配信で、ゲストのホロライブ2期生「百鬼あやめ」さんに手料理を振る舞い、そのレシピが「お店レベルだ！」とファンの間で大きな話題になっています。</p><div><div><div><div><p>うーん。美味しい。 しかもね、豆腐にね、ちゃんと染みてるのが美味しいです。</p></div></div></div></div><p>あやめさんが思わず「ご飯欲しい！」と唸った、愛情たっぷりの本格麻婆豆腐。実はこのレシピ、ミオさんが普段からお家で作っているという秘伝のレシピなんです。</p><p>この記事では、配信で公開された「ミオしゃ家の麻婆豆腐」の材料から作り方のコツまで、誰でも再現できるように分かりやすく解説します！</p><p>配信で紹介された材料と作り方の手順をまとめました。ミオさんが語った「美味しくなるポイント」も一緒にチェックしていきましょう！</p><ul></ul><ul></ul><ol start=\"1\"><li><ul><li>ニンニク、生姜、長ネギはみじん切りにしておきます。</li><li> 豆腐はキッチンペーパーに包んで、しっかりと水気を切っておきましょう。こうすることで味が染み込みやすくなります！</li></ul></li><li><ul><li>フライパンに油をひき、みじん切りにしたニンニクと生姜を入れて、香りが出るまで炒めます。</li><li>香りが出てきたら、長ネギを加えてしんなりするまでさらに炒めます。</li></ul></li><li><ul><li>ひき肉を加え、赤いところがなくなり、透明な油が出てくるまでパラパラになるように炒めます。</li></ul></li><li><ul><li> いったん火を止め、豆板醤を加えて全体に混ぜ合わせます。次に甜麺醤も加えて、同じように混ぜます。止める。なんかポインなんて止めるんですか?調味料を…入れて痛めると焦げる。ああ、そういうことか。そう。</li></ul></li><li><ul><li>肉味噌状になったところに【合わせ調味料】をすべて入れ、再び火をつけます。</li><li>沸騰してきたら、一口大に切った豆腐を入れ、味が染み込むように少し煮込みます。</li></ul></li><li><ul><li> 豆腐に味が染みてきたら、水溶き片栗粉を回し入れ、ダマにならないよう素早く混ぜてとろみをつけます。入れたらすぐ混ぜる。はい。はい。入れました。ちゃ、すぐ混ぜて混ぜて</li></ul></li><li><ul><li>お皿に盛り付けたら完成！お好みで最後にごま油や黒コショウをかけると、さらに風味がアップします。</li></ul></li></ol><p>実はこのおもてなし企画、当初は同期の白上フブキさんのために「激辛麻婆豆腐」を作る予定だったとのこと。</p><p>しかし、フブキさんが急遽来られなくなったため、あやめさんに声をかけたという経緯があったそうです。</p><p>辛いものが少し苦手なあやめさんのために、豆板醤の量を調整して辛さ控えめに作るミオさんの優しさが、配信内では見られました。</p><h3>反応：「めっちゃうまい！」あやめのお箸が止まらない！</h3><p>ミオさんが愛情を込めて作った麻婆豆腐を一口食べたあやめさんは、「美味しい！」と満面の笑み。</p><div><div><div><div><p>ご飯をそられるちょうどいい濃さなんですよ。 これめっちゃうまいです。</p></div></div></div></div><p>その美味しさはプロの料理のようで、ひき肉の旨味と豆腐にしっかり染み込んだタレのバランスが絶妙だったようです。あっという間に完食し、「みおちゃんの愛情も感じられた大満足です」と、ミオさんのおもてなしは大成功に終わりました。</p><p>今回ご紹介した大神ミオさんの麻婆豆腐レシピは、いくつかのポイントを押さえるだけで、誰でも簡単にお店の味を再現できる「レシピ」です。</p>","contentLength":3824,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】星街すいせい、ついに世界へ！コカ・コーラ公式からの「匂わせ投稿」にファン騒然！","url":"https://hololive-tsuushin.com/last-schedule/suisei-41/","date":1755788400,"author":"ホロミ","guid":774,"unread":true,"content":"<p>「彗星の如く現れたスターの原石！」というキャッチコピーでおなじみ、VTuberグループ「ホロライブ」0期生の星街すいせいさんが、世界的な飲料メーカー「コカ・コーラ」とコラボするのではないかという噂が、話題となっています！</p><p>事の発端は、2025年8月22日の朝コカ・コーラの公式SNSから発信された、ある「匂わせ」投稿。</p><p>この短い一文がきっかけとなり、情報は瞬く間に拡散。コカ・コーラの公式アカウントが、星街すいせいさんを強く連想させるようなシルエットの投稿を行いました。</p><p>「そもそも、なぜそんなに大騒ぎになっているの？」と思う方もいるかもしれません。それには、星街すいせいさんのこれまでの活躍が大きく関係しています。</p><p>星街すいせいさんは、VTuberという枠を超えて活躍するアーティストの一人です。圧倒的な歌唱力でファンを魅了し、有名アーティストが多数出演する音楽チャンネル「THE FIRST TAKE」への出演や、武道館での単独ライブを成功させるなど、輝かしい実績を積み重ねてきました。</p><p>そんなすいせいさんが、誰もが知る世界的企業であるコカ・コーラとタッグを組むかもしれないのです。</p><p>この「匂わせ」投稿を受けて、SNS上ではファン（通称：星詠み）たちから喜びと期待の声が上がっています。</p><ul><li>「限定デザインボトルとか出るのかな？楽しみすぎる！」</li></ul><p>など、コラボが実現した際の具体的な展開を予想する声も多く見られました。</p>","contentLength":1720,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["hololive"]}