{"id":"BRWJ2YmdUFozprkKz1ZEKUaA7rsvNpb43dpSivrpocJ7GMKt","title":"ホロライブ通信","displayTitle":"hololive tsuushin fan site (JP)","url":"https://hololive-tsuushin.com/feed/","feedLink":"https://hololive-tsuushin.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":16,"items":[{"title":"【ホロライブ】ときのそら、9周年記念イベント「9th Anniversary Party」をぴあアリーナMMで開催決定！「夢は、ひとつ先のステージへ」","url":"https://hololive-tsuushin.com/schedule/soras/","date":1794019629,"author":"ホロミ","guid":1728,"unread":true,"content":"<p>VTuberグループ・ホロライブ所属の「ときのそら」さんが、自身のX（旧Twitter）および公式情報を更新し、活動9周年を記念するイベント『ときのそら 9th Anniversary Party』の開催を特報として発表しました。</p><p>開催日は2026年11月7日（土）、会場は数多くのアーティストが伝説を残してきた「ぴあアリーナMM」です。</p><p>特報を受け、ファン（そらとも）の間では早くも期待の声が高まっています。横浜の地に響き渡る歌声と、記念すべきパーティーがどのようなものになるのか、11月の開催に向けて注目が集まります。</p><p>『ときのそら 9th Anniversary Party』は、2026年11月7日（土）にぴあアリーナMMにて開催予定です。</p>","contentLength":805,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"常闇トワ＆獅白ぼたんのサイン入り色紙が当たる！『灰仭巫覡』新PV＆オリジナルソング公開記念キャンペーン開催","url":"https://hololive-tsuushin.com/schedule/towabotan/","date":1788534000,"author":"ホロミ","guid":883,"unread":true,"content":"<p>大暮維人先生が描く人気漫画『灰仭巫覡（カイジンフゲキ）』のオリジナルソングと新PVの公開を記念し、2025年9月5日より豪華プレゼントキャンペーンがスタートしました。</p><h3>新PV公開！常闇トワ＆獅白ぼたんが歌うオリジナルソング</h3><p>2025年9月3日、講談社の「マガジンチャンネル」にて『灰仭巫覡』の新たなプロモーションビデオが公開されました。</p><p>このPVのために書き下ろされたオリジナルソング『君と明かした夜』は、ホロライブ所属の人気VTuberである常闇トワさんと獅白ぼたんさんが歌唱を担当。</p><p>今回の発表を記念して、抽選で1名様にが当たるキャンペーンが開催されます。</p><ol start=\"1\"><li><strong>『灰仭巫覡』公式X（旧Twitter）アカウント（@KAIJINFUGEKI_WM）をフォロー</strong></li><li> ※「#灰仭巫覡PV公開」「#カイジンフゲキ」のハッシュタグが付いたポストが目印です。</li></ol><p> 2025年9月5日（金）0:00 〜 2025年9月14日（日）23:59まで</p><p> 利用規約に同意し、日本国内にお住まいで郵便物・宅配物の受け取りが可能な方。</p><p><em>注意事項：色紙には当選者の宛名が記載されます。当選者にはXのダイレクトメッセージにて連絡があります。</em></p><p> 『灰仭巫覡』コミックス第1巻から第5巻まで好評発売中です。</p>","contentLength":1404,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【速報】戌神ころね、ホンダのeスポーツ大会アンバサダーに2年連続で就任！→本人も「よろしくお願いします」と意気込み「世界の戌神」「今年もきた！」","url":"https://hololive-tsuushin.com/holonews/korone-22/","date":1787929200,"author":"ホロミ","guid":815,"unread":true,"content":"<p>人気VTuberグループ「ホロライブ」所属の戌神ころねさんが、本田技研工業（Honda）が主催するeモータースポーツのグローバル大会「Honda Racing eMS 2025」の公式アンバサダーに、昨年に引き続き就任したことが発表されました。</p><p>このニュースに、ファンからは「2年連続はすごすぎる！」「今年も応援します！」といった声が相次いでいます。</p><p>「Honda Racing eMS」は、世界3地区（アジア・オセアニア、米州、欧州・中東・アフリカ）のトップドライバーたちが地域最速の座をかけて競い合う、本格的なeモータースポーツのグローバル大会です。</p><p>戌神さんは「Honda Racing eMS 2024」でもアンバサダーを務めており、今回で2年連続という大役を担うことになります。</p><p>ゲーム実況で人気を誇る戌神ころねと、世界のHondaとのコラボが再び実現しました。</p><p>2025年8月26日、Honda Racing eMSの公式X（旧Twitter）アカウントが「━ Honda Racing eMS 2025 開催 ━ 昨年に続き『戌神ころね』が公式アンバサダーに！」とポストし、戌神さんのアンバサダー就任を正式に発表。</p><p>あわせて、されるという大会スケジュールも公開しました。</p><p>この公式発表に対し、戌神さん本人も自身のXアカウントで「今年もアンバサダーを務めさせていただきます！よろしくお願いします」と引用ポストし、就任への意気込みを表明しました。</p><p>この就任のニュースに、ファンからは「世界のHondaに認められた女、戌神ころね」「ころさんの影響力すごい！」「これを機にレースゲームに挑戦してみようかな」など、驚きと喜びのコメントがありました。</p>","contentLength":1872,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブ3期生、Kアリーナ横浜で2DAYSライブ開催決定！「#きゅるるん大作戦」チケット受付開始","url":"https://hololive-tsuushin.com/schedule/arena/","date":1768654613,"author":"ホロミ","guid":1223,"unread":true,"content":"<p>「ホロライブ」所属の3期生（兎田ぺこら、不知火フレア、白銀ノエル、宝鐘マリン）によるライブイベント「hololive 3rd Generation Live #きゅるるん大作戦 〜最強アイドル、推すしかないでしょ〜」を、に「Kアリーナ横浜」にて開催することを発表しました。</p><p>本ライブは、「ホロライブ」所属の3期生4名が出演するライブイベントです。</p><p>本日10月19日（日）21:00より、現地会場指定席チケットの1次先行（hololive FANCLUB先行 / 抽選）が開始されるとともに、「ABEMA」「SPWN」「ZAIKO」にて配信チケットの販売も開始されました。</p><p>チケット情報などライブの最新情報は、下記特設サイト及び開催概要をご確認ください。</p><h3>hololive 3rd Generation Live #きゅるるん大作戦 〜最強アイドル、推すしかないでしょ〜 概要</h3><p> hololive 3rd Generation Live #きゅるるん大作戦 〜最強アイドル、推すしかないでしょ〜 主催：カバー株式会社</p><p> 兎田ぺこら 不知火フレア 白銀ノエル 宝鐘マリン</p><p>DAY1 ： 2026年1月17日（土） 開場 16:30 / 配信開始 17:30 / 開演 18:00<p>DAY2 ： 2026年1月18日（日） 開場 15:30 / 配信開始 16:30 / 開演 17:00</p></p><p> Kアリーナ横浜 （〒220-8507 神奈川県横浜市西区みなとみらい6丁目2−14）</p><p> 最寄り駅 〇新高島駅 みなとみらい線4臨港パーク口より徒歩5分 <p>〇みなとみらい駅 みなとみらい線2いちょう通り口より徒歩12分 </p></p><ul></ul><p>※お1人様2枚までお申し込み可能です。 ※チケット氏名印字あり。</p><p><strong>■1次先行（hololive FANCLUB先行 / 抽選）</strong></p><ul><li>受付期間：2025年10月19日（日）21:00 ～ 2025年10月29日（水） 23:59</li><li>当選確認期間・入金期間：2025年11月5日（水）15:00 ～ 2025年11月9日（日）23:00</li><li>※お申し込みには、hololive FANCLUBへの入会が必要となります。</li><li>※別途手数料（先行サービス料440円、システム利用料330円、電子チケット利用料110円）がかかります。</li></ul><ul><li>受付期間：2025年11月13日（木）21:00 ～ 2025年11月23日（日）23:59</li><li>当選確認期間・入金期間：2025年11月28日（金）15:00 ～ 2025年12月1日（月）23:00</li><li>※別途手数料（先行サービス料440円、システム利用料330円、電子チケット利用料110円）がかかります。</li></ul><ul><li>受付期間・発券開始：2025年12月14日（日）12:00 ～</li><li>※別途手数料（システム利用料330円、電子チケット利用料110円）がかかります。</li></ul><ul></ul><p> 2025年10月19日（日）21:00 ～ 2026年2月18日（水）20:00</p><p> 公演終了後、公開準備ができ次第アーカイブ視聴可能となり、2026年2月18日（水）23:59 まで何度でもご視聴いただけます。 ※2026年2月18日（水）23:59 を過ぎると、アーカイブ視聴中でも視聴できなくなります。 ※プラットフォームごとに別途手数料が発生する場合があります。</p><p>本公演開催に合わせ、本日10月19日（日）よりhololive 3rd Generation Live #きゅるるん大作戦 〜最強アイドル、推すしかないでしょ〜のライブグッズが解禁されました。</p><p> 2025年10月19日（日）21:00 ～ 2025年11月25日（火）18:00 まで</p><p>販売期間や注意事項・詳細は、公式HPの販売ページなどをご確認ください。</p>","contentLength":3444,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"角巻わため、20人超え新年会で見せた成長―「昔はコミュ障だった」過去を告白","url":"https://hololive-tsuushin.com/holonews/watame-34/","date":1768102920,"author":"風歌","guid":1724,"unread":true,"content":"<p>ホロライブ所属の角巻わためさんが自身の配信で、白上フブキさん、大神ミオさん、大空スバルさんが行った”おもてなし凸待ちホロ正月配信”での出来事を振り返りました。20人を超えるメンバーが集まった新年会に参加した角巻さんは、充実した時間を過ごしたことを報告。かつて「コミュ障で喋れなかった」という過去を明かしつつ、今では積極的に会話できるようになった自分の変化を実感したといいます。</p><p>角巻さんは配信で、新年会の様子を語りました。クリスマスは仕事で忙しく、どこにも行けずケーキもチキンも食べられなかったという寂しい思いをしていたため、今回はようです。角巻さんは、」と語り、。筑前煮、みたらし団子、チップスター、チーズケーキなど、様々な料理を楽しんだといいます。</p><p>特に筑前煮については、花形に切ってある人参をはじめ、レンコンやこんにゃく、椎茸など多くの食材が入っており、「手間かかってる！」と感心しながらも、　</p><div><div><div><div><p><strong></strong>のは内緒だよ</p></div></div></div></div><p>新年会では椅子が全員分なく、ビンゴ大会が始まる際にメンバーが集まった時のこと。癒月ちょこさんが椅子に座っていたところ、角巻さんをというエピソードも披露されました。</p><p>「わためは自分から行くタイプではないので」と前置きしつつ、</p><p>とドキドキしながら座っていたと告白。ビンゴ大会では、なかなか数字が揃わず「」とブツブツ言っていた様子ですが、その声が周囲にもよく聞こえていたといいます。</p><p>配信では、こうした大人数のオフコラボに参加できるようになった自分の成長について、</p><div><div><div><div><p>昔だったら喋れてなかったと思うんだけど、</p><p><strong></strong>からいっぱい喋れた</p></div></div></div></div><p>さらに「コミュ障の過去知らない」というリスナーのコメントに対し、「昔はコミュ障だった」と回答。</p><div><div><div><div><p>そっから多分また喋れなくなったんだよな。これ喋らない方がいいかもって</p></div></div></div></div><p>そんな角巻さんを変えたのは、周囲のメンバー達だったといいます。「」と感謝を述べ、「<strong></strong>」と語りました。</p>","contentLength":2363,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"「壁ばかり見てるから心配で…」大空スバル、響咲リオナへの”親心”が爆発 あえて無茶ぶりをした「独り立ち」への深い愛情","url":"https://hololive-tsuushin.com/holonews/subaru-81/","date":1768101091,"author":"ホロミ","guid":1730,"unread":true,"content":"<h2>「涙がちょちょ切れそうになる」壁を向く後輩・リオナへの想い</h2><p>26人のホロメンが次々と訪れるという大変な企画を終え、「久しぶりにあんな汗かく企画したな」と振り返るスバルさん。自身も緊張していたというこの企画の中で、特に印象に残っているのが響咲リオナさんの存在だったようです。</p><p>スバルさんは、普段から控えめな性格のリオナさんが頑張って話している姿を見ると「」と語りました。</p><p>いつもは「壁を向いている」と表現するほど大人しいリオナさんに対し、「大丈夫かお前」と心配しつつも、今回の企画にはスバルさんから「もし良かったらなんだけど来るか？」と事前に声をかけていたことを明かしました。</p><p>「また”お母さん”なのかもしれねえ」と、自身の感情が母親のような目線になっていることに苦笑いを見せました。</p><h2>あえて厳しく？「DEV_IS」として外の世界へ羽ばたくために</h2><p>なぜ、あえて内向的なリオナさんを大勢の目に触れる場に呼んだのか。その理由についてスバルさんは、今後「hololive DEV_IS」としての活動が広がっていくことを見据えた、先輩としての愛ある厳しさだったと語ります。</p><p>ホロライブというグループの中にいるうちは先輩たちがカバーできるものの、今後案件やイベントなどで外部へ行く機会が増えれば、一人で立ち回らなければならない日が来ます。</p><div><div><div><div><p>「リオナ、お前そろそろね、3Dももらったし、独り立ちの時が来てるぞ」</p></div></div></div></div><p>この考えに至った背景には、スバルさん自身の経験があります。デビュー当時は何もできず、多くの先輩に面倒を見てもらってここまで来られたという感謝があるからこそ、「次は自分が後輩にしてあげる番だ」という意識が芽生えているようです。</p><p>また、リオナさんが「今年はコミュ障を治す」と目標を掲げていることについても触れました。</p><p>スバルさんは、リオナさんのいわゆる”コミュ障”は、単に話せないわけではなく、周りに気を使いすぎることによるものだと分析。「」と肯定しました。</p><p>かつて自身が何も考えずに発言して「失言王」になりかけた過去を引き合いに出し、「気遣いができることは素晴らしいこと」と、後輩の慎重な性格を尊重しつつエールを送りました。</p><p>先輩としての責任感と、後輩への温かい眼差しが伝わってきた今回の振り返り配信。スバルさんの「親心」を受け、響咲リオナさんが今後どのような成長を見せてくれるのか楽しみです。</p>","contentLength":2896,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】兎田ぺこら、『ポケモン クリスタル』5時間の激闘が“全消滅” 人生縛り配信でまさかの「電池切れ」結末に","url":"https://hololive-tsuushin.com/holonews/pekora-95/","date":1768100342,"author":"ホロミ","guid":1729,"unread":true,"content":"<p>VTuberグループ・ホロライブ所属の兎田ぺこらさんが1月10日、自身のYouTubeチャンネルにて『ポケットモンスター クリスタルバージョン』の実況配信を実施。しかし、レトロゲーム特有のトラブルにより、すべてのプレイデータが失われるという衝撃的な結末を迎えました。</p><p>この日の配信でぺこらさんは、瀕死になったポケモンを二度と使用できないという高難易度ルール「人生縛り」を掲げてゲームをスタートしました。</p><p>相棒には草タイプの「チコリータ（ニックネーム：チータロウ）」を選択。不利と言われる草タイプを選びながらも、持ち前のゲームセンスで順調に進行し、ジムバッジを2つ獲得するまで誰も失うことなく進めていました。懐かしの名作を楽しむぺこらさんの様子に、コメント欄も大いに盛り上がりを見せていました。</p><p>悲劇が起きたのは配信開始から約5時間が経過した頃でした。</p><p>ゲーム内でレポート（セーブ）を行おうとしたところ、正常に記録ができない事態が発生。原因はゲームソフト（カートリッジ）の「内蔵電池切れ」でした。ゲームボーイカラー時代のソフトは、セーブデータを保持するためにカートリッジ内の電池を使用しており、これが切れていると電源を切った瞬間にデータが消えてしまいます。</p><p>結果として、ジムリーダーを倒し、仲間を育て上げた5時間の冒険は幻となってしまいました。</p><h2>◆「数年後にリベンジさせて」ファンからは励ましと笑い</h2><p>配信終了後、ぺこらさんは自身のX（旧Twitter）を更新。「申し訳ございません…内蔵電池が切れておりレポートが書けない状況ぺこでした；；」とファンに謝罪し、「数年後にリベンジさせてください！」と、電池交換など準備を整えての再挑戦を誓いました。</p><p>このあまりにレトロゲームらしいな幕切れに、ファンからは「これぞぺこーら」「セーブの大切さを学んだ」「悲しいけど笑ってしまった」といった反響が寄せられています。</p><p>レトロゲーム配信ならではのハプニングでしたが、次回のリベンジ配信では万全の状態で「チータロウ」との再会が見られることを期待しましょう。</p>","contentLength":2524,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【2026年01月11日】ホロライブ イベント告知ポストまとめ","url":"https://hololive-tsuushin.com/holonews/111/","date":1768098956,"author":"ホロミ","guid":1727,"unread":true,"content":"<p>xより2026年01月11日にポスト・リポストされた内容を元にイベントの内容に絞ってご紹介します。膨大なポストを遡っている故、見逃してしまっているイベントもあるかと思いますがご容赦ください。</p><h3>9th Anniversary Party開催決定</h3><p>2026年11月7日(土)、ぴあアリーナMMにて「ときのそら 9th Anniversary Party」の開催が発表されました。キャッチコピーは「夢は、ひとつ先のステージへ。」です。</p><p>1月11日19:00より「はじめの日2026」としてホロライブ歌枠の配信が行われます。新曲MVの公開や、その他発表も予定されているとのことです。</p><h3>MMORPG「幻想神域 Echo of Cube」コラボ配信</h3><p>1月11日(日)21:00より、MMORPG「幻想神域 Echo of Cube」のPR配信が行われます。序盤のメインストーリープレイや、協力プレイでのダンジョン挑戦が予定されています。</p><p>NHKラジオ第1にて放送の「ぶいあーる！」にレギュラーMCとして出演。ゲストにはにじさんじ所属の緑仙、ギルザレンIII世が登場しました。</p><p>1月11日(日)13:00より、GeoGuessrで100回正解するまで終わらない耐久配信が行われます。100GUESS達成後の最後に「告知」があることが予告されています。</p>","contentLength":1351,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】大神ミオ、トワ・すいせい・姉街との「九州旅行」エピソードを披露！ トワ様の“鬼教官”ぶりやまさかの事故も","url":"https://hololive-tsuushin.com/holonews/mio-56/","date":1768064890,"author":"ホロミ","guid":1726,"unread":true,"content":"<p>ホロライブ所属のVTuber大神ミオさんが、動画内でメンバーとのプライベート旅行のエピソードを語りました。</p><p>常闇トワさん、星街すいせいさん、そしてすいせいさんの実姉である「姉街」さんという異色の4人組で九州へ向かった一行。行き当たりばったりの珍道中や、車内で発揮されたトワさんの意外な一面など、仲の良さが伝わる旅行となりました。</p><p>ホロライブゲーマーズの大神ミオさんが、自身の配信枠で先日行ってきたという九州旅行の裏話を披露しました。メンバーはミオさん、常闇トワさん、星街すいせいさん、そして姉街（星街すいせいの姉）さんという、本人曰く。</p><p>ハウステンボスと博多を目的に長崎へ降り立った4人ですが、実は飛行機と宿以外はほぼノープラン。現地での移動手段すら決めておらず、急遽レンタカーを借りることに。</p><p>運転手には大神ミオさんが立候補しましたが、ここで意外な才能を発揮したのが助手席に座った常闇トワさんでした。 トワさんは</p><div><div><div><div><p>「ミオちゃん、次何メートル先で右だから右車線入っておいて」「車間距離気をつけてね」</p></div></div></div></div><p>と、まるで鬼教官のようにテキパキと指示出し。ミオさんもと、その頼もしさを絶賛していました。</p><p>道中ではAIならではのハプニングも発生。 車のナビの音声認識機能を使って目的地「ハウステンボス」を設定しようとしたところ、あろうことかナビが「天国に行きたい」と誤認識。 これには車内も騒然とし、と音声入力を諦める事態となり、笑いに包まれたようです。</p><h2>4人乗り自転車で柵に激突？ ハウステンボスでの悲劇</h2><p>無事にハウステンボスに到着した一行は、広大な敷地を移動するために4人乗りの自転車をレンタル。 しかし、路面が荒れていた場所でハンドルを取られてしまい、そのまま柵に突っ込んでしまうというアクシデントが発生。と振り返るミオさんですが、そんなトラブルも含めて景色や散策を楽しんだ様子でした。</p><h2>佐世保バーガーをシェアハピ、BGM担当はすいちゃん</h2><p>その後は博多へ移動し、もつ鍋や明太子などのグルメを満喫。 移動中の車内では、どうしても佐世保バーガーが食べたいという星街すいせいさんがダッシュでバーガーを買いに行き、みんなでシェアしながら食べたというほっこりエピソードも。</p><p> 運転中はすいせいさんがDJとなって好きな音楽を流し、トワさんがナビをし、後部座席で姉街さんが乗っているという、賑やかで自由なドライブ旅行となったようです。</p><p>大神ミオさんは<strong></strong>と満足げに語り、配信を締めくくりました。</p>","contentLength":3015,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ホロライブが東京駅一番街に登場！2026年新春ポップアップショップ開催情報","url":"https://hololive-tsuushin.com/schedule/2026-2/","date":1768062277,"author":"ホロミ","guid":1725,"unread":true,"content":"<p>カバー株式会社が運営する「ホロライブプロダクション」のオフィシャルポップアップショップが、2026年1月9日（金）より東京駅一番街にて期間限定で開催されます。</p><p>今回は、描き下ろしイラストを使用したグッズ販売に加え、購入者特典の配布や会場限定の特別装飾などが実施されます。ホロライブ、ホロライブインドネシア、ホロライブEnglishから計11名のタレントが参加するイベントの内容をまとめました。</p><p>まずは忙しい方向けに、開催期間や場所などの基本情報を箇条書きでまとめます。</p><ul><li>イベント名：hololive production OFFICIAL POP UP SHOP</li><li>開催期間：2026年1月9日（金）～ 1月22日（木）</li><li>営業時間：10:00 ～ 20:30（※最終日1月22日のみ18:00終了）</li><li>入場方法：特定日時は事前抽選予約制（LivePocket利用）</li><li>特典：期間により絵柄が変わるポストカードなど全4種</li></ul><p>今回のポップアップショップには、以下の11名が参加します。グループの垣根を超えたラインナップとなっています。</p><ul><li>ホロライブ（0期生）：ときのそら / ロボ子さん / AZKi / さくらみこ / 星街すいせい</li><li>ホロライブインドネシア：アユンダ・リス / ムーナ・ホシノヴァ / アイラニ・イオフィフティーン</li><li>ホロライブEnglish：森カリオペ / 小鳥遊キアラ / 一伊那尓栖</li></ul><p>混雑を避けるため、初日や週末を含む特定の日時では「LivePocket」を使用した事前抽選による予約制が導入されます。以下の日時に来場を予定している方は、必ず申し込み期間や注意事項をご確認ください。</p><ul></ul><p>※上記以外の時間帯や平日については自由に入場できる可能性がありますが、混雑状況によっては整理券の配布などが行われる場合があります。詳しくは公式サイトや各予約ページをご確認ください。</p><p>期間中、店舗にて商品を購入された方を対象に、さまざまなノベルティが用意されています。特に「ポストカード」と「クリアカード」は開催期間の前半と後半で絵柄が切り替わるため注意が必要です。</p><ul></ul><ul><li>オリジナルショッパー（全1種）\n</li><li>メッセージカード（全3種 / ランダム）\n<ul></ul></li><li>ポストカード（全11種 / ランダム）\n<ul></ul></li><li>クリアカード（全11種 / ランダム）\n<ul></ul></li></ul><p>※すべての特典は先着順となり、なくなり次第終了となります。</p><p>物販エリアだけでなく、東京駅一番街全体を使った展示企画も行われます。</p><ul><li>：参加タレントたちが起用された特別装飾がストリートを彩ります。</li><li>：描き下ろしイラストを使用した等身大パネルが展示され、フォトスポットとしても楽しめます。</li><li>：購入特典として配布される「メッセージカード」にタレントへの応援メッセージを記入し、その場でメッセージボードに貼ることができます。</li></ul><p>ファン同士の交流や記念撮影も楽しめるイベントとなっていますので、東京駅にお立ち寄りの際はぜひ足を運んでみてはいかがでしょうか。</p>","contentLength":3295,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】兎田ぺこら、サカナクション・山口一郎のゲーム配信に衝撃「今年のライバルは…」 一流アーティストの“配信者”としての姿勢に感銘","url":"https://hololive-tsuushin.com/holonews/pekora-94/","date":1767981340,"author":"ホロミ","guid":1723,"unread":true,"content":"<p>ホロライブ所属のVTuber兎田ぺこらさんが、<a href=\"https://www.youtube.com/watch?v=W0UTOL87kMU\">9日の配信中</a>にロックバンド「サカナクション」の山口一郎さんのゲーム実況を視聴した際のエピソードを披露。一流アーティストが見せた意外な一面と、配信者としての姿勢に感銘を受けたことを明かしました。</p><p>VTuberグループ・ホロライブ所属の「兎田ぺこら」さんが、自身の配信枠にてサカナクションのボーカル・山口一郎さんのYouTube活動について言及。「勉強になった」「相手がデカすぎる」とその衝撃を語りました。</p><h2>◆スーパーチャットへの丁寧な対応に「気を引き締めなきゃ」</h2><p>ぺこらさんは最近、山口一郎さんがYouTubeでゲーム配信を行っていることを知り、視聴したとのこと。そこでまず驚かされたのが、視聴者への対応の丁寧さでした。</p><p>山口さんはゲームプレイ中であっても、スーパーチャット（投げ銭）が送られるたびに「〇〇さんありがとうございます」と即座に反応し、丁寧に読み上げていたといいます。</p><p>これを見たぺこらさんは「ぺこらも読める時は読むようにしているけど、もっとちゃんとしなきゃと気付かされた」と反省。自身も配信活動に長く携わっていますが、改めて初心を思い出し、気を引き締めるきっかけになったと語りました。</p><h2>◆「格好つけてると思ってた」アーティストの意外なハイテンション</h2><p>また、配信中の山口さんのテンションの高さにも驚愕したといいます。</p><p>ぺこらさんが視聴した際、山口さんはアクションパズルゲーム『Human: Fall Flat』をプレイ中でした。ぺこらさんは当初、一流アーティストの配信ということで「格好つけたり、気取ったりしているのかな？」という先入観を持っていたそうです。</p><p>しかし実際には、「乗ってけ、乗ってけ！」とハイテンションで叫びながら、ふにゃふにゃのキャラクターを操作して楽しそうに遊ぶ姿がありました。そのギャップに対し「全然そんなことなかった。楽しそうにやっていてびっくりした」とコメント。アーティストとしてだけでなく、一人のゲーマーとして純粋に楽しむ姿に好感を抱いたようです。</p><h2>◆「今年のライバルはサカナクション？」芸能界からの参入に危機感も</h2><p>配信の最後には、昨今のYouTube事情についても言及。「今まではテレビに出ている芸能人と、ネットで活動する自分たちは別枠だと思っていた」と吐露しつつ、有名人が当たり前のように配信界に進出してくる現状に「正直、生配信ですらヤバいぜ」と危機感を募らせました。</p><p>「今年のライバルはサカナクションか……いや、デカすぎ。相手がデカすぎる」と笑いを誘いつつも、業界の変化を肌で感じている様子のぺこらさん。</p><p>最後には「『宝島』の時の掛け声を生で聴いてみたい」と、サカナクションのライブへの憧れも口にし、「死ぬまでに一度は行ってみたい」とリスペクトを送っていました。</p>","contentLength":3386,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"「一番くじ ホロライブ ～Villain Style～」が2026年1月10日より発売決定！","url":"https://hololive-tsuushin.com/schedule/%e3%80%8c%e4%b8%80%e7%95%aa%e3%81%8f%e3%81%98-%e3%83%9b%e3%83%ad%e3%83%a9%e3%82%a4%e3%83%96-%ef%bd%9evillain-style%ef%bd%9e%e3%80%8d%e3%81%8c2026%e5%b9%b41%e6%9c%8810%e6%97%a5%e3%82%88%e3%82%8a/","date":1767970800,"author":"ホロミ","guid":880,"unread":true,"content":"<p>VTuberグループ「ホロライブ」の新たな一番くじ、「一番くじ ホロライブ ～Villain Style～」の発売が決定しました！</p><p>今回のテーマは「Villain Style」。いつもとは一味違った、ダークで魅力的なホロライブメンバーの姿が描かれることが期待されます。ファンにとっては見逃せないラインナップとなりそうです。</p><ul><li> 一番くじ ホロライブ ～Villain Style～</li><li> 2026年01月10日(土)より順次発売予定</li></ul>","contentLength":508,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ときのそら、史上最大規模のワンマンライブを東京国際フォーラムで開催決定！「夢が叶った！」「絶対行く！」とファン歓喜","url":"https://hololive-tsuushin.com/schedule/sora-18/","date":1767970800,"author":"ホロミ","guid":1115,"unread":true,"content":"<p>ホロライブプロダクション所属のVTuber「ときのそら」さんが、自身の活動史上最大規模となるワンマンライブの開催を発表。　</p><p>ホロライブ0期生としてVTuberシーンの黎明期から業界を牽引してきた「ときのそら」さんが、にて、ワンマンライブ「New Year’s Party 2026『Dreams in Motion』」を開催することを発表しました。</p><p>ときのそらさんにとって史上最大規模となる本公演でSNSではファンから「国際フォーラムはすごすぎる！」「そらちゃんの夢がまた一つ叶う瞬間に立ち会えるなんて…」といった歓喜の声が相次ぎました。</p><h4>“そらとも”と共に描く「Dreams in Motion」</h4><p>今回のライブは、ときのそらさんが毎年開催している恒例のニューイヤーパーティ、通称「そらぱ」の特別版。</p><p>公演タイトルの「Dreams in Motion（ドリームズ・イン・モーション）」には、夢に向かって歩み続けるときのそらさん自身と、その姿を見守り、応援し続けるファン＝“そらとも”の想いが込められているとのこと。</p><p>本公演は、昼公演＜Day＞と夜公演＜Night＞の2部構成で開催。それぞれ異なる演出が期待されています。</p><p>チケットは、最前エリアが確約され、Tシャツや無線制御ペンライト、限定ボイスなどの豪華特典が付いたSS席（¥18,800）から、学生にも優しい学割チケット（¥5,150）まで、幅広い券種が用意されています。</p><p>また、遠方のファンに向けた配信チケットも販売され、こちらも限定グッズ付きのプランが用意されるなど、すべての“そらとも”が楽しめる配慮がなされています。</p>","contentLength":1827,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】さくらみこ、罰ゲームの『Jump King』を33時間越えで完全制覇！次は“失踪”していた『エルデンリング』を最初から","url":"https://hololive-tsuushin.com/holonews/miko-69/","date":1767931759,"author":"ホロミ","guid":1722,"unread":true,"content":"<p>ホロライブ所属のVTuber・さくらみこさんが1月9日、高難易度アクション『Jump King』をついにクリアしました。年末から続いていた罰ゲーム企画を見事完遂し、次なる挑戦として『ELDEN RING（エルデンリング）』の再走を宣言しています。</p><p>VTuberグループ「ホロライブ」所属のさくらみこさんが1月9日、自身のYouTubeチャンネルでの配信にて、高難易度で知られるアクションゲーム『Jump King』をクリアしました。</p><p>本企画は、2025年末に行われたゲーム対決の「罰ゲーム」としてスタートしたものですが、最終的には33時間を超える壮絶な内容となりました。</p><h2>リオナとの「GOD並走」敗北から始まった地獄の登山</h2><p>今回の『Jump King』挑戦は、2025年12月30日に実施された「GOD並走対決」が発端です。</p><p>対戦相手であるリオナさんとの勝負に敗れたさくらみこさんは、罰ゲームとしてこの“登頂”を開始。年末年始をまたいで行われた配信は、幾度もの落下と沼を繰り返す過酷なものとなりました。</p><p>1月9日、ついに頂上へ到達したさくらみこさん。クリア画面に表示されたリザルトは、その激闘ぶりを物語っていました。</p><ul></ul><p>約5万回ものジャンプと、3,800回近い落下。心が折れそうになる局面を何度も乗り越え、頂上にいる「ぴちぴちギャル」との対面を果たしました。コメント欄では「みこちおめでとう！」「諦めない心がすごすぎる」と、長時間の激闘を称える声が多数寄せられています。</p><h2>次は“失踪復活シリーズ”！ 『エルデンリング』を最初から</h2><p>感動のフィナーレを迎えたのも束の間、さくらみこさんは今後の配信予定について驚きの発表を行いました。</p><p>次にプレイするのは、フロム・ソフトウェアのアクションRPG『ELDEN RING（エルデンリング）』。実は以前、クリア直前まで進めていながら、諸事情により配信が止まってしまっていたタイトルです。</p><p>今回はその続きからではなく、「復活シリーズ」と銘打ち、とのこと。</p><p>『Jump King』で鍛え上げられた不屈の精神で、狭間の地を攻略できるのか。さくらみこさんの新たな「全ロス」と「勝利」の冒険に注目が集まります。</p>","contentLength":2496,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"【ホロライブ】兎田ぺこら、3期生ライブの収録裏話でスタッフからまさかの配慮？「エッチな感じだけど大丈夫ですか」","url":"https://hololive-tsuushin.com/holonews/pekora-93/","date":1767925896,"author":"ホロミ","guid":1721,"unread":true,"content":"<p>ホロライブ所属のVTuber兎田ぺこらさんが、1月8日の配信で、もうすぐ開催される3期生ライブの準備中にあったスタッフとのやり取りについて話しました。</p><p>VTuberグループ・ホロライブの兎田ぺこらさんが1月8日、自身の配信で来週末に開催される『hololive 3rd Generation Live #きゅるるん大作戦 〜最強アイドル、推すしかないでしょ〜』に向けた収録の裏話を披露しました。その中でも特に注目を集めているのが、レコーディング時のスタッフとのやり取りです。</p><p>1月17日・18日にKアリーナ横浜で開催される3期生ライブの準備として、ある楽曲のコーラス収録を行っていた時のお話です。</p><p>ぺこらさんによると、その曲は「とある方」のカバー曲で、コーラス部分を自分で歌う必要があったとのこと。その時、スタッフからおそるおそる確認が入ったそうです。</p><p><strong></strong></p><p>その曲のコーラスには少し色っぽいニュアンスが含まれていたようで、スタッフは「本人の音源を使うのでも全然大丈夫ですけど」と、ぺこらさんが歌いたくなければ無理に歌わなくても良いと提案してくれたそうです。</p><p>これに対してぺこらさんは、と即答したといいます。</p><p>ぺこらさんは当時を振り返り、<strong>「そうやって気遣われることあるんだと思ったよね。普通に当たり前にコーラス録るかなと思ったけど」</strong>と、スタッフの配慮に驚いた様子。この珍しいやり取りを、「ライブ前でもネタバレにならないかな」と確認した上で、リスナーに共有しました。</p><p>また、気になるライブのセットリスト（曲目）についても触れられました。</p><p>具体的に何の曲を歌うかは明かしませんでしたが、<strong>「24時間配信の休憩中とかに流れてた曲は、まあやるのかもね。わからないけど」</strong>と、ぼかしたコメントを残しています。</p><p>以前行った長時間配信の休憩時間に流していたMVや楽曲の中に、今回のライブで歌う曲が含まれている可能性をほのめかしました。「まあそれはみんなに聴いといてもらいたい」と予習を勧めつつも、「セットリストを言うと怒られる。情報漏洩でクビになっちゃう」と笑いながら、当日までのお楽しみであることを強調しました。</p>","contentLength":2540,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"星街すいせい、新曲「月に向かって撃て」が新作アニメ『真夜中ハートチューン』OPテーマに決定！","url":"https://hololive-tsuushin.com/schedule/suisei-49/","date":1767660795,"author":"ホロミ","guid":1262,"unread":true,"content":"<p>ホロライブ所属のVTuber、星街すいせいの新曲「月に向かって撃て」が、2026年1月より放送開始となるTVアニメ『真夜中ハートチューン』のオープニングテーマ（OP）に決定したことが発表されました。</p><p>本日、TVアニメ『真夜中ハートチューン』の公式X（旧Twitter）アカウント（@anime_mayochu）にてPV第2弾が公開され、あわせて主題歌情報が解禁となりました。星街すいせいが歌う「月に向かって撃て」が、本作のオープニングを飾ります。</p><p>なお、エンディングテーマ（ED）はSoalaさんの「声の軌跡」に決定しています。</p><p>TVアニメ『真夜中ハートチューン』は、2026年1月6日(火)23時より、カンテレ・フジテレビ系全国ネット“火アニバル!!”枠、BS朝日ほかにて放送開始予定です。</p>","contentLength":899,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["hololive"]}