{"id":"HuuaCwcKuiEjAMVMpsC8m1j7hPJY54E2MYHo8W8uVQXFN147Mq5MwA3N49roRwCQJzW","title":"Blackship","displayTitle":"Blackship updates","url":"https://blackship.canny.io/api/changelog/feed.rss","feedLink":"https://blackship.canny.io/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":2,"items":[{"title":"Japan Post suspends shipments to the U.S. starting August 27th","url":"https://blackship.canny.io/changelog/japan-post-suspends-shipments-to-the-us-starting-august-27th","date":1756278390,"author":"Joanna Kochanowska","guid":864,"unread":true,"content":"<p>We want to inform you about an important change affecting shipments to the United States via Japan Post.</p><p>On , the U.S. government issued an executive order, “Termination of De Minimis Treatment for All Countries,” eliminating duty-free treatment for certain imports. Starting , goods imported for personal use will be subject to tariffs and additional customs requirements.</p><p><strong>Due to these changes and unclear customs procedures, Japan Post will temporarily suspend the acceptance of the following items for shipment to the United States beginning August 27, 2025:</strong></p><ul><li>Individual gifts with a content value exceeding USD 100</li><li>Goods intended for sale or consumption</li></ul><p>Because Blackship ships from a company to individuals, Japan Post services will no longer be available for most shipments to the United States until further notice.</p><p>However, printed materials such as books and magazines can still be shipped via Japan Post. At the moment, Printed Matter Airmail is the only Japan Post shipping option available for shipments to the U.S. through Blackship.</p><p><strong>Alternative Shipping Options</strong></p><p>Shipments to the U.S. can still be sent using our international courier partners: FedEx and DHL. These carriers remain fully operational and are unaffected by the Japan Post suspension.</p><p>You can find the original Japan Post announcement <a href=\"https://www.post.japanpost.jp/int/information/2025/0825_01_en.html\" rel=\"ugc nofollow noopener noreferrer\" target=\"_blank\">here</a>. </p><p>You can find more information about the Changes to U.S. Duty Exemptions <a href=\"https://blackship.canny.io/changelog/new-us-japan-trade-deal-changes-to-us-duty-exemptions\" rel=\"ugc noopener noreferrer\" target=\"_blank\">here</a>.</p><p>Thank you for your continued support. We will keep you informed as the situation evolves and share any further updates from Japan Post as they become available.</p>","contentLength":1549,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New US-Japan Trade Deal + Changes to U.S. Duty Exemptions","url":"https://blackship.canny.io/changelog/new-us-japan-trade-deal-changes-to-us-duty-exemptions","date":1756180888,"author":"Joanna Kochanowska","guid":863,"unread":true,"content":"<p>We wanted to share two important updates that may impact your future proxy orders from Japan.</p><p><strong>US-Japan Trade Deal Highlights</strong></p><p>The US and Japan have just signed a <strong>major new trade agreement</strong>. Here’s what it could mean for your shopping:</p><ul><li><strong>15% Tariffs on Japanese Goods</strong>: U.S. importers (both individuals and businesses) will be required to pay a 15% tariff on Japanese products, which will increase the total amount you have to pay.</li><li><strong>Price Fluctuations are Possible</strong>: Japanese markets are rising, a sign that brand pricing may adjust in response to trade changes.</li></ul><p>You can still shop from Japan as usual. We’re monitoring developments and will let you know if anything changes.</p><p><strong>DHL Japan: Upcoming Change to U.S. Duty-Free Exemptions</strong></p><p>DHL Japan has informed us of a major update from the U.S. government that could impact how customs duties are applied to your orders:</p><p>Effective August 29 at 12:01 a.m. EDT, all shipments to the US, regardless of origin, will no longer qualify for De minimis (duty-free) treatment.</p><ul><li> will now be subject <strong>to all applicable U.S. duties</strong>, including general tariffs and those under special trade laws.</li><li>Informal entry (for shipments under USD $2,500) may still apply, but this is not yet confirmed.</li></ul><p> The following will still be duty-free:</p><ul><li>Gifts under USD $100 sent from an individual overseas to a U.S. individual.</li><li>Personal belongings/household goods valued under  brought in by travelers.</li></ul><p>We’ll keep you posted as more details emerge.</p><p>Thank you for your continued trust in Blackship. We value your business and are working diligently to navigate these changes together.</p>","contentLength":1577,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["merch"]}