{"id":"MvwLKznkcWQMsFKxgFcA7T269YxenCSxhT7CKDZwL","title":"Vtuber Sensei","displayTitle":"VTuber Sensei","url":"https://vtubersensei.com/feed/","feedLink":"https://vtubersensei.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Cover Corp Announces Record Revenue for FY2025","url":"https://vtubersensei.com/2025/05/13/cover-corp-announces-record-revenue-for-fy2025/","date":1747132395,"author":"Thomas Toblu","guid":314,"unread":true,"content":"<p>Cover Corp is the company behind the global VTuber sensation hololive. The company has just released its <a href=\"https://contents.xj-storage.jp/xcontents/AS05169/b9e4294f/6359/4987/a8b5/2781f127f519/20250513153043984s.pdf\">financial report for FY2025/3 (April 2024–March 2025)</a>. It was a record-breaking year. There was massive growth across all sectors of the business. This includes concerts and streaming. It also covers trading cards and global licensing deals.</p><p>If you’re a VTuber fan, a business enthusiast, or just curious about the industry’s booming numbers, this article breaks it all down for you.</p><p><a href=\"https://vtubersensei.com/2025/02/12/cover-corps-latest-financial-report-strong-growth-and-exciting-developments/\">Cover’s Last Quarterly Report</a></p><p><a href=\"https://vtubersensei.com/2025/03/12/anycolors-q3-report-record-growth-in-livestreaming-and-commerce/\">Anycolor’s Latest Quarterly Report</a></p><h2>Key Takeaways at a Glance</h2><h2>A Year of Explosive Growth</h2><p>Cover Corp reported total revenue of , a whopping  over the previous year. This growth wasn’t isolated to one area. Instead, it was spread across all major revenue streams:</p><figure><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table></figure><p>This performance blew past Cover’s revised earnings forecasts, driven by merchandise, global concerts, and licensing expansion.</p><h2>Merchandising: The Star Player</h2><p>Merchandise, especially the <strong>hololive Official Card Game (TCG)</strong>, was a key driver. The TCG was launched in . It exceeded expectations in sales and community engagement. Over  participated in related events like store tournaments and fan meetups.</p><p>Beyond cards, Cover ramped up retail distribution. They diversified their product offerings to include everything from apparel and plushies to made-to-order VTuber anniversary goods.</p><ul><li>TCG revenue was the highest ever for a single product line.</li><li>Total shipments hit  (up +48% YoY).</li><li><strong>Q4 merchandise sales alone</strong> reached ¥6.28 billion (+42.3% YoY).</li></ul><h2>Concerts and Events: Going Global</h2><p>hololive has fully embraced its status as a global entertainment brand. This year saw the  and a second North American live concert for hololive English.</p><ul><li>15 concerts held globally (up from 10 last year)</li><li>520,000 visitors total (+53% YoY)</li><li>hololive SUPER EXPO and 6th Fes hit  with 260,000 fans</li></ul><p>The blend of digital stardom with real-world engagement helped boost fan loyalty and revenue. Large-scale concerts at prestigious venues like Nippon Budokan and Ariake Arena elevated the brand to new heights.</p><h2>Streaming and Content: Still the Core</h2><p>Streaming remains the backbone of Cover’s IP-building efforts. Revenue here grew by  as both new and legacy talents expanded their reach.</p><ul><li>2,792 average monthly unique users (+36.7%)</li><li>118,953 total videos produced (+29.6%)</li><li>Music exposure skyrocketed—VTubers like  sang anime theme songs, including one for <em>Mobile Suit Gundam GQuuuuuuX</em>.</li><li>, , and  ranked among the <strong>top five most-watched female streamers worldwide</strong>, even outside the VTuber space.</li></ul><h2>Licensing and Collaborations: Expanding Beyond Otaku Culture</h2><p>Cover grew its licensing portfolio significantly, closing deals with major players across diverse industries:</p><ul><li><strong>Sony PlayStation (30th anniversary ad)</strong></li></ul><p>Their new <strong>North American business base</strong> began operation mid-year and helped onboard more overseas partners. The number of corporate partners rose from .</p><h2>Holoearth and Digital Expansion</h2><p>The long-awaited  metaverse platform hit a major milestone in April 2025. This was marked by the launch of the . It lets fans create and trade fashion items and stamps.</p><ul><li>Avatar tracking via webcam in development</li><li>Upcoming virtual concerts and meet-and-greets with VTubers</li></ul><ul><li>Holoearth development started showing on the books this year</li><li>¥500M in amortization costs (expected to double in FY2026/3)</li></ul><p>Cover’s profit margins stayed healthy despite increased expenses from events and R&amp;D:</p><figure><table><tbody><tr></tr><tr></tr></tbody></table></figure><p>The company maintains strong cash flow, providing flexibility for investments and future acquisitions.</p><h2>Looking Ahead: FY2026/3 and Beyond</h2><p>Cover expects continued growth in FY2026/3, with projected revenue of . However, it anticipates  due to:</p><ul><li>Increased upfront investments in overseas expansion</li><li>R&amp;D for new content delivery systems and streaming technologies</li><li>Development costs for Holoearth and game projects</li></ul><p><img src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f4c9.png\" alt=\"📉\">: Operating profit forecast is only slightly higher at ¥8.2B (+2.5%).</p><p>Cover isn’t just growing—it’s aiming to become a core player in the global content market.</p><ul><li>Estimated market size: ¥105B</li><li>Global content market: ¥123.6T</li></ul><p>Cover’s plan is to grow VTubers into a transmedia IP force rivaling anime, games, and traditional influencers.</p><h3>Key Expansion Strategies:</h3><ul><li>Localized merchandise and logistics in NA and Asia</li><li>Joint anime/game projects</li><li>Global TCG expansion (English version coming)</li><li>More strategic alliances and potential M&amp;A activity</li></ul><h2>The People Behind the Vision</h2><p>Under the leadership of  and a seasoned management team, Cover has been scaling rapidly. Recent structural changes introduced new Senior Vice Presidents overseeing merchandising, overseas development, VTuber production, and metaverse initiatives.</p><p>With nearly , the company is growing fast—and smart.</p><h2>Anti-Defamation and ESG Measures</h2><p>Cover took action on  over the past year to protect its talents. It also joined major industry associations like:</p><ul><li><strong>Japan Online Game Association</strong></li><li><strong>Music Publishers Association</strong></li><li><strong>Safer Internet Association</strong></li></ul><p>Their anti-defamation study group (in collaboration with Google and other VTuber agencies) continues to push for healthier online ecosystems.</p><h2>Final Thoughts: A New Era for Virtual Entertainment</h2><p>Cover Corp’s FY2025/3 report paints a picture of a company that’s not only expanding rapidly but also  itself.</p><ul><li>Investing in creator tools and digital platforms</li><li>Strengthening their global footprint</li><li>Building a diversified, multi-billion-yen business</li></ul><p>With the success of hololive and their expanding content empire, Cover is poised to achieve great things. They are ready to redefine what it means to be an entertainment company in the 21st century.</p><p>Whether you’re a fan, investor, or business observer, one thing is clear. The VTuber revolution is just getting started. Cover is at the front of the parade.</p><ul></ul>","contentLength":5686,"flags":null,"enclosureUrl":"https://2.gravatar.com/avatar/21366946cf9a06f2d52c2c9bb01025b3782e7b9ad804152dd14c5b0b2c2c5291?s=96&d=identicon&r=G","enclosureMime":"text/html","commentsUrl":null}],"tags":["VTubers"]}